{"data":{"type":"posts","id":"10835","attributes":{"number":826,"createdAt":"2021-04-13T13:36:46+00:00","contentType":"comment","contentHtml":"<p>Hello there, I am writing about the unprofessional company by the name of \"FalixNodes Limited\"<br>\nthe owner (ItzAwesome, Pamar, Lamaker, LeonS, Lily) for whatever reason does not trust his own<br>\nmanagement team to control the nodes or have pterodactyl administration access. Why do management<br>\nneed this access? Well, since the owner (ItzAwesome, Pamar, Lamaker, LeonS, Lily) is honestly so<br>\nlazy and has the sleeping schedule of a newborn baby sleeps a-lot. The nodes/daemon goes down<br>\nand causes a huge fuss in the server. What is the point of having a management team if there is<br>\nno such thing as \"managing\" the platform? Also, the owner (ItzAwesome, Pamar, Lamaker, LeonS, Lily)<br>\nstarted FalixNodes at the age of 12, according to the Discord Terms of Service, you are not to be<br>\nusing Discord under the age of 13. FalixNodes V1 however was run by a 12 year old which is why<br>\nthe owner of FalixNodes (ItzAwesome, Pamar, Lamaker, LeonS, Lily) has a huge scamming history.<br>\nDid you know FalixNodes closed twice without any notice? This is because there was so many problems<br>\nand drama that the 12 year old owner (ItzAwesome, Pamar, Lamaker, LeonS, Lily gosh he has so many names<br>\nat this point) couldn't take the heat.</p>\n\n<p>Following onwards, recently in the month of April, there has been a huge raid in the FalixNodes Discord<br>\nserver where an approximation of around the figure of 5 thousand or more members were banned. How did this<br>\nhappen? Well, the owner of FalixNodes (ItzAwesome, Pamar, Lamaker, LeonS, Lily) gave out a role to an<br>\nex-falixnodes executives alternative account and when that user left FalixNodes, (I'll just call Lamaker<br>\nby his legal name at this point which is Niks) Niks had forgotten about the * role he gave to that members<br>\nalternative and thought nothing of it. Now back to this day, the ex-falixnodes executive had his alternative<br>\naccount token hacked or something alike and resulted in the raid of falixnodes. But guess what? I, HussGB<br>\nwas blamed for this raid, why? Because I was on not so good terms with the owner and staff, to make myself<br>\neven more suspicious I had the * role myself too. But if you were to request my audit logs from the FalixNodes<br>\nDiscord server, there is no proof of me giving out permissions to any of the members who contributed to the raid<br>\nof FalixNodes. I don't even know why people like Korbs or Chirag or other staff members blame me for the raid<br>\nwhen they could check audit-logs themselves.</p>\n\n<p>Forwarding a few days after the raid, there was a database leak, where some hacker had managed to get into the<br>\nFalixNodes database and leak all the information onto nulled.co if you want to see for yourself you can<br>\n&lt;a href=\"<a href=\"https://t.co/0UNZ2a1gQA?amp=1%22%3Eclick\" rel=\" nofollow ugc\">https://t.co/0UNZ2a1gQA?amp=1\"&gt;click</a> here&lt;/a&gt; to view the FalixNodes database leak. Guess who was blamed<br>\nfor the database leak? ME (HussGB)! I had nothing to do with any of the raids or leaks of FalixNodes and for some<br>\nreason I am now a security concern in the server when there is honestly no proof at all of me doing any of the<br>\nraiding or database leaking. In-fact the person who is behind all of the leaking and raiding and stuff is soon<br>\ncoming out with a huge statement that will hurt the reputation of FalixNodes.</p>\n\n<p>Oh and yes, I know Niks is reading this. I have a question for you; why are you letting Korbs<br>\n(member of your management) get away with his one star reviews on trustpilot and calling the host unprofessional, <br>\nbut when I was doing exactly what Korbs did, I was banned from the server and put at a security concern level in<br>\nthe FalixNodes Discord server. Let me copy exactly what Korbs said at the end of his review:</p>\n\n<p>\"Also Lamaker, the owner of FalixNodes, needs to step down from the company. Because of drama.gg, Lamaker is hurting <br>\nthe brand of this company. Also, Exotical legally owns FalixNodes last time I checked.\" - Korbs</p>\n\n<p>I honestly still don't know why FalixNodes is in partnership with Korbs Studio as his article is technically public<br>\nshaming to Niks reputation and FalixNodes. But yeah, I agree with Korbs even though I despise him.</p>\n\n<p>Staff on FalixNodes are having a blast; enjoying abusing their power on people ever since I have left the team. I was the<br>\nstaff that sorted out a lot of staff drama by telling the staff to shut the f*** up and do their unpaid job.</p>\n\n<p>Hmm, I'm looking forward for my third ban and block by Lamaker for doing exactly what Korbs just did. If he does<br>\nban me from FalixNodes, it just shows how he's letting a management member who still had authority in the Discord,<br>\ndespise FalixNodes get away trouble-free from what he's done compared to a late member of the server (me, HussGB).</p>\n\n<ul><li>HussGB. Last edited at 13/04/2021 at 14:27 British Summer Time (BST)</li></ul>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"38"}},"discussion":{"data":{"type":"discussions","id":"34"}},"likes":{"data":[{"type":"users","id":"2864"},{"type":"users","id":"3163"},{"type":"users","id":"3179"},{"type":"users","id":"3291"},{"type":"users","id":"3340"}]},"mentionedBy":{"data":[{"type":"posts","id":"10841"},{"type":"posts","id":"10852"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"38","attributes":{"username":"Hussjs","displayName":"Hussjs","avatarUrl":null,"slug":"Hussjs","joinTime":"2020-07-20T14:49:45+00:00","discussionCount":0,"commentCount":15,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-01-04T21:03:44+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"2864","attributes":{"username":"leastile","displayName":"leastile","avatarUrl":"https://drama.gg/assets/avatars/hrZzqfDkPKOK6y0p.png","slug":"leastile"}},{"type":"users","id":"3163","attributes":{"username":"FatGrizzly","displayName":"FatGrizzly","avatarUrl":"https://drama.gg/assets/avatars/iS888BblAzGJgvnV.png","slug":"FatGrizzly"}},{"type":"users","id":"3179","attributes":{"username":"honk","displayName":"honk","avatarUrl":"https://drama.gg/assets/avatars/sSMWNbIdNt1e9Ckk.png","slug":"honk"}},{"type":"users","id":"3291","attributes":{"username":"Willypro7","displayName":"Willypro7","avatarUrl":"https://drama.gg/assets/avatars/6ejKNQiaajcKH8Zi.png","slug":"Willypro7"}},{"type":"users","id":"3340","attributes":{"username":"SnowMan","displayName":"SnowMan","avatarUrl":"https://drama.gg/assets/avatars/TGn8bZVZAgpzsbtp.png","slug":"SnowMan"}},{"type":"users","id":"2951","attributes":{"username":"Chirag","displayName":"Chirag","avatarUrl":"https://drama.gg/assets/avatars/EBu92nGgi2Y9tYOD.png","slug":"Chirag"}},{"type":"discussions","id":"34","attributes":{"title":"Lamaker/ItzAwesome/Lily/Pamar | FalixNodes/Falix.gg & PrimeSRV","slug":"34-lamakeritzawesomelilypamar-falixnodesfalixgg-primesrv","isApproved":true}},{"type":"posts","id":"10841","attributes":{"number":830,"createdAt":"2021-04-13T18:37:39+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/34/826\" class=\"PostMention\" data-id=\"10835\">Hussjs</a> Thanks for the info, never knew that falix was a scam, and illegal company</p>"},"relationships":{"user":{"data":{"type":"users","id":"3291"}},"discussion":{"data":{"type":"discussions","id":"34"}}}},{"type":"posts","id":"10852","attributes":{"number":840,"createdAt":"2021-04-13T21:20:09+00:00","contentType":"comment","contentHtml":"<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/34/826\" class=\"PostMention\" data-id=\"10835\">Hussjs</a> Also, the owner (ItzAwesome, Pamar, Lamaker, LeonS, Lily)<br>\nstarted FalixNodes at the age of 12, according to the Discord Terms of Service, you are not to be<br>\nusing Discord under the age of 13. FalixNodes V1 however was run by a 12 year old</p></div></blockquote>\n\n<p>About that, I agree it was wrong.<br>\n<img src=\"https://drama.gg/assets/files/2021-04-13/1618348801-346372-screenshot-2021-04-14-02-47-48-40.jpg\" title=\"\"></p>\n"},"relationships":{"user":{"data":{"type":"users","id":"2951"}},"discussion":{"data":{"type":"discussions","id":"34"}}}}]}