{"data":{"type":"posts","id":"10892","attributes":{"number":866,"createdAt":"2021-04-14T10:01:42+00:00","contentType":"comment","contentHtml":"<p>OK im making this thread cuz its too much one of the immature Staff called ASS i mean Ash has literally no sense. One guy in falix said Management and Staff is trash which is true and straight up facts. He did factual critisim there. He was muted for Staff Disrrespect. Why? That wasnt even staff disrespect he didnt target a specific staff he said a community is trash for eg if you say humans are trash everyone will be like yes they are and when someone calls them trash they get offended. which is a hypocrite behaviour. And the Ash says e was disrespecting staff when he targeted a community of people not a single person and plus yes Falix staff sucks. Ash says rule 15 which is common sense when he dosent have one to understand difference between hate and critisim. And now that ash is just Staff and he is making unexisting rules and muting/abusing when someone memtions drama.gg in the chat. Thats not even rule and he says its misleading. How is it misleading? just because of some posts? then I can say all boys/girls are same cuz one made mistake. Plus he is from India so I should have expected that. And now he will be like dont disrespect my country. Dude I have rights to critise anyone its not North Korea. I can critise and say bad about anyone its your job to reply or shut yourself. Cuz everyone knows indian teens are soo immature and illogical (this line is not for all its to 80%. Cuz some of them are actually cool). And you dont have freedom of speech and rights to critise in falix. Now I know why every old staff left falixnodes and im resigning too. Now finally I realised Mitu, Withdrawl aka derp, jeekie were true about it.</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"2801"}},"discussion":{"data":{"type":"discussions","id":"34"}},"likes":{"data":[{"type":"users","id":"2864"}]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"2801","attributes":{"username":"DeadBush","displayName":"DeadBush","avatarUrl":"https://drama.gg/assets/avatars/XbjcjyJPwRXjAX5J.png","slug":"DeadBush","joinTime":"2020-09-13T20:26:47+00:00","discussionCount":16,"commentCount":295,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-10-07T06:26:03+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"I'm DeadBush","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"2864","attributes":{"username":"leastile","displayName":"leastile","avatarUrl":"https://drama.gg/assets/avatars/hrZzqfDkPKOK6y0p.png","slug":"leastile"}},{"type":"discussions","id":"34","attributes":{"title":"Lamaker/ItzAwesome/Lily/Pamar | FalixNodes/Falix.gg & PrimeSRV","slug":"34-lamakeritzawesomelilypamar-falixnodesfalixgg-primesrv","isApproved":true}}]}