{"data":{"type":"posts","id":"12072","attributes":{"number":952,"createdAt":"2021-04-24T11:08:13+00:00","contentType":"comment","contentHtml":"<p>This host is literally like meeting some dodgy geezer in the underpass who's established a company with £100 capital and giving them gift cards; no valid contracts (they don't seem to be in English to me at all; the terms are something about a \"port\"), any positive background (or even non-negative) or professionalism (we've even seen their employees leave 1-star reviews on Trustpilot). I am not using their services, but I am happy that at least they do not offer paid services as if you were to actually pay these folks, I mean, you must be the most insane person on earth. Obviously, they can't operate this way, especially with the extremely low security and privacy standards (if any) that appear to be set in place. It just feels like some kids watched an HTML tutorial on YouTube and got hyped up to create a platform and since it somehow works it should be all good, I mean they <em>even hash the passwords</em>, what more can you ask for? If you're looking for a free 24/7 Minecraft server one could suspect you are trying to do something at a bigger scale and if your hosting provider of choice for that is the dodgy geezer instead of one of the first 10 pages of search results on Google it just feels like you just want to risk it all and go with a provider as this one which by the way we have seen issue notices to back up all your data due to a next-day network-wide data wipe. I mean, come on, do you really see it work somehow? You'd have a x10 better server on Server.pro with 10 plugins, 1 hour uptime and a free subdomain lol, I mean at least you won't be worried your data is being publicly available to anyone at any time, the <em>professional</em> support is 12 yo kids, and your data is ready to be purged at any given time, but not a time of your choosing obviously. They are telling you not to worry because they are improving, but someone please remind me for how long they've been operating already</p>","editedAt":"2021-04-24T11:16:53+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"discussion":{"data":{"type":"discussions","id":"34"}},"likes":{"data":[{"type":"users","id":"30"}]},"mentionedBy":{"data":[{"type":"posts","id":"12076"}]},"reactions":{"data":[]}}},"included":[{"type":"discussions","id":"34","attributes":{"title":"Lamaker/ItzAwesome/Lily/Pamar | FalixNodes/Falix.gg & PrimeSRV","slug":"34-lamakeritzawesomelilypamar-falixnodesfalixgg-primesrv","isApproved":true}},{"type":"users","id":"30","attributes":{"username":"Triassic","displayName":"Triassic","avatarUrl":"https://drama.gg/assets/avatars/vpuY80JJaf7LHX7q.png","slug":"Triassic"}},{"type":"users","id":"3329","attributes":{"username":"NickE","displayName":"NickE","avatarUrl":null,"slug":"NickE"}},{"type":"posts","id":"12076","attributes":{"number":953,"createdAt":"2021-04-24T11:43:33+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/34/952\" class=\"PostMention\" data-id=\"12072\">WilliamD</a> <br>\nhe does offer paid hosting</p>"},"relationships":{"user":{"data":{"type":"users","id":"3329"}},"discussion":{"data":{"type":"discussions","id":"34"}}}}]}