{"data":{"type":"posts","id":"12438","attributes":{"number":28,"createdAt":"2021-04-27T06:07:35+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/419/1\" class=\"PostMention\" data-id=\"12411\">Falixx</a> What you don't understand is that this community is going to be toxic. People are going to get harassed, it's just the nature of the server.</p>\n\n<p>The server does have DDoS Protection too &amp; Sloth and Nathan were working on extra rules to prevent downtime. People attack it because they don't like it, fair enough.</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"2846"}},"discussion":{"data":{"type":"discussions","id":"419"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"12454"},{"type":"posts","id":"12486"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"2846","attributes":{"username":"Tomas","displayName":"Tomas","avatarUrl":"https://drama.gg/assets/avatars/Q5hYhqTjdnQtMn8K.png","slug":"Tomas","joinTime":"2020-09-30T17:57:04+00:00","discussionCount":5,"commentCount":568,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-09-15T22:15:04+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":"NYU8LnXdpP6H51yK.jpg","cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"my cover is a cars meme I found on facebook","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"2","attributes":{"username":"Sloth","displayName":"Sloth","avatarUrl":"https://drama.gg/assets/avatars/6BdW7QU4UtMZIKtd.png","slug":"Sloth"}},{"type":"discussions","id":"419","attributes":{"title":"Drama.gg/Winterhoax/Summer","slug":"419-dramaggwinterhoaxsummer","isApproved":true}},{"type":"posts","id":"12454","attributes":{"number":44,"createdAt":"2021-04-27T06:14:59+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/419/28\" class=\"PostMention\" data-id=\"12438\">Tomas</a>... Hmmmm............................. Still, this is just something.</p>"},"relationships":{"discussion":{"data":{"type":"discussions","id":"419"}}}},{"type":"posts","id":"12486","attributes":{"number":62,"createdAt":"2021-04-27T08:19:11+00:00","contentType":"comment","contentHtml":"<blockquote class=\"uncited\"><div><p>@1#12411 First of all, Drama.gg is just a bunch of kids (in the ages of under 15), who think they are \"exposing\" companies, harassing hosts, just joining &amp; harassing them</p></div></blockquote>\n\n<p>We do not condone harassment in the slightest, some people do join their Discord servers or chat with their support, however, it's just them asking questions most of the time. Some people do go on to annoy the host's staff, yet we do not condone this at all, and once reported to us, will be investigated.</p>\n\n<blockquote class=\"uncited\"><div><p>@1#12411 2nd, their website is DDoSed soo much, &amp; they don't even probably have DDoS protection.</p></div></blockquote>\n\n<p>We're using OVH Game protection on our backend, and have a Path.net proxy in place (which we have taken out of production temporarily due to a fatal issue in Nathan G's mitigation software), Nathan G created mitigation software for us, which pretty much mitigated it all, once this is back in production, our site should be pretty safe from these attacks.</p> \n\n<blockquote class=\"uncited\"><div><p>@1#12411 They also have soo much toxic members[.]</p></div></blockquote>\n\n<p>This is due to the nature of our site, it's about Drama, and no matter how we enforce our guidelines, there will be toxicity, that's been true since the early days of WinterHoax, and will be true till the end. If we went ahead and banned anyone who violates any of our rules, we'd need to ban 90% of our community. The site's called <strong>Drama</strong>.gg, toxicity is something we just need to deal with.</p>\n\n<blockquote class=\"uncited\"><div><p>@1#12411 [L]egit, they don't provide real claims, they just start cursing to the people, they start harassing people.</p></div></blockquote>\n\n<p>Jedrik and I look through almost all Threads to the best of our abilities, checking if valid proof is provided, and if not we let people know to attach proof or their Thread/Post would be removed. We edit insults out of Posts when we find them, due to the entire staff team living in about the same region it is difficult to monitor all Threads, considering that we are humans and can't spend three hours a day looking through Threads, editing out insults. If you see this happen, feel free to report it to us, and we'll take action.</p>\n\n<blockquote class=\"uncited\"><div><p>@1#12411 Look back on the threads.</p>\n\n<p>They also make a lot of false claims, such as these (not to mention the mods don't give a f****)</p></div></blockquote>\n\n<p>As I said above, we only keep Threads and Posts up which provide valid proof. We don't spend our entire day looking through this, we have lives too, ya' know, and if you see someone accusing something without proof, <strong>report it to us</strong>, I can't stress this enough.</p>\n\n<blockquote class=\"uncited\"><div><p>@1#12411 <a href=\"https://drama.gg/d/394-atlas-hosting-they-dont-know-how-to-run-a-host/44\" rel=\" nofollow ugc\">https://drama.gg/d/394-atlas-hosting-they-dont-know-how-to-run-a-host/44</a> (it's legit, fake &amp; people join &amp; harras them, 2nd of all, they were just confused)</p></div></blockquote>\n\n<p>According to what I can see, it looks like that host was missing legal info and lying about their node specs, that isn't a good look on a host, and once they got called out for it did not do anything to resolve their issue. Looks pretty ignorant to me, and looks like a valid Thread.</p>\n\n<blockquote class=\"uncited\"><div><p>@1#12411 <a href=\"https://drama.gg/d/415-nicke-mcs-hosting-ltd-over-allocating\" rel=\" nofollow ugc\">https://drama.gg/d/415-nicke-mcs-hosting-ltd-over-allocating</a> (Mcs Hosting LTD has already responded to all the claims)</p></div></blockquote>\n\n<p>They did not, and a case where NickE leaked a customer's information just came up, which isn't really great. NickE isn't a bad person, he's beloved by the majority of the community, however, it's still a valid Thread.</p> \n\n<blockquote class=\"uncited\"><div><p>@1#12411 <a href=\"https://drama.gg/d/405-nymetrocloud-no-tosbans-people-for-posting-emojis/2\" rel=\" nofollow ugc\">https://drama.gg/d/405-nymetrocloud-no-tosbans-people-for-posting-emojis/2</a> (Just fake)</p></div></blockquote>\n\n<p>The original poster deleted the original Post, which explained how the host in question stole a logo from another host without permission, the poster seems to have actually gotten exposed, which is quite funny to me, and reviewing the Thread again seems to have been resolved, which we have marked it as now.</p>\n\n<blockquote class=\"uncited\"><div><p>@1#12411 &amp; many more.</p></div></blockquote>\n\n<p>All the \"false Threads\" you provided weren't valid, if you want the team to go over a Thread again, to see if it's still valid, you can just report it to us and let us know, seriously, you may DM us on Discord, flag a Thread or Post right here on the forum, or just E-Mail us at <a href=\"https://hello@drama.gg\" rel=\" nofollow ugc\">hello@drama.gg</a> and we'll check it as soon as possible.</p>\n\n<blockquote class=\"uncited\"><div><p>@1#12411 It's hard for many hosts. And they just started and we are still learning and starting and we can’t take this. You guys make many small/new hosts quit.</p></div></blockquote>\n\n<p>The issue is that hosting is a delicate market, think about your clients, they trust your service with their data, and if you shut down after a month just like 90% of new hosts do, you take their data with you, which isn't fun for anybody. If you start a host, you'll get treated by one, and saying \"I'm still learning\" isn't a valid excuse, you have responsibilities. Drama.gg is to spread awareness about these companies, letting people know not to use/support these organizations. We're also not only for exposing hosts anymore, people expose certain people or game servers which scam or seem to be running not-so-legal things. New hosts may quit, but that's just their choice, they can decide whether to fix their issues and learn to responsibly run a host or quit the industry and spare people data loss and unnecessary stress.</p>\n\n<blockquote class=\"uncited\"><div><p>@1#12411 They admitted being under 15, try to find it on the drama.gg updates channel (which is a log)</p></div></blockquote>\n\n<p>Where? Jedrik and I are pretty open about our age, and personal information, and value transparency very highly, I don't see your point here.</p>\n\n<blockquote class=\"uncited\"><div><p>@1#12411 Look at your fucking Trustpilot: <br>\n<a href=\"https://www.trustpilot.com/review/www.winterhoax.com\" rel=\" nofollow ugc\">https://www.trustpilot.com/review/www.winterhoax.com</a><br>\n<a href=\"https://www.trustpilot.com/review/drama.gg\" rel=\" nofollow ugc\">https://www.trustpilot.com/review/drama.gg</a></p></div></blockquote>\n\n<p>As Jedrik explained before in layman's terms, \"those salty children are the same ones reviewing on there\". We do not really care about our Trustpilot pages, a website like this is bound to get reviewed badly by the people who got exposed by it, and the people which use it normally don't review it, cause why would they? You don't review services you use without being either asked to review it by the company, or have had a bad experience with it, and as we do not care about our Trustpilot, we don't ask people to review us.</p>\n\n<blockquote class=\"uncited\"><div><p>@12#12422 So ur harassing kids, man, that is just messed up.</p></div></blockquote>\n\n<p>These are kids who've had data breaches and suffered data loss, if you put thousand's of people's data at risk, you deserve to get something in return.</p>\n\n<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/419/19\" class=\"PostMention\" data-id=\"12429\">DeadBush</a> [...] gotta say you people harras nova a lot. [...]</p></div></blockquote>\n\n<p>She knows we're just joking around, I asked her if she knows it's just fun and games, and she clarified that doesn't take it seriously, and gets it. She's a pretty chill person, maybe a bit annoying at times but that's not something bad per se. She makes fun of us, we make fun of her.</p>\n\n<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/419/28\" class=\"PostMention\" data-id=\"12438\">Tomas</a> What you don't understand is that this community is going to be toxic. People are going to get harassed, it's just the nature of the server.</p></div></blockquote>\n\n<p>We can't do anything about this, we try to keep legitimate harassment off of this forum and our Discord server, however, we can not control how people act outside of our control. Once again, you can report this to us, we've stated this a dozen times already.</p> \n\n<p>I believe I've debunked all of your points, if you have anything to add, feel free to do so, we strive to keep Drama.gg an unbiased and open community, so if you have any feedback for us, for things which we can control, just let us know.</p>\n\n<p>And due to people apparently not being able to figure out how to contact us:</p>\n\n<ul><li><strong>Discord</strong> ─ feel free to DM us, our Discord usernames are Papi Jedrik#1666 and Sloth#0199.</li>\n<li><strong>E-Mail</strong> ─ send us an E-Mail at <a href=\"https://hello@drama.gg\" rel=\" nofollow ugc\">hello@drama.gg</a>.</li>\n<li><strong>Forum</strong> ─ if you wish to just report a Thread or Post, you may click the \"Flag\" button on the Thread or Post in question, and we'll take a look at it as soon as possible.</li></ul>"},"relationships":{"user":{"data":{"type":"users","id":"2"}},"discussion":{"data":{"type":"discussions","id":"419"}}}}]}