{"data":{"type":"posts","id":"16830","attributes":{"number":128,"createdAt":"2021-05-27T00:47:29+00:00","contentType":"comment","contentHtml":"<p>Hello, I am james.<br>\nI apologize on my actions and I hope any of those stuff never happen again.<br>\nI'm just here to point out that.<br>\n\"He raided rolled host and he stole their client theme.\" - was resolved by Daftscientist and me(james)<br>\n\"He owned many hosts and they always die, either he \"rebrands\" or he wipes nodes and start again.\" -</p>\n<ol style=\"list-style-type:decimal\"><li><p>I only owned one which was named VillageNodes, and the name just didn't fit our branding so we had to change the name to cubemc.host which is Daft's domain (He isn't involved in any of these.) also, VillageNodes.host domain was owned by a guy named GrimS.</p></li>\n\n<li><p>I have worked on DuoHost as Management Team(Owner) for amount of time, I was too stressed so I just left, and Daftscientist decided to close down DuoHost.</p></li>\n\n<li><p>So you heard about NeoCloud, I never worked on those, I asked for Aces to remove my role so many times. So probably some of you guys may think I owned it.</p></li>\n\n<li><p>Hirocloud was owned by me, but before opening I decided to change the name to AtomHost for better branding, since HiroCloud didn't really fit on anything. After changing to AtomHost, it was fully owned by NGX and I was just a management.</p></li>\n\n<li><p>I wiped the nodes by giving people a time to backup, and offering a backup to people who asked for their backups in tickets after wiping. I gave 24 hours of time, since I had no more funds to maintain the nodes.</p></li></ol>\n\n<p>\"A day ago i opened ticket i wanted to apply for staff and he immediately said \"hell nah\" and closed ticket, i opened ticket and asked whats problem he closed it again.\" - We told you that we currently are not in need of staff members since we had over 16. Then closed the ticket.<br>\nYou opened again, The reason why I said \"hell nah\" is because I have worked with you before, I know how much experience you have and how you work. so I just didn't want you work in WaffleHost.</p>\n\n<p>\"And couple minutes ago we were fighting in drama.gg discord and i just randomly see waffle host discord disappear.<br>\nHe banned me for no reason lmao.\" - I have full rights to ban you, There is no need to be reason If i just wanted to ban you.</p>\n\n<p>\"\"James\" had many names and accounts before this one.<br>\nHere are some that i remember : \"james/leo/shonfli/candy/dhiro and many more that i dont remember.\"\"</p>\n<ul><li>I just feel like changing name. candy was never my name, My name was D'Hiro for some joking purposes. and Shonfli is my minecraft username, Leo Boldoo is my nickname which people calls me for some reason, and James is my real name.</li></ul>\n\n<p>\"i can conferm DHiro owned duohost, i owned the domain and discord. but he managed it and dealt with winterhoax and owned the nodes, duohost used HIS paypal. i got no profits from it. DHiro took the money.\" <br>\nI didn't owned DuoHost, you did. I just paid for the nodes. and it used my PayPal because no one had any other way to store the money, If you wanted to use your paypal you could just ask for it. I took the money that I have invested into DuoHost, Total of 14$ one for 10$ on a node that I was owning and another one for 4$ on a node that I was owning too. and the 2 customers we're my friends, I refunded them.</p>\n\n<p>Again, I'm sorry RumGuru.<br>\nI hope this won't happen again.</p>","editedAt":"2021-05-27T00:53:43+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"3336"}},"editedUser":{"data":{"type":"users","id":"3336"}},"discussion":{"data":{"type":"discussions","id":"12"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"16848"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"3336","attributes":{"username":"DHiro","displayName":"DHiro","avatarUrl":"https://drama.gg/assets/avatars/SrN4hYHudc4LJz6a.png","slug":"DHiro","joinTime":"2021-04-06T02:11:45+00:00","discussionCount":4,"commentCount":125,"canEdit":false,"canDelete":false,"lastSeenAt":"2021-05-30T03:37:27+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"3257","attributes":{"username":"RumGuru","displayName":"RumGuru","avatarUrl":"https://drama.gg/assets/avatars/LfdbF5Ex7oM05L6h.png","slug":"RumGuru"}},{"type":"discussions","id":"12","attributes":{"title":"Nico/Potato Lord/Cole/James","slug":"12-nicopotato-lordcolejames","isApproved":true}},{"type":"posts","id":"16848","attributes":{"number":131,"createdAt":"2021-05-27T10:40:12+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/570/114\" class=\"PostMention\" data-id=\"16830\">DHiro</a> ok some of these are still false but ok idc<br>\n<a href=\"https://drama.gg/u/Jedrik\" class=\"UserMention\">@Jedrik</a> you can mark this as resolved if you want</p>"},"relationships":{"user":{"data":{"type":"users","id":"3257"}},"discussion":{"data":{"type":"discussions","id":"12"}}}}]}