{"data":{"type":"posts","id":"1787","attributes":{"number":41,"createdAt":"2020-09-14T04:20:56+00:00","contentType":"comment","contentHtml":"<p>Every winterhoax staff wants short explanations<br>\n: About 1 week ago DeadBush and me wanted to open a hosting but Ironic and Saini threatened to take it down if I do it with him. So 5 Days ago, I asked my brother if we could open a minecraft server hosting compnay, after I showed him how it all works, after an hour of explanation he agreed. I was taking help from Ironiic with the hosting. First month is when me and my brother wanted to see how exactly this works. Then I bought a 30gb VPS and 16 1gb ram servers were hosting on it and the reviews weren't bad at all. Obviously we would not give 30 1gb ram server so 26 was the limit. After that I needed domain so I asked Ironiic (who I thought was <strong>helping</strong> me) where I can get a good domain. (Before this he had been telling me that now Navo sells domains) Then I saw the price was 9.99€ for nexalhosting.com. After that I needed help with pterodactyl. I asked Ironiic who could do it for me and he said Electra does it for 20€ but as your a friend we will discount it and he will setup pterodactyl for 5€ lifetime. So I agreed. Now if I did it with deadbush, I'd have bought domain from namecheap.com who have the same price who I did not know about until deadbush and acktar told me. If I did it with deadbush, another person, a deadbush friend would be installing pterodactyl. So basically he threatened to shut down the host if I do it with deadbush because he knew that I'd buy stuff from him. I tried Free Hosting and it doesn't make much profit, I coded a coins system, kind of like falix for arc and stuff. Then yesterday I announced I'd do paid server <strong>after the 25th</strong> and the users who were kind enough to use coins which everyone needed to, would keep their server even though we would be paid. Then I made some prices calculating how much things cost and my results were cheap af and not like any other company, not even <strong>navo</strong>. After I asked my brother if the prices are good he said yes. Which I had asked on the channel were I noted the prices WHICH <strong>no longer exists</strong> because of IRONIIC Threatening me. He was always starting to get mad saying I am stealing his customers. But the customers he believed I \"stole\" were in his host because I gave it a shoutout on my youtube a while ago. Even the customer who he said I \"stole\" said that he found navo from my youtube and as they stopped doing free and I was doing free, he joined. I asked him to delete this as he would be getting into a lot more trouble than expected and for the good of both hostings and that we should go our seprate ways. He didn't agree and continued to tell me he will shut it down. When more people joined this discussion, he told me he would delete the post if I delete the host. I didn't agree as I worked hard on it and I was investing all the money I made off youtube. Then he said do free and I will delete the post and I said no. I asked if I did paid with better nodes <strong>(which is literally what I said I was doing and what I was doing)</strong> he continued to threaten me. Then I showed my brother all this and I went to sleep as I had school tmmrow at 8. Now when I am finishing writing this, its 6:14 am. I am not the only person threatened by Ironiic. There are a lot more like ItzToxicYT, DeadBush and Juanischicken. I even worked as a devloper on navo and made them a coins system for <strong>free</strong>. I also left that because I would be getting no profit frkm my hard work and made my own coins system that I was going to sell until I decided to make a hosting. Basically he has been mad that I am stealing his clients. OFC THEY WILL COME TO ME IF HE MAKES HIS HOSTING PAID AND TAKES THERE SERVER. He has been trying to keep me at free since and before I started hosting. Well thats what happened. And still I didn't do anything illegal and he took down my domain just because he could and he was mad that I broke a deal with electra which was that he would always have my root password. I told him I did thag because he would erase all the servers and he even said \"yes\". He made this saying I was doing that on a 10€ vps and he <strong>cut out</strong> the part where I said its after 25th. Thats all.</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"105"}},"discussion":{"data":{"type":"discussions","id":"81"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"5129"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"105","attributes":{"username":"AbisGamer","displayName":"AbisGamer","avatarUrl":"https://drama.gg/assets/avatars/r3CIX0CHVOcDltkB.png","slug":"AbisGamer","joinTime":"2020-08-26T22:14:14+00:00","discussionCount":1,"commentCount":50,"canEdit":false,"canDelete":false,"lastSeenAt":"2022-06-08T11:34:28+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"2801","attributes":{"username":"DeadBush","displayName":"DeadBush","avatarUrl":"https://drama.gg/assets/avatars/XbjcjyJPwRXjAX5J.png","slug":"DeadBush"}},{"type":"discussions","id":"81","attributes":{"title":"Nexal hosting","slug":"81-nexal-hosting","isApproved":true}},{"type":"posts","id":"5129","attributes":{"number":54,"createdAt":"2021-01-26T03:30:30+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/81/41\" class=\"PostMention\" data-id=\"1787\">AbisGamer</a> idk y im replying now but the story was true. I had a lot of ideas which ig they didnt like and manipulated abis to go with them. But Abis still has 1% fault which is eventhough I told him he will scam him. Even after getting scammed Abis still trusted him and went with him. And I heard now abis is demoted from GalaxyBe for illegal stuff which is told by Ironic aka jay and jay got the full ownership ig</p>"},"relationships":{"user":{"data":{"type":"users","id":"2801"}},"discussion":{"data":{"type":"discussions","id":"81"}}}}]}