{"data":{"type":"posts","id":"18614","attributes":{"number":1,"createdAt":"2021-06-09T00:54:09+00:00","contentType":"comment","contentHtml":"<p>You shouldn't be trying to operate a company, especially when handling sensitive information.<br>\nHold off on it, build your skills and contacts, and educate yourself.</p>\n\n<p>Want to run a IaaS/CaaS or hosting company in the future?<br>\nHere's some things you can do to prepare</p>\n\n<ul><li>Experiment\n <ul><li>Hop onto OVH, Azure or Linode and play around, build in <em>your</em> own enclosed and safe environment where you don't put people at risk and LEARN</li></ul></li>\n<li>Look into cloud services\n <ul><li>What technologies should you use, why, what platforms and services are better than others</li></ul></li>\n<li>Look into basic security best practices\n <ul><li>Basic security and systems management knowledge, things to make your life easier and protect yourself and any users you may have in the future</li></ul></li>\n<li>Learn basic fundamentals of operating systems, and specific operating systems\n <ul><li>Windows Server</li>\n <li>Debian</li>\n <li>Other *nix operating systems</li>\n <li>Don't bother with CentOS unless you plan on using RHEL in the future, which you probably won't</li></ul></li>\n<li>Learn about basic networking and infrastructure management\n <ul><li>Doesn't take that long to get the hang of the basics, it'll change your life when it comes to this stuff</li></ul></li>\n<li>Look into business management and finance\n <ul><li>You need knowledge of business to run a business surprisingly!</li>\n <li>For clarification this does include the law 😉</li></ul></li>\n<li>Stop the rise of social-media based businesses\n <ul><li>Don't run your business on Discord, it's stupid, build a healthy community sure but running service desks, billing and product delivery on a social platform is absolutely stupid</li></ul></li></ul>\n\n<p>AWS run some free courses for people in education, including ones about managing cloud and hybrid environments.<br>\nAlso check out Cybrary, Google, Coursera, LinkedIn Learn and Udemy for more free courses on specific and vague topics.</p>\n\n<p>AWS and Azure offer free tiers where you can experiment for 12 months, and GCP/Azure both offer 200usd in credits for between 1-3 months depending on the current offer and platform for you to play with.</p>\n\n<p>Can't be bothered to learn?<br>\nOutsource/Hire</p>\n\n<p>Whether it be <em>hiring</em> (not volunteering, actually paying people) people to fulfill roles you cannot or taking up the help of a company to do work for you- outsourcing is done all the time and you should consider it for anything you're not willing to learn or adapt to.</p>\n\n<p>Unrelated note why do skids constantly call bare metal 'dedis' and hosts/servers (whether they are physical or virtual) 'nodes' 🤡</p>","editedAt":"2021-06-09T01:09:52+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"3745"}},"editedUser":{"data":{"type":"users","id":"3745"}},"discussion":{"data":{"type":"discussions","id":"684"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"3745","attributes":{"username":"BrendansAtWork","displayName":"BrendansAtWork","avatarUrl":"https://drama.gg/assets/avatars/lI5oZqLlYljnneUl.png","slug":"BrendansAtWork","joinTime":"2021-05-30T19:44:10+00:00","discussionCount":2,"commentCount":54,"canEdit":false,"canDelete":false,"lastSeenAt":"2021-10-10T12:47:55+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":"tLcRDjrHIchvo8uQ.jpg","cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"Barista in the day, noc engineer at the night\nAll these mf 12 year old skids running hosting 'companies'\nWork email brendantdj@thatspretty.cool\nAny advice I give isn't on behalf of my company shithead","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"684","attributes":{"title":"Dear all you underage idiots","slug":"684-dear-all-you-underage-idiots","isApproved":true}}]}