{"data":{"type":"posts","id":"20361","attributes":{"number":56,"createdAt":"2021-07-04T14:02:11+00:00","contentType":"comment","contentHtml":"<p>anyways this is the full chat on announcement after the incident &lt;long message&gt;</p>\n\n<p><strong>꧁JavaCraft꧂ — 06/03/2021</strong><br>\n@everyone  First of all, to all our Client's that didn't get any response from us, there's a reason why we don't give you an answer, we know we need to keep updated our Client's about their servers,</p> \n\n<p>the reason why we chose to don't give you any responses this might be caused by a short of time,</p>\n\n<p>We've been monitoring what people might say about us!.</p>\n\n<p>Now I think this is the right time to give a response to our Client that their backup world didn't go pretty well to recover,</p>\n\n<p>we've seen a Meme this past moment, This post from Kyle <br>\nwe don't need to show her private identity, of course</p>\n\n<p>Now here's the meme he released about us!</p>\n\n<p>We used Azure! And Linode free Service?</p> \n\n<p>KyleNyoPagodNa#0111/KylePlays</p>\n\n<p>The Ans is False! we didn't use any free service,</p>\n\n<p>Then why is the IP located in Linode and Azure?</p>\n\n<p>Here's the thing we tried to use the Linode service for Business partnership!</p>\n\n<p>Now for the Azure!,</p> \n\n<p>We used Azure service for the reason of applying their network system using the Microsoft Server 2019 Web Service and Testing their System Using that OS ( Operating system )</p> \n\n<p>Then why PojavCraft IP Leaked to that Company,<br>\nHere is the answer; first of all, Due to the Overloaded system we have and over node usage we used in SG, we have to use Azure Product to work their Server due to,<br>\nits been four months ago since the pojavcraft  opened,</p>\n\n<p>then the IP/DNS you've been pointing out were Already pinned out last four months ago<br>\nJavaCraftHosting How about the Server We've paid for and the backup?</p>\n\n<p>There's an update about the Drive we've tried to recover. The SSD Drive Back up is Fully recovered,</p> \n\n<p>But bad news for other clients we cannot successfully recover your data, and we were sorry about that,</p>\n\n<p>List of Complete World Backup <br>\n\" Trek World \"<br>\n\" Kidzania \" <br>\n\" Crafter's Hangout SMP \"<br>\n\" EPH-World \" <br>\n\" Tulo Laway 5S \"<br>\n\" PojavCraft \" <br>\n\" Crafter SMP \" <br>\n\" Crafter's Lobby \" <br>\n\" Crafter's PE \" <br>\n\" NemoCraft / May 2 \"<br>\nDear<br>\n\" XION \" \"KIMPLAYZ \" \"BastaPangalan\" \"Sinichi\" \"JoshuaPH\" \" PrincePines \"</p>\n\n<p>Please accept my deepest apologies for my mistake regarding Lost Backup world and for not responding.</p>\n\n<p>It was not my intention to create such an awkward and embarrassing situation for all of my clients.<br>\nIf there was any good that came out of this unfortunate experience, I have grown and learned alternative approaches to these situations.<br>\nPlease feel free to let me know your thoughts and concerns over this matter. You can reach me at Discord \" ꧁JavaCraft꧂#7559 \" <br>\nSincerely,<br>\nJavaCraft</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"3379"}},"discussion":{"data":{"type":"discussions","id":"577"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"3379","attributes":{"username":"L4db","displayName":"L4db","avatarUrl":null,"slug":"L4db","joinTime":"2021-04-13T01:31:08+00:00","discussionCount":3,"commentCount":63,"canEdit":false,"canDelete":false,"lastSeenAt":"2022-07-15T13:27:01+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"your critic buddy, also any words of wisdom?","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"577","attributes":{"title":"JavaCraft Hosting | Discussion | Not Professionally enough?","slug":"577-javacraft-hosting-discussion-not-professionally-enough","isApproved":true}}]}