{"data":{"type":"posts","id":"2111","attributes":{"number":1,"createdAt":"2020-09-20T16:00:52+00:00","contentType":"comment","contentHtml":"<p>Note: This thread has been created with info provided by Endermined. A vague draft was written by me, however the majority is by Endermined. If you want to ask for additional info or anything related to this post, don't ask me, as I just created this thread for Endermined as he did not have the time to create a thread structure, and just filled in the blanks.</p>\n\n<h3>What is MarCloud?</h3>\n<p><a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud</a> is a 30+ Server Minecraft Network and free online file cloud provider run by a teenager, Marcel. It may look like a great server and service to the outside world, but inside it was filled with abuse, deception, hatred, ddosing, scamming, nulling and lying. This, is Endermined's story.</p>\n\n<h3>How it began</h3>\n<p>Endermined, ex-owner of <a href=\"https://hosting.hyeservices.com\" rel=\" nofollow ugc\">Hye Hosting</a>, now owner of <a href=\"https://heimsnet.eu\" rel=\" nofollow ugc\">Heimsnet</a>, ran a Minecraft Minigame Server Network called <em>Miners League</em>. Endermined was playing a bedwars game on his server with a friend, when a player named <em>Marcelektro</em> joined his server's lobby. Endermined promptly switched focus, joined the lobby server and greeted Marcelektro with a “Hello”. Marcelectro greeted back, and Endermined asked Marcelektro if he wanted to play a couple rounds of bedwars. Marcelektro however complemented Endermined’s custom lobby which he wanted to explore. What Endermined didn’t know at the time, was that Marcelektro was actually downloading his spawn world to use on his own server, MarCloud. After a while, Marcelektro joined the bedwars server (after downloading the lobby world). They played 5-10 rounds on Endermined‘s custom bedwars maps (while playing, Marcelektro continued to download these for his own use). Later, Marcelektro said he owned a server called <a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud.net</a> and he asked Endermined if he wanted to check it out. Endermined agreed and said sure! After looking at Marcloud, Endermined thought it was really cool. He joined the community, got to know it well, came to love it and became a part of it.</p>\n\n<p><em>2 weeks later</em></p>\n\n<p>Endermined once again joined <a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud.net</a> and started a round of bedwars, but instead of seeing other maps, he saw his own custom made maps, from <em>his</em> own server (the lobby map was actually not used here, but later on Marcelektro shows Endermined he had downloaded the spawn). Endermined messaged Marcelektro on Discord promptly, and told Marcelektro to remove the maps. This he did, however he didn't do it immediately, but only after a couple of weeks of repeatedly telling and invoking him to do so. After a while, Marcelectro somehow brought Endermined to become a manager at <a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud.net</a>, and the next two years of his life turned into the following:</p>\n\n<h3>The Abuse</h3>\n<p>Marcelektro always claimed everything on <a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud.net</a> to be custom coded, and before becoming a manager at MarCloud, Endermined believed it was custom coded, ran by a friendly owner (except the stealing maps part) and more, however that quickly changed. Staff was abused, told to download nulled plugins and website/forum themes, forced into running the entire server, ordered to lie and so much, much more.</p>\n\n<p><em>Jan Marinka</em><br>\nJan Marinka was forced into downloading all these nulled resources, and had to run <a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud.net</a> for <sub>2</sub> months, as Marcelektro had set his discord status to invisible. After a while, Jan Marinka resigned and after that framed by Marcelektro by him \"blowing up\" the lobby. Marcelektro of course blamed Jan Marinka and destroyed his image as co-owner at <a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud.net</a>. He did this as he was mad that he had to come out of hiding. As Endermined knew Jan Marinka personally, he just couldn't believe that it was him. So he started an investigation. Now, Endermined was actually next in line to be Jan Marinka's successor, but Marcelektro decided to have an election instead. After that a new election was ran for who gets the co-owner role on <a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud.net</a>. While this was ongoing Endermined temporarily stopped his investigations into the staged lobby grief as he was running for co-owner. The other candidate was Wolfo, but I will talk about the election later later.</p>\n\n<p><em>Red Haired Man</em><br>\nRed Haired was a propaganda person, told to say how awesome, custom coded and great everything is. Well he actually believes it. Marcelektro intentionally manipulated this and made him believe this propagandous material and he still believes in this propaganda to this day.</p>\n\n<p><em>Wolfo</em><br>\nWolfo was manipulated by Marcelektro during the election into hating Endermined, however I will touch on this later. Endermined and Wolfo are pretty much best friends today.</p>\n\n<p><em>Endermined</em><br>\nEndermined was also abused while the two year timespan of him working at <a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud.net</a>. He was yelled at, forced to do things he didn’t want to do, and more. He left multiple times but Marcelektro used what he learned from his psychology class brought him back every time.</p>\n\n<h3>The co-owner election</h3>\n<p>After Jan was framed, Marcelektro ran a election on who gets to become co-owner of the <a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud.net</a> Minecraft Server. Only Wolfo and Endermined ran. Wolfo was told by Marcelektro, that Endermined was a bad person, and Endermibed was told by Marcelektro that Wolfo was a bad person. Thatway he built up the competitiveness between the two. He would make up lies between the two constantly making them just hate each other until it turned into a big explosion. (Endermined won the election in a landslide)</p>\n\n<h3>Marcelektro</h3>\n<p>Deceptive, abusive, lying and overall incompetent server and service owner. I will talk about his free file sharing service and Minecraft server separately. <a href=\"enzonet.nl\" rel=\" nofollow ugc\">Enzonet.nl</a>, his own hosting company, run by Wolfo, later.</p>\n\n<p><em>MarCloud Minecraft Server</em><br>\nCompletely custom coded and running on a 64 core selg hosted server - this is false. He also stated on the servers playercount hover, that they were \"Partnered with Hye Hosting\", which he also stated in his discord (he was not partnered by any means). 96% of his servers are completely downloaded. The knock-it server is a perfect example of being completely downloaded, and only the scoreboard and branding has been changed. <a href=\"https://www.youtube.com/watch?v=q37iZxeQh8w\" rel=\" nofollow ugc\">Here</a> is the server he downloaded. He has claimed the Knock-It server is actually a custom gamemode he though of himself. He also \"custom coded\" his plugins, however they are not. You can notice with ease that they are downloaded and in some cases nulled. Whilst talking about why his code wasn’t working with Endermined (a java developer) he sent a python code snippet, without knowing that Endermined knows java. Endermined caught on immedietly, also when Marcelektro talks about programming and how it works, his statements litrally make - sense whatsoever. Just try talking to him about anything related to programming and you can see for yourself. As the <a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud.net</a> Minecraft Server Network is made of <sub>30</sub> servers, he says that it runs on a 64 core server in a separate house (he claims to have 2 houses, one which is his own). However he runs 30 servers on a i3 8100 with 16gb of ram. He said that this is just the bungee, but this is false apparently.</p>\n\n<p><em>Proof:</em><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599663176-801404-img-3948.jpeg\" title=\"\"></p>\n\n<p>Servers crash constantly. And this is not all. For every step of development (finding plugins, configuring plugins, using plugins, setting up stuff, etc.) he needed help from other staff.</p>\n\n<p><em>MarCloud WebDrive</em><br>\nAh yes, the great (again) custom coded drive system by Marcelektro called <a href=\"https://marcloud.net/cloud\" rel=\" nofollow ugc\">MarCloud WebDrive</a>. Calling it custom coded is not only false, but also against the license of nextcloud, the software he actually uses. This is, again, self hosted. Other than that there is t much to say about this, so let’s get to the next big story point;</p>\n\n<h3>Enzonet</h3>\n<p>After many years of experience Endermined created Hye Hosting, and with that followed huge success. Marcelektro got jealous and started Enzonet (name after his cat, Enzo, he has 2 cats, Leon and Enzo, his anticheat LeonAHack is named after Leon, although, his anticheat is just Matrix AC with modified messages, nothing custom as he claims), his own host, behind Endermined‘s back, <em>the co-owner of his establishment</em>. Wolfo took over as head of Enzonet and they began working on it. After getting stuck on setting up pterodactyl, they reached out in the pterodactyl discord server, however this couldn’t help resolve their issue so they had no choice but to reach out to Endermined, who assisted them, but upon questioning why he wasn't involved, they just kicked him out of the project, then a confused Endermined left <a href=\"https://marcloud.net\" rel=\" nofollow ugc\">MarCloud.net</a> (again) for Marcelektro who was trying to compete inside of a project he leads. After a few months, when Wolfo and Ender were friends, Ender realized EnzoNet wasn't having any growth, so he decided to take it under Hye's wings.</p>\n\n<h3>Marcel‘s 50k Server Botnet</h3>\n<p>After Endermined exposing marcel for everything he had done, essentially turning his community against him, Marcel fought back with a 1tbps DDoS attack from 50k servers on the Hye Hosting website. This attack went through Cloudflare and the website went offline for multiple days. Marcel knew he just attacked the frontend, so he threatened to attack the backend if he continued to speak about this issue. He even threatened to attempt database breaches. Hye Hosting had great security measures in place, so Endermined did not have any worries about the database, but the downtime would certainly be an issue, so he agreed.</p>\n\n<p><em>Proof:</em><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599661855-333074-img-3946.jpeg\" title=\"\"><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599661866-30239-img-3947.jpeg\" title=\"\"><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599661890-565586-unknown-5.png\" title=\"\"><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599661878-357793-unknown-2.png\" title=\"\"><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599661881-516313-unknown-3.png\" title=\"\"><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599662357-955939-feafc9995175dc4aca44eba708cc767f-png.jpeg\" title=\"\"><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599662109-623374-62758ad75d51b8ed98063e61c2ba093f-png.jpeg\" title=\"\"><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599662198-964322-c409eb35ebaf1827380a3fc84ebc4df7-png.jpeg\" title=\"\"><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599662227-141209-2f7b0fbb8341e6231a1cbdfc324fd61b-png.jpeg\" title=\"\"><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599662196-19475-d12951b92ca112c8b2aa60b23bc26e2e-png.jpeg\" title=\"\"></p>\n\n<p><em>You may ask yourself if I am allowed to post this, but I have full permission by Endermined</em><br>\n<em>Proof:</em><br>\n<img src=\"https://winterhoax.com/assets/files/2020-09-09/1599661724-312817-img-3950.jpeg\" title=\"\"></p>\n\n<h3>And thats it. I will update this as new information comes out</h3>\n   <br>","editedAt":"2021-01-14T12:43:14+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"2"}},"editedUser":{"data":{"type":"users","id":"2"}},"discussion":{"data":{"type":"discussions","id":"94"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"3282"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"2","attributes":{"username":"Sloth","displayName":"Sloth","avatarUrl":"https://drama.gg/assets/avatars/6BdW7QU4UtMZIKtd.png","slug":"Sloth","joinTime":"2020-07-08T15:35:09+00:00","discussionCount":6,"commentCount":188,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-10-01T15:30:04+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[{"type":"groups","id":"1"}]}}},{"type":"users","id":"2871","attributes":{"username":"RusJS","displayName":"RusJS","avatarUrl":"https://drama.gg/assets/avatars/NlCiT9o37Teub04l.png","slug":"RusJS"}},{"type":"groups","id":"1","attributes":{"nameSingular":"Administrator","namePlural":"Administrators","color":"#B72A2A","icon":"fas fa-wrench","isHidden":0}},{"type":"discussions","id":"94","attributes":{"title":"MarCloud - Marcelektro - Enzonet | The whole saga","slug":"94-marcloud-marcelektro-enzonet-the-whole-saga","isApproved":true}},{"type":"posts","id":"3282","attributes":{"number":11,"createdAt":"2020-10-10T08:14:42+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/94/1\" class=\"PostMention\" data-id=\"2111\">Sloth</a> good thread noice</p>"},"relationships":{"user":{"data":{"type":"users","id":"2871"}},"discussion":{"data":{"type":"discussions","id":"94"}}}}]}