{"data":{"type":"posts","id":"21235","attributes":{"number":1,"createdAt":"2021-07-10T14:06:10+00:00","contentType":"comment","contentHtml":"<p>Hello all,</p>\n\n<p>Firstly, a little backstory, Proxala had been selling 9900k Dedicated Servers for 72 Euro excluding tax, as this pricing is stupidly low, I decided to purchase a server, to see the flaws in their service, with the intention of verifying if they were legit, or not, and cancelling the server.</p>\n\n\n<p><strong>Questioning Tax Registration</strong></p>\n\n<p>The first red flag to me was the claim that the 90eur included Netherlands sales tax, I asked this to be removed as we were a UK company, and this request was honored. I was then asked 'how much is tax' (screenshot provided). For a host charging sales tax to not know the percentage, yeah that's a massive red flag. <img src=\"https://drama.gg/assets/files/2021-07-10/1625925023-932657-capture.jpg\" title=\"\"></p>\n\n<p><strong><em>Proxala (inc)</em></strong></p>\n\n<p>Upon receiving my stripe link to pay Proxala, the email and my bank statement both said Proxala Inc, as shown here<img src=\"https://drama.gg/assets/files/2021-07-10/1625925137-369233-capture.jpg\" title=\"\"> and here <img src=\"https://drama.gg/assets/files/2021-07-10/1625925189-353787-image0.png\" title=\"\">. When i questioned Aspect (The owner of Proxala) about this, he blamed my bank and said that it was lying. [upl-image-preview <img src=\"https://drama.gg/assets/files/2021-07-10/1625925264-274401-capture.jpg\" title=\"\"></p>\n\n<p><strong>Unsecure Dedicated Servers + False Suspension</strong></p>\n\n<p>Once my server was delivered, it was set with an extremely unsecure root password (12345678), and i was not told to change it. Obviously, we should have, but i was more concerned with checking ipmi to make sure the server is legitimate, etc, and gave the infomation to my technician to install virtulizor on it. <br>\nI awoke at around 3am my time today, to find out that my service had been suspended at 1am today, due to the cpu being maxed for 4h, which firstly id like to point out that its a dedicated server and why was he looking at my server files (he stated he kvmed in), and secondly the fact that he tried to keep it frozen and not issue a refund is questionable. I went back to sleep.</p> \n\n<p>Additionally, his method of suspending my server is questionable, his suspension method was to unplug the server, rather than disconnecting network, or a safe power down. This suspension method is incredibly alarming, due to the fact that if i was transferring files, or something, it could potentially corrupt something.</p> \n\n<p>I further probed him on this around 12pm today ish and was told to email in to request a login (i had forgotten he sent the new login via discord due to my tiredness this morning). I emailed in with the following '''Hi bitch give me my login info k ty', not exactly professional, but expresses my frustration at his refusal to reset the password because i asked him on discord, even though I had ordered, and paid via a stripe link on discord. He then stated he had disabled the server again, no reason was provided. <img src=\"https://drama.gg/assets/files/2021-07-10/1625925651-743385-capture.jpg\" title=\"\"></p>\n\n<p><strong>Refusing Refunds</strong></p>\n\n<p>Aspect stated that i had been refunded for this service<img src=\"https://drama.gg/assets/files/2021-07-10/1625925800-863011-capture.jpg\" title=\"\"><br>\n, however after further probing, he revealed that a refund has not been issued, and that he wanted me to make a ticket on his billing panel<img src=\"https://drama.gg/assets/files/2021-07-10/1625925807-777879-capture1.jpg\" title=\"\"><br>\nWhich i dont think i even have a login for, i dont know my password, and frankly i dont want to go onto his site.</p> \n\n<p><strong>Overall Shady Services</strong></p>\n\n<p>The IPs provided for this server are shown as Verizon Residential IPs</p>\n\n<p>(68.132.35.101<br>\n68.132.35.102<br>\n68.132.35.103<br>\n68.132.35.104<br>\n68.132.35.105)<br>\nHowever, he states that they are DC IPs, and it is 'wrong', which i heavily doubt, he has not provided proof of having any Rackspace in the location the server was delivered to me in (NY), and the ips all match up to be Verizion ips, the only proof of him having Rackspace was a picture of a genetic ass looking rack, with 10 year old storage servers in.</p> ","editedAt":"2021-07-10T14:13:43+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"2943"}},"editedUser":{"data":{"type":"users","id":"2943"}},"discussion":{"data":{"type":"discussions","id":"787"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"2943","attributes":{"username":"NighMayHigh","displayName":"NighMayHigh","avatarUrl":"https://drama.gg/assets/avatars/NEZH5ehutmn6Rm0k.png","slug":"NighMayHigh","joinTime":"2020-12-01T08:54:15+00:00","discussionCount":4,"commentCount":67,"canEdit":false,"canDelete":false,"lastSeenAt":"2022-11-13T21:39:18+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"787","attributes":{"title":"Proxala: Refusing Refunds, Suspending Services, Home Hosting","slug":"787-proxala-refusing-refunds-suspending-services-home-hosting","isApproved":true}}]}