{"data":{"type":"posts","id":"21738","attributes":{"number":1,"createdAt":"2021-07-17T19:15:30+00:00","contentType":"comment","contentHtml":"<p>Okay, so here is the thing. I was staff on a Minecraft server called MeleeCraft a while back (about a year ago), and today I got a random message from one of the servers members. He was mentioning my role as Developer back on MeeleCraft and asked if I wanted to get an invite to his server he was making.</p>\n\n<p>And you all hear how that sounds. It sounds like he is either wanting me to help him out, or to \"apply\" (they had some google form thing, idk I never got to see it as it was closed), or inviting me as a Dev on their server. But to my surprise, this was a 15 year old, very immature owner that wasted my time for almost 2 hours of productive development time. I literally sat and waited for him to open the application to the point where I couldn't work normally, and here is our conversation.</p>\n\n<p><img src=\"https://drama.gg/assets/files/2021-07-17/1626548712-619290-image.png\" title=\"\"><br>\nAt first he seemed like he was a real full fletched Owner that knew what he was doing. (there were 2 other owners and at least 2 managers on the server. I am guessing now afterwards he is not the one doing stuff. It is more likely he is just owner because he happens to be close friends with the other owners)</p>\n\n<p><img src=\"https://drama.gg/assets/files/2021-07-17/1626548828-357982-image.png\" title=\"\"><br>\nI left his server when I didn't get a response, and then he asked me to join back, and I was willing to give him a second chance. However he wasn't the brightest as he didn't even know what kind of message he sent to me when asking me to join the server that way.</p>\n\n<p><img src=\"https://drama.gg/assets/files/2021-07-17/1626548944-593060-image.png\" title=\"\"><br>\nThen he said he would finally give me the application link at about 7.40pm. However as you can see I waited for over an hour for him to even respond. And when he did, it sounded like I was to blame for pushing him. He made me wait for a full hour before blaming his internet, and saying he was hanging out with his family. He also asked why I \"kept joining and leaving\". I left twice. Once when he didn't respond in the start, and once when I had to wait for over an hour on him to respond. He also didn't really seem to understand that he was making a bad impression against me. He just shook it off and said \"I didn't do nothing\".</p>\n\n<p><img src=\"https://drama.gg/assets/files/2021-07-17/1626549153-827047-image.png\" title=\"\"><br>\nHe then proceeded to even further try to \"blame\" me for not \"wanting to support a 15 year old\", to which I replied his age had nothing to do with it, and that I had tried to support and help him for over an hour to no avail. He then can't seem to keep up a normal conversation when he is the one to blame for the negativity and blocks me.</p>\n\n<p>Thank you if you have read through everything, it means a lot. And If I were you, i'd stay far away from this server.<br>\nDiscord link: <a href=\"https://discord.gg/RyfuZNhZ\" rel=\" nofollow ugc\">https://discord.gg/RyfuZNhZ</a></p>\n\n\n","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"3945"}},"discussion":{"data":{"type":"discussions","id":"816"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"21739"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"3945","attributes":{"username":"Rismose","displayName":"Rismose","avatarUrl":"https://drama.gg/assets/avatars/TBPYgt5babRpzc7N.png","slug":"Rismose","joinTime":"2021-07-08T23:37:31+00:00","discussionCount":2,"commentCount":15,"canEdit":false,"canDelete":false,"lastSeenAt":"2022-08-27T20:16:20+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":"oeC6JTaU8LsTGKBM.jpg","cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"Full-stack Developer, Mainly Java Dev","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"816","attributes":{"title":"Affinity | Minecraft Server | Immature owners and fishing for members","slug":"816-affinity-minecraft-server-immature-owners-and-fishing-for-members","isApproved":true}},{"type":"posts","id":"21739","attributes":{"number":2,"createdAt":"2021-07-17T19:41:00+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/816/1\" class=\"PostMention\" data-id=\"21738\">Rismose</a> Okay so I got some more info, he didn't block me, he just removed me as a friend, but then when he saw I posted this he came begging for me to take it down:<br>\n<img src=\"https://drama.gg/assets/files/2021-07-17/1626550858-543761-image.png\" title=\"\"></p>\n"},"relationships":{"user":{"data":{"type":"users","id":"3945"}},"discussion":{"data":{"type":"discussions","id":"816"}}}}]}