{"data":{"type":"posts","id":"25073","attributes":{"number":43,"createdAt":"2021-08-20T09:47:24+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/u/AltusWebsites\" class=\"UserMention\">@AltusWebsites</a> I happened to go through the summerhost thread that \"Kasper\" created on the Blesta discord server since I hadn't fully read it and noticed a few more thing</p>\n\n<p>You say you never assumed making the internet a better place consisted of trashing other companies and that I have no right to criticize anyone but myself.<br>\nYou and Kasper still go ahead and do the contradictory as you can see in the below screenshots<br>\n<img src=\"https://drama.gg/assets/files/2021-08-20/1629450891-409232-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2021-08-20/1629450923-805467-image.png\" title=\"\"></p>\n\n<p>I wouldn't say you are directly promoting SiteFold in this but why not help with the issue rather than trying to trash them? And especially this:<br>\n<img src=\"https://drama.gg/assets/files/2021-08-20/1629451205-509460-image.png\" title=\"\"><br>\nThis certainly is trashing or criticizing a host, because even after the client himself says its resolved and clarifies that it was working earlier too but not remote email sending \"Kasper\" proceeds to say that \"No they could not\"<br>\nHow do you know that it wasn't working when the client himself is mentioning it was through DA interface</p> \n\n<p>Coming back to the thread, you, \"Kasper\" and Aleksa seem criticizing and trashing companies, how do you justify that? It isn't even constructive criticism its blatant drama and jokes, so all I want to say is if you are criticizing something be ready to accept criticism yourself which clearly isn't happening because when Swivro/SiteFold was being criticize  in r/webhosting \"Kasper\" turned toxic and called them assholes.</p>\n\n<p>I created this thread on Drama.gg because I clearly realized that you/Kasper were not capable of handling criticism professionally on discord and that I would probably be called an asshole or worse ignored if it did it there. Here you surely care about what I say because this thread would always be visible to everyone on the internet and directly affects SEO.</p>\n\n<p><a href=\"https://drama.gg/u/kasper6709\" class=\"UserMention\">@kasper6709</a> You mention that this could thread content could have been resolved on discord and I stated my reason above but why couldn't you do it for the 3-4 hosts you are making jokes, criticising in the Blesta discord server? They also most likely would have probably appreciated constructive criticism and not petty drama or jokes</p>\n\n<p>Its all fun and games unless you are openly criticized on a public internet forum is all I can say</p>\n\n<p>My final verdict is still that Kasper and Swivro/SiteFold/HostWithGorilla is extremely shady and would not recommend anyone dealing with them</p> ","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"4215"}},"discussion":{"data":{"type":"discussions","id":"899"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"4215","attributes":{"username":"anonymous321","displayName":"anonymous321","avatarUrl":null,"slug":"anonymous321","joinTime":"2021-08-19T13:35:35+00:00","discussionCount":1,"commentCount":23,"canEdit":false,"canDelete":false,"lastSeenAt":"2021-08-20T18:25:28+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"899","attributes":{"title":"Kasper Irelan/Ireland | Swivro & SiteFold.co","slug":"899-kasper-irelanireland-swivro-sitefoldco","isApproved":true}}]}