{"data":{"type":"posts","id":"26904","attributes":{"number":634,"createdAt":"2021-09-03T18:22:33+00:00","contentType":"comment","contentHtml":"\n<p>This host started more as a project to help people code and host your discord bot for free! We knew it would be difficult but we did everything because we know that many of you can not always afford to pay for a host. So that's why we made it free for a start.</p>\n\n<p>Time goes by and we get more and more users that we did not expect. The servers that we had the hosting on we owned privately for the most part and were server computers that we did not use directly and put down our private time to do for free to you.</p>\n\n<p>But they became tough and we ended up renting a server in the US in the hope of lower ping because Discords Api is based in the US. And it happened in the end (Donator node 1) To take part in Donator node in the beginning, you needed to donate over 2 dollars. but time passed and the US node became overloaded. And we decided to keep everyone who had donated and instead introduce a one-month plan. Because we got no income at all anymore. So instead of shutting down US Node 1, we tried to keep it running by getting people to subscribe every month. But to still keep all existing on US Node 1.</p>\n\n<p>We also shut down so that it was no longer possible to create servers.</p>\n\n<p>We also received complaints from some of our staff members that we did not care as a community. But we have so much else to do than just the server and we did not trust to just give out the effort to take care of what we have created and committed to someone else. So we set up drawing lines for how the server would be handled. (Exat like any other server)</p>\n\n<p><strong>The rules are simple.</strong> <br>\n*Do not change the server, Channels or server settings or utilize bots that may have more privileges. The server would be built in such a way that nothing would need to be changed and that it would just work.</p>\n\n<p>*The staff were largely responsible for the community itself, more or less moderating the chat. As well as working with support issues.</p>\n\n<p>The rules were broken quite often by the same staff members and they were greeted time and time again but did not listen. And instead threatened and ignored what the Owner of the server said to them. They in turn started a type of movement with #UseRightMater that would more or less try to silence the Owners and get members to say bad things about the Owners and without proof to a large extent.</p>\n\n<p>We who have founded Sweplox Hosting have many other things we do during the day that do not mean being in front of the computer. Many of us go to school and others have jobs. So we usually do this in our spare time. We wanted to create a free host for people. Follow all regulations that Swedish hobby businesses require and treat it as if this were a company to a greater extent. But to see people that we do not care and think that what we do is bad. Is not fun at all. We have given you a platform to meet other people, we have given you a place where you can have your host for FREE! What more do you want from us. If you now hate our hosting why have you continued to use it all the time.</p>","editedAt":"2021-09-03T18:24:14+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"4389"}},"editedUser":{"data":{"type":"users","id":"4389"}},"discussion":{"data":{"type":"discussions","id":"890"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"26925"},{"type":"posts","id":"26928"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"4389","attributes":{"username":"Raxo11527","displayName":"Raxo11527","avatarUrl":"https://drama.gg/assets/avatars/UBJ51THR7ftToi84.png","slug":"Raxo11527","joinTime":"2021-09-03T17:37:13+00:00","discussionCount":0,"commentCount":4,"canEdit":false,"canDelete":false,"lastSeenAt":"2021-10-13T16:37:09+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"4196","attributes":{"username":"GamerOmega","displayName":"GamerOmega","avatarUrl":"https://drama.gg/assets/avatars/dbVh6vEbLKGsAFfF.png","slug":"GamerOmega"}},{"type":"users","id":"4197","attributes":{"username":"Cnnn666","displayName":"Cnnn666","avatarUrl":"https://drama.gg/assets/avatars/PMgsY1ldkzME4yFO.png","slug":"Cnnn666"}},{"type":"discussions","id":"890","attributes":{"title":"Sweplox Hosting | Low Quality Service","slug":"890-sweplox-hosting-low-quality-service","isApproved":true}},{"type":"posts","id":"26925","attributes":{"number":636,"createdAt":"2021-09-03T21:50:39+00:00","contentType":"comment","contentHtml":"<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/890/634\" class=\"PostMention\" data-id=\"26904\">Raxo11527</a> We have given you a platform to meet other people</p></div></blockquote>\n\n<p>did you invent discord?</p>"},"relationships":{"user":{"data":{"type":"users","id":"4196"}},"discussion":{"data":{"type":"discussions","id":"890"}}}},{"type":"posts","id":"26928","attributes":{"number":639,"createdAt":"2021-09-03T22:59:54+00:00","contentType":"comment","contentHtml":"<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/890/634\" class=\"PostMention\" data-id=\"26904\">Raxo11527</a> They in turn started a type of movement with #UseRightMater that would more or less try to silence the Owners and get members to say bad things about the Owners and without proof to a large extent.</p></div></blockquote>\n\n<p>without a proof? you think that where you are isnt the truth?</p>\n\n<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/890/634\" class=\"PostMention\" data-id=\"26904\">Raxo11527</a> They in turn started a type of movement with #UseRightMater that would more or less try to silence the Owners and get members to say bad things about the Owners</p></div></blockquote>\n\n<p>how was it supposed to silecen owners? you didnt care about the community. aaron and scoopy were the ones caring the most. u got jealous bcoz they got more respect in the server than you or what?</p>\n\n<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/890/634\" class=\"PostMention\" data-id=\"26904\">Raxo11527</a> Follow all regulations that Swedish hobby businesses require and treat it as if this were a company to a greater extent.</p></div></blockquote>\n\n<p>I'm still waiting for my files back and pp since youre not targetting only sweden atm</p>\n\n<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/890/634\" class=\"PostMention\" data-id=\"26904\">Raxo11527</a> We have given you a platform to meet other people</p></div></blockquote>\n\n<p>you basically made a discord server lmao, anyone can do that</p>\n\n<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/890/634\" class=\"PostMention\" data-id=\"26904\">Raxo11527</a> we have given you a place where you can have your host for FREE!</p></div></blockquote>\n\n<p>its kind of outdated so u shouldnt say that</p>\n\n<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/890/634\" class=\"PostMention\" data-id=\"26904\">Raxo11527</a> What more do you want from us</p></div></blockquote>\n\n<p>to finally start listening to the community and see your mistakes?</p>\n\n<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/890/634\" class=\"PostMention\" data-id=\"26904\">Raxo11527</a> If you now hate our hosting why have you continued to use it all the time.</p></div></blockquote>\n\n<p>bcoz when u werent that active it was a bit better?</p>"},"relationships":{"user":{"data":{"type":"users","id":"4197"}},"discussion":{"data":{"type":"discussions","id":"890"}}}}]}