{"data":{"type":"posts","id":"2706","attributes":{"number":35,"createdAt":"2020-09-30T20:11:58+00:00","contentType":"comment","contentHtml":"<p>Applicable to services like FalixNodes, QuackHost, etc...<br>\nWhen will people understand the fact that you don't get things for <strong>FREE</strong> !! ??? If you use google or any other major search engines, you won't find any websites providing you the facilities Falix offers you. Its a blunt lie. Major engines such as google, microsoft, amazon, etc doesn't even provide more than 1 GB Ram for free <strong>FYI</strong>. There is no such thing called free vps ( <a href=\"https://www.quora.com/How-do-I-get-a-free-permanent-vps\" rel=\" nofollow ugc\">Refer Here</a> ). The income from arc.io doesn't compensate the outcome charges of these services. Even if their exists free vps, there are a lot of limitations on them, heroku and glitch are the prefect examples in this case. Falix isnt listed in google if you search unless for \"Falix hosting\" or \"falix nodes\".  So if falix offers you way better features than any of the web gaints can provide and that too for free, Everything they say, literally the whole thing is a hoax, a complete lie <strong>OR</strong> its provides you stolen services using loopholes in many other major hosting servers, which is completely illegal. Now if you're using this service, and you dont even care if they are illegal, you are a victim of the \"Social Dilemma\". These people might be selling your data, literally the virtual you,  to have an income. Services like these are started by unemployed brilliant people, for a means of life.  <br>\nFor gad sake, try to understand whats true rather than selling yourself as a slave. This documentary <a href=\"https://www.netflix.com/in/title/81254224\" rel=\" nofollow ugc\">Here</a> on netflix will put some sense into your head if you dont understand how are these people manipulating/tricking you into traps the they are offering you. You might not mind selling your the very virtual you for your current needs, but you're risking a whole lot of things that you'll need to hang on to live in the future. Its easy to throw off these paragraph using the usual excuses of having no proof. The proof that works here is your common sense and the power to understand things in a different angle when things go wrong /and whats reality. It would be wise not to turn a blind eye to the truth rather than to do so since their offer is literally everything u have to have your bot hosted. Learn to say NO to scammers. Defending these people would be the ones who are/will be offered more of the scammed lots by the owners. Turning against scammers is always risky for as your data is with them, form a community, stand strong against them, and thats how humanity has lived so far. I'm not a professional critic or something, its just the simple truth you people forget to think about when you see glitter amongst the desert.</p>\n\n<p>\"You are lying, we have tos &amp; privacy policy, its not worth the risk\" People are clever enough these days to exploit/to have loopholes in it to get pass through</p>\n\n<p>And no, i'm not a hater of these services. Read again and again until you understand why its written.</p>","editedAt":"2020-09-30T20:24:03+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"2847"}},"editedUser":{"data":{"type":"users","id":"2847"}},"discussion":{"data":{"type":"discussions","id":"34"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"2847","attributes":{"username":"JosieV","displayName":"JosieV","avatarUrl":"https://drama.gg/assets/avatars/O82kFbpRXI0oHZTX.png","slug":"JosieV","joinTime":"2020-09-30T19:46:34+00:00","discussionCount":0,"commentCount":4,"canEdit":false,"canDelete":false,"lastSeenAt":"2020-10-18T14:27:45+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"34","attributes":{"title":"Lamaker/ItzAwesome/Lily/Pamar | FalixNodes/Falix.gg & PrimeSRV","slug":"34-lamakeritzawesomelilypamar-falixnodesfalixgg-primesrv","isApproved":true}}]}