{"data":{"type":"posts","id":"27462","attributes":{"number":1,"createdAt":"2021-09-11T05:44:29+00:00","contentType":"comment","contentHtml":"<p>Meet Asjad - A staff member I recruited a little bit ago when I was recruiting new staff members, he seemed like the best candidate at the time, now I just want to help other hosting or other clients to steer well aware from this asshole.</p>\n\n<p>I received a few reports over his time being staff here at EpikHost, but nothing major up until today- Dm'ing other users about a new host that he started- After just a little looking, it's a sketchy host (No TOS, stolen PP)</p>\n\n<p>Lets start with him dming other users:<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631337536-46665-image.png\" title=\"\"><br>\nClaming he has a 59$ VPS. You'll see why this is funny in a second:<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631337556-601272-image.png\" title=\"\"><br>\nAh yes, a freenom (free site for getting domains) domain, ending in .tk yet he has the money to splurge on a $59 VPS? Something doesn't quite add up there but I digress.</p>\n\n<p>I then confronted him about this:<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631337635-768255-image.png\" title=\"\"><br>\nHe asked me what he should admit, you can see this in two ways. One- He's done multiple things, Two - He was confused<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631337695-48447-image.png\" title=\"\"><br>\nI sent him the screenshots and then he said this:<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631337861-664-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631337908-565957-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631337926-256086-image.png\" title=\"\"><br>\n(It's literally in the screenshot I sent him??? )<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631337966-819350-image.png\" title=\"\"><br>\nHow could \"His severe bad\" be auto corrected from anything else? Someone explain?<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338039-541058-image.png\" title=\"\"><br>\nTrying to change the topic that he hosted giveaways for us?</p>\n\n<p>He then went and created a group chat with the person who reported him to me.<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338125-176284-image.png\" title=\"\"><br>\nIf you guys want I'll try find the ticket logs with this person to show he never asked for the invite.</p>\n\n<p>The person who reported him had an alt who he also dm'd. <br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338163-773964-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338170-45068-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338185-262868-image.png\" title=\"\"><br>\nNow he changes the topic to something that happened not related to my host? Then says I thought you were my friend, another reason I believe he may have dm'd other users who haven't come forwards.<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338241-607370-image.png\" title=\"\"><br>\n(That's what he was talking about with saying sorry or something)<br>\nThe group chat starts to become irrelevant here but I can show other screenshots if need be.<br>\nI decided to go check out his site now to see if there's any other dirt, and Oh my lord, have I seen such a shithost in my life.</p>\n\n<p>No TOS / T&amp;S, miss spellings, Shittily made <br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338400-751312-image.png\" title=\"\"><br>\nClearly a template with the phone number etc not in use, random images for seemingly no necessary reason, Invalid hyper links, multiple links to the same thing?<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338489-3700-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338506-475433-image.png\" title=\"\"><br>\n404 on their docs page?<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338560-813320-image.png\" title=\"\"><br>\nShoddy English</p>\n\n<p><img src=\"https://drama.gg/assets/files/2021-09-11/1631338592-541064-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338602-711668-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338611-106037-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338658-532344-image.png\" title=\"\"><br>\nShoddy English and claims that aren't backed.</p>\n\n<p><img src=\"https://drama.gg/assets/files/2021-09-11/1631338701-470011-image.png\" title=\"\"><br>\nAgain claims without proof and shoddy English, my trust in this host keeps falling and falling.</p>\n\n<p><img src=\"https://drama.gg/assets/files/2021-09-11/1631338801-702636-image.png\" title=\"\"><br>\nInfinite wheel showing the same things? That it's a dodgy host with two languages supported.</p>\n\n<p>Clearly a copied TOS, I asked him if he copied it and he said that we copied ours when his is almost an exact copy of mine? (We haven't copied ours, feel free to ask for mine) but for now here's his:</p>\n\n\n<p>This Privacy Policy describes how your personal information is collected, used, and shared when you visit or make a purchase from rainbowstudiohosting. PERSONAL INFORMATION WE COLLECT When you visit the panel, we utilize Google's Analytics, which may track more information about you, including but not limited to your country of origin and web browser Additionally when you make a purchase or attempt to make a purchase through the Site, we collect certain information from you, including your name, billing address, shipping address, payment information (including credit card numbers), email address. We refer to this information as “Order Information”. When we talk about “Personal Information” in this Privacy Policy, we are talking both about Device Information and Order Information. HOW DO WE USE YOUR PERSONAL INFORMATION? We use the Order Information that we collect generally to fulfill any orders placed through the Site (including processing your payment information, arranging for shipping, and providing you with invoices and/or order confirmations). Additionally, we use this Order Information to: - Communicate with you; - Screen our orders for potential risk or fraud; and - When in line with the preferences you have shared with us, provide you with information or advertising relating to our products or services. We use the Device Information that we collect to help us screen for potential risk and fraud and more generally to improve and optimize our Site (for example, by generating analytics about how our customers browse and interact with the Site, and to assess the success of our marketing and advertising campaigns). SHARING YOUR PERSONAL INFORMATION We may share your Personal Information to comply with applicable laws and regulations, to respond to a subpoena, search warrant or other lawful request for information we receive, or to otherwise protect our rights. BEHAVIOURAL ADVERTISING You can opt out of targeted advertising by using the links below. We do not currently implement any of these features however we may in the future: - Facebook: <a href=\"https://www.facebook.com/settings/?tab=ads\" rel=\" nofollow ugc\">https://www.facebook.com/settings/?tab=ads</a> - Google: <a href=\"https://www.google.com/settings/ads/anonymous\" rel=\" nofollow ugc\">https://www.google.com/settings/ads/anonymous</a> - Bing: <a href=\"https://advertise.bingads.microsoft.com/en-us/resources/policies/personalized-ads\" rel=\" nofollow ugc\">https://advertise.bingads.microsoft.com/en-us/resources/policies/personalized-ads</a> Additionally, you can opt out of some of these services by visiting the Digital Advertising Alliance’s opt-out portal at: <a href=\"http://optout.aboutads.info/\" rel=\" nofollow ugc\">http://optout.aboutads.info/</a>. YOUR RIGHTS If you are a European resident, you have the right to access personal information we hold about you and to ask that your personal information be corrected, updated, or deleted. If you would like to exercise this right, please contact us through the contact information below. Additionally, if you are a European resident we note that we are processing your information in order to fulfill contracts we might have with you (for example if you make an order through the Site), or otherwise to pursue our legitimate business interests listed above. Additionally, please note that your information will be transferred outside of Europe, including to the United States. DATA RETENTION When you place an order through the Site, we will maintain your Order Information for our records unless and until you ask us to delete this information. CHANGES We may update this privacy policy from time to time in order to reflect, for example, changes to our practices or for other operational, legal or regulatory reasons. CONTACT US For more information about our privacy practices, if you have questions, or if you would like to make a complaint, please contact us via our support channel.</p>\n\n<p>Ours:<br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338952-795621-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2021-09-11/1631338969-80570-image.png\" title=\"\"><br>\nEven same ending LMAO</p>\n\n<p>Threatened to expose my host for over allocation when I told them I was exposing there's??</p>\n\n<p>Feel free to ask for anything else because I will provide.<br>\nHave a good day!</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"4437"}},"discussion":{"data":{"type":"discussions","id":"983"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"4437","attributes":{"username":"MrRin","displayName":"MrRin","avatarUrl":"https://drama.gg/assets/avatars/Toh4F62Jnu6FbJPE.png","slug":"MrRin","joinTime":"2021-09-11T05:12:53+00:00","discussionCount":2,"commentCount":103,"canEdit":false,"canDelete":false,"lastSeenAt":"2022-04-03T13:39:11+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"983","attributes":{"title":"Asjad & Rainbow Studio Hosting - Scummy, Lying and Stealing Clients","slug":"983-asjad-rainbow-studio-hosting-scummy-lying-and-stealing-clients","isApproved":true}}]}