{"data":{"type":"posts","id":"30677","attributes":{"number":2,"createdAt":"2021-10-10T23:01:54+00:00","contentType":"comment","contentHtml":"<p>Drake here, again.</p>\n\n<p>I found out about their TrustPilot, which has some interesting reviews.</p> \n\n<p>\"I have used HostNexxus for all of 2 months now and have had nothing but a bad experience with them. I had 2-3 days of downtime when I first purchased my VPS. We had our files corrupted, had to reinstall Windows, and we were left with 2 machines running on the same IP (something that should not happen). We initially did not receive the specs promised and were required to migrate our server to a whole new data center. The website is constantly down and makes it very hard to manage our products. We have recently inquired about purchasing a dedicated server and were told that we can have one \"custom made\". We had given our specs and were then quoted a price of $180 for an initial setup plus $65 a month. Upon further inquiry and speaking with Alt he then informed us that the initial price would be going up to $230, he had said the shipping would be quite expensive. He then informs us that the initial price would be going to $492, he very \"generously\" said he would allow us to spread this $492 across 2 months. Upon looking into the server we have found one with the same exact specifications and in the same location for shipping on eBay priced at only $149.99 with $48.74 shipping. With tax and shipping, the system would be around $329, leaving HostNexxus with a $163 profit margin. That margin is not including the $65 a month he wanted to charge to host the server, mind you a server that has no DDOS protection. This would be hosted out of Dallas, Texas where hosting costs are around $35 for the magnitude of that server, once again leaving HostNexxus with a $30 a month profit margin. Overall their service is extremely overpriced and is very low quality. I would not recommend HostNexxus to anyone that would utilize the server on a day to day basis.\"</p>\n\n<p>\"This company is absolutely terrible compared to other companies. This company has been out of stock for the last 7 MONTHS! They tried offering me a lower storage plan with hdd for the same price as an SSD plan with 200+gb. The owner has a huge ego and is over controlling over everything in his company. Other companies offer way better cpu specs, ram &amp; storage compared to other companies. This company also had issues with their login for months making their customers reset their password every time they did a log in. Steer far away from this company as they are unexperienced.\"</p>\n\n<p>There are quite a few negative ones, but here are some positive ones...</p>\n\n<p>\"Amazing, trustworthy, quick and reliable support team with a great, friendly and talented executive, Alt T.</p>\n\n<p>I've used this service for a long time now and I've never been disappointed in their service. I continue to use HostNexxus because of how good they are at solving issues in cases of whether something was to happen or not, but - also, their hosting comes with such great things.</p>\n\n<p>I will continue being their customer.</p>\n\n<p>HostNexxus is recommended to all those out there!\"</p>\n\n<p>\"The Executive, Alt T. | CEO is an awesome and amazing person that was providing great communication skills and top quality support for whenever we needed it.</p>\n\n<p>I've been using HostNexxus for a vast amount of months and the support team have never failed to provide their support and have never let me down.</p>\n\n<p>I appreciate the team and hope for HostNexxus to continue growing, as deserved.\"</p>\n\n<p>Something about these two reviews just seem forced. Would anyone else agree? They kind of seem to be an clone of each other.</p>\n\n<p>TP: <a href=\"https://www.trustpilot.com/review/hostnexxus.com\" rel=\" nofollow ugc\">https://www.trustpilot.com/review/hostnexxus.com</a></p>","editedAt":"2021-10-10T23:02:09+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"4597"}},"editedUser":{"data":{"type":"users","id":"4597"}},"discussion":{"data":{"type":"discussions","id":"1081"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"4597","attributes":{"username":"Drake","displayName":"Drake","avatarUrl":"https://drama.gg/assets/avatars/yLtJa9Tl7r9oC5qT.png","slug":"Drake","joinTime":"2021-10-09T18:32:32+00:00","discussionCount":1,"commentCount":3,"canEdit":false,"canDelete":false,"lastSeenAt":"2021-10-22T03:20:51+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"1081","attributes":{"title":"HostNexxus | Invalid, Immature, and Irresponsible.","slug":"1081-hostnexxus-invalid-immature-and-irresponsible","isApproved":true}}]}