{"data":{"type":"posts","id":"31241","attributes":{"number":1,"createdAt":"2021-10-16T23:14:04+00:00","contentType":"comment","contentHtml":"<p><strong>I would say stop making posts about DBH in drama.gg, but then I'd be a hypocrite, but... stop making posts about DBH please.</strong></p>\n\n<hr>\n\n<p>From what I've seen, rumors and non-rumors from various sources, here's what I see. Keep in mind this post can be biased, some information may be false, and there could be false assumation:</p>\n\n<hr>\n\n<p>DanBot Hosting is a free host. A ton of free hosting providers have trouble, but it seems to me like this host never had trouble until this data breach happened. This host was able to maintain 20 nodes without too many problems, discluding many downtimes and few other issues, so this host looks like it has good reputation on keeping a host up.</p>\n\n<p>A problem DanBot hosting had is a ton of downtimes, which clearly makes sense if you see here: <a href=\"https://cdn.discordapp.com/attachments/899035482678255628/899035489020047401/unknown.png\" rel=\" nofollow ugc\">https://cdn.discordapp.com/attachments/899035482678255628/899035489020047401/unknown.png</a> (all of the nodes are down due to the raid. there were constant downtimes in DanBot though.) Don't expect a free host to have perfect downtimes. People should expect a ton of downtimes if they attempt to especially handle 20 nodes.</p>\n\n<p>It seems like Dan actually cares about this issue, and he is trying to make it better. I give him my respect for trying to make a free host he doesn't gain much from to be better. He has his own job, and he's definitely busy with other things too. Even if Dan is found guilty of the raid and data breach (which I highly doubt), he is still trying to make DanBot a good host.</p>\n\n<p>Don't expect every host \"needing to be\" perfect. Please. There will always be problems.</p>\n\n<hr>\n\n<p><a href=\"https://drama.gg/d/1071-dbh-scummy-hosting/2\" rel=\" nofollow ugc\">https://drama.gg/d/1071-dbh-scummy-hosting/2</a> This thread is BS.<br>\n<a href=\"https://media.discordapp.net/attachments/899035482678255628/899056256835264612/unknown.png\" rel=\" nofollow ugc\">https://media.discordapp.net/attachments/899035482678255628/899056256835264612/unknown.png</a> (not mine) \"*Updated With Lawsuit\" what a joke.</p>\n\n<hr>\n\n<p>I'll try to be the least biased to both sides now, but I'll be stating this right now, I support DanBot Hosting.</p>\n\n<p>Most of these stuff from this section of the post is going to be based off the thread, <a href=\"https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak\" rel=\" nofollow ugc\">https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak</a> .</p>\n\n<p>I will assume all the screenshots aren't edited.</p>\n\n<p>(more against danbot)</p>\n\n<p>According to the thread, it said Dan didn't update Pterodactyl Panel after they released a huge security release while Dan knew about it. I doubt anyone actually did that. The proof given doesn't really... show any proof or I didn't read their \"proof\" correctly... but according to Dan (as shown at <a href=\"https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak/123\" rel=\" nofollow ugc\">https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak/123</a> ), he did actually forget to update all the panel servers. According to Dan, DanBot is load balanced (which is a good thing) but Dan forgot to update all of the panels. Of course people forget things, but I guess this is a terrible mistake.<br>\n( according to Chirag, at <a href=\"https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak/246\" rel=\" nofollow ugc\">https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak/246</a> , he says the chance this happened is very low ... but according to Solo, at <a href=\"https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak/249\" rel=\" nofollow ugc\">https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak/249</a> , he/she says there's a 75% chance routing isn't up to date)</p>\n\n<p>According to Solo, Dan \"most likely leak[ed] config.json which stored API keys, SSH login, bot token, etc...\" (sources: <a href=\"https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak/55\" rel=\" nofollow ugc\">https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak/55</a> ) Solo is claiming he could've. This is possible, but possibly just a rumor. Also, this shows Dan stored sensitive data in JSON files, which could be a bad thing. More proof given after that message in the thread where Armic claims to had the config leaked to him multiple times. (but it's just a possible rumor, no one knows if it's true)</p>\n\n<p>(more for danbot now)</p>\n\n<p>According to <a href=\"https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak/230\" rel=\" nofollow ugc\">https://drama.gg/d/1084-danbot-hosting-raided-massive-data-leak/230</a> , it shows that people's bots got \"hacked\" (or their tokens leaked) towards after the raid. People's bots got \"hacked\", which shows that whoever so called \"hacked\" the panel had file access, or possibly admin access- meaning someone probably got administrator access and stole files. According to Dan, \"Possibility of files being leaked. (Unable to verify this. Dedicated servers were NOT logged into. Any data would of been downloaded via the panel.\" There's not too much proof that this is what really happened, so I can't say much with this.</p>\n\n<p>According to Dan, Solo could've been a person who did this. He was the only one with full control. He had the bot token too, and it would be a coincidence if both the panel and server has been raided at the same time. This is also another possible rumor.</p>\n\n<hr>\n\n<p>kinda spent too long writing this so imma just end it here too lazy to continue...</p>\n\n<p><strong>If you are going to say anything is wrong or something, please say it with good cnc.</strong><br>\nI hate when people just say \"lmao\", or something that doesn't relate to the thread at all. Also, don't advertise your stupid stuff here (looks at Ricky).</p> ","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":false,"isApproved":true,"canApprove":false,"canReact":false},"relationships":{"user":{"data":{"type":"users","id":"2977"}},"discussion":{"data":{"type":"discussions","id":"1099"}},"likes":{"data":[{"type":"users","id":"4530"}]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"2977","attributes":{"username":"Two","displayName":"Two","avatarUrl":null,"slug":"Two","joinTime":"2021-01-12T13:54:09+00:00","discussionCount":10,"commentCount":214,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-10-28T00:19:35+00:00","isEmailConfirmed":true,"email":"ntb.nottoday@gmail.com","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":true,"canEditOwnNickname":true,"bio":"drama.gg sucks but I guess here I am.","canViewBio":true,"canEditBio":true},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"4530","attributes":{"username":"CharityLexus","displayName":"CharityLexus","avatarUrl":"https://drama.gg/assets/avatars/v1B9ixaxuFRRyN88.png","slug":"CharityLexus"}},{"type":"discussions","id":"1099","attributes":{"title":"Something to do with DanBot Hosting. (DBH)","slug":"1099-something-to-do-with-danbot-hosting-dbh","isApproved":true}}]}