{"data":{"type":"posts","id":"34091","attributes":{"number":6,"createdAt":"2021-11-08T02:11:42+00:00","contentType":"comment","contentHtml":"<p><strong>As the owner of yeet hosting, i will reply back to this post with my response word to word from the discord</strong></p>\n\n<p>firstly, im gonna respond to this line by line as said by this person and review what they say</p>\n\n<ul><li>They are condoning the use of bots being used as users (against Discord's TOS)</li></ul>\n\n<p>sir you dont even have experience in discord, if you had you would know that is webhooks</p>\n\n<ul><li>Staff were condoning dos attacks</li></ul>\n\n<p>they were as a meme way, ddos is surely bad and ilegal</p>\n\n<ul><li>A low level staff member (one that should not have access to such things) leaked the password to their website node and their 2nd node (Never said what it was to, but still did it)</li></ul>\n\n<p>we had that to test if someone would be so stupid to even access that, i could have sued you for getting into a server that its not yours</p>\n\n<ul><li>They are letting users post their passwords in chat (this one is kind of on the user but should still be removed from their chats anyway)</li></ul>\n\n<p>🤦 this dude doesnt even know what he is saying anymore</p>\n\n<ul><li>After telling the owner about the passwords and access to the nodes (staff leak too) the owner claimed it wasn't a big deal and that node2 was only for honeypot (which is still a security concern)</li></ul>\n\n<p>oh hey i know this guy<br>\n<img src=\"https://cdn.discordapp.com/attachments/873211071765295144/907086749912670208/unknown.png\" title=\"\" alt=\"\"></p>\n\n<ul><li>The owner also only agreed to add an egg to the panel that allowed the generation of income for clients if he was given 1% of the profits from anyone who used it via bitcoin</li></ul>\n\n<p>again, that was a meme and you are using it on crewcraft.cc (what are you even talking about)</p> \n\n<ul><li>Their TOS is also virtually non existent:</li></ul>\n\n<p>id rather just straight up say this dude is 5 years old, you can literally read the tos, its the first thing you see when you join the server</p>\n\n<ul><li>Notice how 4 threatens to publicly expose your IP address instead of reporting it</li></ul>\n\n<p>it was pointed out again as a joke, again,  that was removed from rules a day before we actually released the real yeet hosting, and of course as you are mad because i didnt let you buy yeet hosting you are now triying to \"HOLY FUCK HOLY FUCK SEND HELP I NEED TO GET RID OF THIS GUY QUICK\" which is fully cringe and a childish way to try to get members in your shitass crewcraft.cc scam</p>\n\n<p>Sincerely: VolleierYouKnow#0007 - CEO of Yeet Hosting</p> ","editedAt":"2021-11-08T02:12:30+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"4808"}},"editedUser":{"data":{"type":"users","id":"4808"}},"discussion":{"data":{"type":"discussions","id":"1171"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"34095"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"4808","attributes":{"username":"VolleierYouKnow","displayName":"VolleierYouKnow","avatarUrl":"https://drama.gg/assets/avatars/gUUFOjSXqfijg98a.png","slug":"VolleierYouKnow","joinTime":"2021-11-08T02:06:52+00:00","discussionCount":2,"commentCount":121,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-02-20T04:04:10+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"account disabled","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"4777","attributes":{"username":"tenzfan","displayName":"tenzfan","avatarUrl":"https://drama.gg/assets/avatars/NmwJk64MDiWT60uc.png","slug":"tenzfan"}},{"type":"discussions","id":"1171","attributes":{"title":"Watch out for Yeet Hosting","slug":"1171-watch-out-for-yeet-hosting","isApproved":true}},{"type":"posts","id":"34095","attributes":{"number":9,"createdAt":"2021-11-08T02:26:28+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/1171/6\" class=\"PostMention\" data-id=\"34091\">VolleierYouKnow</a> Drama.gg is a site designed to expose fraudulent companies that don't know what they are doing. Which is you, so any argument I've made here is fully warranted. (You also said that its a node designed to see if someone would do it, however per your words its honeypot)</p>\n\n<p>Also you continue to say things were a joke, however you did not make a claim and rebuttal that your ban message did say kys (if you try and make a claim against that your dumb)</p>\n\n<p>Also if you \"just released\" then why have you been around for months? Also we didn't try to buy you, we tried to work with you. You only made these changes when me and Yeetster showed up and talked to you about them. I'm not making any claims that we are better, and at no point did I ever suggest that. However I do have a problem with companies like you making the small guys look bad, because you cause problems in our industry. Your TOS and Privacy Policy are NOT long enough to be considered a true TOS document. You never punished the staff members condoning DOS attacks, nor the one who leaked your password. Also <a href=\"https://drama.gg/u/Chirag\" class=\"UserMention\">@Chirag</a> so lovingly showed that you use free trials with the full intent of switching again once it runs out. Starting a host requires money, using trials puts your clients data at risk if you can't keep it safe. So if you cannot afford to pay for the nodes, don't start a hosting service</p>"},"relationships":{"user":{"data":{"type":"users","id":"4777"}},"discussion":{"data":{"type":"discussions","id":"1171"}}}}]}