{"data":{"type":"posts","id":"34574","attributes":{"number":242,"createdAt":"2021-11-09T20:22:45+00:00","contentType":"comment","contentHtml":"<p>I'm glad this is finally over, but it stills says I'm banned on the server. And if you want to for some reason to find out what the \"alt's\" name was it was along the lines of firemaxhine.</p>\n\n<p>But let's get to the real stuff<br>\nYou had your bad moments and I hope that we can atleast restore relations, and not cut them out (again) like we did a couple of days ago.</p> \n\n<p>I'm glad you atleast admitted to doing those stuff, even if at the end of the drama.  I get trying to get 5 new nodes, but if all you're gonna do with them is give them away for free then that's not a very good idea.<br>\nWe tried and will still try to help you improve in any way we can.</p> \n\n<p>We can get behind the misunderstanding of you thinking that we wanted to buy you. We tried to avoid this by giving you ideas, but when you cut ties with us and banned us from the Discord. That was the end of the friendly relations (for now atleast).</p> \n\n<p>We understood that the passwords weren't meant to be secure but still, a hacker's first guess at a password is one of these 3: <sub>1234567890</sub>, <sub>123456</sub>, <sub>123</sub> and so on. We are glad that you are also fixing this issue, since one day it could have become something much larger.</p>\n\n<p>Also glad to see that you will do a Staff Purge, since bad things can happen when you cannot properly manage a team that big. Also glad to see that you again, are following my/our idea of demoting the 3 incompetent staff members.</p>\n\n<p>We also hope that this will be the end of the Drama between CrewCraft Hosting and YeetHosting.</p>\n\n<p>-<em><strong>CrewCraft &amp; CrewCraft Hosting</strong></em></p>\n\n","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"4739"}},"discussion":{"data":{"type":"discussions","id":"1171"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"4739","attributes":{"username":"TheYeetster","displayName":"TheYeetster","avatarUrl":"https://drama.gg/assets/avatars/Bzg1ypsYeixFBMGH.png","slug":"TheYeetster","joinTime":"2021-10-29T17:14:08+00:00","discussionCount":1,"commentCount":146,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-03-12T21:57:04+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"1171","attributes":{"title":"Watch out for Yeet Hosting","slug":"1171-watch-out-for-yeet-hosting","isApproved":true}}]}