{"data":{"type":"posts","id":"34802","attributes":{"number":244,"createdAt":"2021-11-11T00:12:10+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/1171/243\" class=\"PostMention\" data-id=\"34766\">Tato</a> sure, the terms of service have been updated and go as follows</p>\n<pre><code class=\"language-fix\">Terms and Conditions of Use 10/11/2021\n---------------------------------------------------------------------------------\n1. Terms\nBy accessing this Website, accessible from https://www.mindustry.me, you are agreeing to be bound by these Website Terms and Conditions of Use and agree that you are responsible for the agreement with any applicable local laws. If you disagree with any of these terms, you are prohibited from accessing this site. The materials contained in this Website are protected by copyright and trade mark law.\n\n2. Use License\nPermission is granted to temporarily download one copy of the materials on Yeet Hosting's Website for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title, and under this license you may not:\n\nmodify or copy the materials;\nuse the materials for any commercial purpose or for any public display;\nattempt to reverse engineer any software contained on Yeet Hosting's Website;\nremove any copyright or other proprietary notations from the materials; or\ntransferring the materials to another person or \"mirror\" the materials on any other server.\nThis will let Yeet Hosting to terminate upon violations of any of these restrictions. Upon termination, your viewing right will also be terminated and you should destroy any downloaded materials in your possession whether it is printed or electronic format.\n\n3. Disclaimer\nAll the materials on Yeet Hosting’s Website are provided \"as is\". Yeet Hosting makes no warranties, may it be expressed or implied, therefore negates all other warranties. Furthermore, Yeet Hosting does not make any representations concerning the accuracy or reliability of the use of the materials on its Website or otherwise relating to such materials or any sites linked to this Website.\n\n4. Limitations\nYeet Hosting or its suppliers will not be hold accountable for any damages that will arise with the use or inability to use the materials on Yeet Hosting’s Website, even if Yeet Hosting or an authorize representative of this Website has been notified, orally or written, of the possibility of such damage. Some jurisdiction does not allow limitations on implied warranties or limitations of liability for incidental damages, these limitations may not apply to you.\n\n5. Revisions and Errata\nThe materials appearing on Yeet Hosting’s Website may include technical, typographical, or photographic errors. Yeet Hosting will not promise that any of the materials in this Website are accurate, complete, or current. Yeet Hosting may change the materials contained on its Website at any time without notice. Yeet Hosting does not make any commitment to update the materials.\n\n6. Cancellation of Service\nA client has the right to cancel a service at any time without reason. This does not include a refund unless an Admin says otherwise or it fits within our refund policy (see below). Cancellation of Service shall be done through the web portal or the discord server.\n\n7. Reseller and Reuse\nYou, the client, are permitted to resell all hosting services Yeet Hosting provides if they are used within legal boundaries and they are not free plans. Notice of reselling is appreciated. If We don't agree with how you are reselling our products and or services, we will ask you to stop the reselling of those specified products or services.\n\n8. Links\nYeet Hosting has not reviewed all of the sites linked to its Website and is not responsible for the contents of any such linked site. The presence of any link does not imply endorsement by Yeet Hosting of the site. The use of any linked website is at the user’s own risk.\n\n9. Site Terms of Use Modifications\nYeet Hosting may revise these Terms of Use for its Website at any time without prior notice. By using this Website, you are agreeing to be bound by the current version of these Terms and Conditions of Use.\n\n10. Your Privacy\nPlease read our Privacy Policy.\n\n11. Governing Law\nAny claim related to Yeet Hosting's Website shall be governed by the laws of US without regards to its conflict of law provisions.</code><script async=\"\" crossorigin=\"anonymous\" data-hljs-style=\"github\" integrity=\"sha384-oTqfbnKDrROJYNQZI1U//Vr36HEjwJafOewSUYYyb5OXhv0r2qRQcjAP3yXa4HCg\" onload=\"hljsLoader.highlightBlocks(this.parentNode)\" src=\"https://cdn.jsdelivr.net/gh/s9e/hljs-loader@1.0.24/loader.min.js\"></script></pre>","editedAt":"2021-11-11T00:14:30+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"4808"}},"editedUser":{"data":{"type":"users","id":"4808"}},"discussion":{"data":{"type":"discussions","id":"1171"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"4808","attributes":{"username":"VolleierYouKnow","displayName":"VolleierYouKnow","avatarUrl":"https://drama.gg/assets/avatars/gUUFOjSXqfijg98a.png","slug":"VolleierYouKnow","joinTime":"2021-11-08T02:06:52+00:00","discussionCount":2,"commentCount":121,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-02-20T04:04:10+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"account disabled","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"1171","attributes":{"title":"Watch out for Yeet Hosting","slug":"1171-watch-out-for-yeet-hosting","isApproved":true}}]}