{"data":{"type":"posts","id":"36788","attributes":{"number":1750,"createdAt":"2021-12-03T18:31:43+00:00","contentType":"comment","contentHtml":"<p>figured with months of screenshots of poor practice, excused by 'we have lives' in the context of poor customer service, fraud, and plenty of other shady circumstances. Id revive this thread. I've had plenty of people tell me the company has taken a turn for the better when new ownership was arranged. But from my experience, and what i see in the discord. its not 'better', they just mute and ban anyone who speaks up about the shady practices. intentionally fill up ticket systems for breaks, and purge the channels of anything that can get them in trouble.</p> \n\n<p>lets go over just one situation I've run into recently. Falix has released a premium plan which gives users better resources and access on par with a paid host. of course, you need to pay. Problem? I paid for my plan, and it double charged my bank. bringing it to overdrawn balance due to it messing up the money I had set aside for cellular this month waiting for next paycheck. <img src=\"https://drama.gg/assets/files/2021-12-03/1638555556-500003-image.png\" title=\"\"></p>\n\n<p>In the discord, obviously just went to create a ticket. Ticket system was down, waited an hour. Tried again, ticket system still down with no progress whatsoever. Tried again in a few hours, still down with no progress whatsoever. At that point, asked around in the discord when it was gonna be back up again. only response I got was this one. <em>wow, because that isnt shady at all.</em><br>\n<img src=\"https://drama.gg/assets/files/2021-12-03/1638555667-284172-image.png\" title=\"\"></p>\n\n<p>For images of their 'busy' ticket system.<br>\n<img src=\"https://drama.gg/assets/files/2021-12-03/1638555694-233089-image.png\" title=\"\"></p>\n\n<p>The bot has been monitoring 50 tickets with no changes continuously for almost two days. Considering I highly doubt they have 50 serious issues that need the max wait of 3 days for resolution. Another logical suggestion is that they filled it with dummy tickets to not deal with it through a softlock. Would explain the shady reaction :/</p>\n\n<p>Now then, lets go to the responses when I pointed out they nabbed my money and gave no means of a refund. First people to tell me how to go about with advice told me I needed to create a ticket. Once I reminded them the ticket systems been 'down' for a while, they told me to talk to lamaker. <br>\n<img src=\"https://drama.gg/assets/files/2021-12-03/1638555860-664785-image.png\" title=\"\"></p>\n\n<p>Once I went to talk to lamaker on a dm, every bit of it was ignored.<br>\n<img src=\"https://drama.gg/assets/files/2021-12-03/1638555910-241864-image.png\" title=\"\"></p>\n\n<p>After an entire day with an overdrawn bank balance, dm still ignored. I pointed it out to them on the discord. Magically lamaker responds there only to tell me that they all have personal lives. <em>wow, isnt the first rule of consumer marketing not to overlap personal life with a company or business? im pretty sure weve seen this issue plenty before already in this thread.</em> Now to get onto the more illegal practices aside from fraud. Considering poor customer service isnt really illegal, just shoddy.</p>\n\n<p>After a conversation in the discord for a bit about the personal life bs. I managed to get one of the staff telling me this 🙂<br>\n<img src=\"https://drama.gg/assets/files/2021-12-03/1638556093-44112-image.png\" title=\"\"></p>\n\n<p>So lemme get this straight.. You are selling paid goods and services in an environment where you arent an established business, do not pay your staff whatsoever at all, and blame fraud and poor management on personal lives? Seeing how the owners alt has a user info saying they are a literal 16 year old, idk what the laws are where you are for businesses. But if youre scamming people, not paying staff, undermanaging customer support and still somehow offering paid services and goods. Putting aside how illegal that entire set up is in the first place. If your personal life is too overburdening for the platform. Maybe thats because owning a company when you arent even graduated is a terrible idea. If things dont turn around, check your inboxes. Might be getting a lawsuit soon 😛</p>\n\n<p><em>oh, look at that. icing on the cake i was just muted :/</em><br>\n<img src=\"https://drama.gg/assets/files/2021-12-03/1638556398-54674-image.png\" title=\"\"></p>\n\n\n<p><em>and for lamaker, or whoever mentions 'you can email the support address', i tried before ever asking about this stuff here. I got a noreply email back saying it was also down :/</em></p>","editedAt":"2021-12-03T18:37:55+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"4993"}},"editedUser":{"data":{"type":"users","id":"4993"}},"discussion":{"data":{"type":"discussions","id":"34"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"36789"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"4993","attributes":{"username":"whosthisagain","displayName":"whosthisagain","avatarUrl":"https://drama.gg/assets/avatars/1HGmNQBvk7KoBZgo.png","slug":"whosthisagain","joinTime":"2021-12-03T18:14:44+00:00","discussionCount":0,"commentCount":11,"canEdit":false,"canDelete":false,"lastSeenAt":"2021-12-03T20:21:13+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"4994","attributes":{"username":"Falix_Lily","displayName":"Falix_Lily","avatarUrl":null,"slug":"Falix_Lily"}},{"type":"discussions","id":"34","attributes":{"title":"Lamaker/ItzAwesome/Lily/Pamar | FalixNodes/Falix.gg & PrimeSRV","slug":"34-lamakeritzawesomelilypamar-falixnodesfalixgg-primesrv","isApproved":true}},{"type":"posts","id":"36789","attributes":{"number":1751,"createdAt":"2021-12-03T19:35:13+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/34/1750\" class=\"PostMention\" data-id=\"36788\">whosthisagain</a></p>\n\n<p>Hey, sorry that you had issues with our services and as of our last talk, we have issued refund to your transaction, however I would like to clarify few things out of what you have commented there.</p>\n\n<p>First of all, I have checked your transaction history with us and I can not find any duplicate transactions made under email address you have provided us earlier, proof here - <a href=\"https://imgur.com/1DDFVmH\" rel=\" nofollow ugc\">https://imgur.com/1DDFVmH</a> (censored data for obvious reasons)</p> \n\n<p>Regarding tickets situation, my apologizes that our Discord ticket system is indeed bit overwhelmed with support requests, it may have happened due to reasons such as major update announcement which was asked for many users to open support ticket. We do not falsely report amount of tickets and it is indeed real tickets, proof - <a href=\"https://imgur.com/a/8zLlzLu\" rel=\" nofollow ugc\">https://imgur.com/a/8zLlzLu</a></p>\n\n<p>Regarding the ignore at the direct message level, it is our staff member right either to ignore user or help them in the direct message since in correct way, you should contact us either through Discord public channel (if it is not sensitive case), Discord ticket system or email.</p>\n\n<p>About the employees, we do have legal employees and volunteers, our Discord server support team (do not confuse it with company employees) are volunteers whos goal is to help people for generic issues, regarding legal employees, we currently have 3 legal employees at company which receive salary for their hourly work.</p>\n\n<p>And finally, our mail server is up and running, I have made testing email and it works just fine, are you sure something have not went wrong in your side? Proof - <a href=\"https://imgur.com/a/D8IN6He\" rel=\" nofollow ugc\">https://imgur.com/a/D8IN6He</a></p>\n\n<p>Thanks for your read.</p> "},"relationships":{"user":{"data":{"type":"users","id":"4994"}},"discussion":{"data":{"type":"discussions","id":"34"}}}}]}