{"data":{"type":"posts","id":"3731","attributes":{"number":100,"createdAt":"2020-10-25T09:56:50+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/34/92\" class=\"PostMention\" data-id=\"3722\">Jeekie</a> The part of that \"Contract\" Was about Pamar providing a VPS. I choose to get the VPS from FalixNodes instead of any providers. So I don't see what rule I broke from the ToS...? I should've stuck to any other hosting, so my files would not get removed.</p>\n\n<p>The VPS I was supposed to get was from Contabo. But I wanted to be a good guy and buy it from FalixNodes.</p>\n\n<p><img src=\"https://winterhoax.com/assets/files/2020-10-25/1603619487-192088-image.png\" title=\"\"><br>\nThe \"Contract\" doesn't say anything that my VPS will get REMOVED if I will start trash talking. He just says that he will provide me a VPS. So you, literally deleted my files, without any announcement of doing that and there is no rule in the ToS that I broke so my VPS will get removed. So you are the same guy, that was in the past. You just want some money to satisfy your needs, you don't give a fuck about our files, or your customers. So you are the same trash guy that you've were. People never change. So everyone that is reading this post, be aware of your files. Backup them every minute you can, because they can get deleted by any staff member, or even ItzAwesome himself, without any reason.</p>","editedAt":"2020-10-25T09:57:52+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"discussion":{"data":{"type":"discussions","id":"34"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"3735"}]},"reactions":{"data":[]}}},"included":[{"type":"discussions","id":"34","attributes":{"title":"Lamaker/ItzAwesome/Lily/Pamar | FalixNodes/Falix.gg & PrimeSRV","slug":"34-lamakeritzawesomelilypamar-falixnodesfalixgg-primesrv","isApproved":true}},{"type":"posts","id":"3735","attributes":{"number":104,"createdAt":"2020-10-25T10:06:10+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/34/100\" class=\"PostMention\" data-id=\"3731\">mituishere</a> however, you broke your partnership contract with falixnodes, not lamaker. We had full rights to do what we did. If you notice, every single one of our paying customers did not loose anything.</p> "},"relationships":{"discussion":{"data":{"type":"discussions","id":"34"}}}}]}