{"data":{"type":"posts","id":"47442","attributes":{"number":1,"createdAt":"2022-05-10T16:57:22+00:00","contentType":"comment","contentHtml":"<p>Hey there. I am going to provide some \"background information\" before we actually get on with the story, because I feel it just makes sense to have the info there as it makes a difference when reading through. Feel free to skip this part, however some of this thread requires the information noted below.</p>\n\n<p>I am the Chief Operations Officer (COO) at Blaze Hosting. We founded the provider in Spring 2021, as you can find in our WHOIS lookup for our domain registration date. Please find below the WHOIS lookup for our domain, blazehosting.org.</p>\n\n<p><img src=\"https://drama.gg/assets/files/2022-05-10/1652199085-677625-image.png\" title=\"\"></p>\n\n<p><strong>BACKGROUND INFO ENDED (pretty much)</strong></p>\n\n<p>Chan (Chan#0003) is currently an Owner at <strong>Blazing Host</strong>, which was registered after the 'main host' (being <strong>Blaze Hosting</strong>). I joined his discord kindly asking that next time he does a full evaluation of the name he selects, just because it can confuse customers who visit the wrong websites, get support for the wrong hosts, all of that stuff. I also mentioned the fact that if he used the full name (Blaze Hosting), he could get in legal troubles for copyright etc so luckily he did not use that name.</p>\n\n<p>I was then instantly banned from the discord server, all because of what happened above and I said that the prices are better elsewhere (such as OVH, Hetzner, FloofyHosting etc etc). I never once mentioned Blaze Hosting until he figured that I was staff there, but once again I was never rude in the 'argument' or 'conversation' we had in his discord server.</p>\n\n<p>As far as I am aware, the founder 'MightyBeard' has nothing to do with the actions Chan has shown us, but that is not yet proven. If there is anything to be proven I will post it in the comments below. Following on, Chan has also proven that he is racist and just generally rude to not only his clients/customers, but his own staff members.</p>\n\n<p>Proof of racism: <img src=\"https://drama.gg/assets/files/2022-05-10/1652200624-611257-image.png\" title=\"\"></p>\n\n<p>There is much more proof which I am yet to collect, however this is just the start of it.</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"4742"}},"discussion":{"data":{"type":"discussions","id":"1928"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"4742","attributes":{"username":"WhenUHackUNoob","displayName":"WhenUHackUNoob","avatarUrl":null,"slug":"WhenUHackUNoob","joinTime":"2021-10-30T08:10:57+00:00","discussionCount":2,"commentCount":42,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-02-25T17:30:25+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"1928","attributes":{"title":"Blazing Host | Bad owner, Racist, Rude","slug":"1928-blazing-host-bad-owner-racist-rude","isApproved":true}}]}