{"data":{"type":"posts","id":"4796","attributes":{"number":332,"createdAt":"2021-01-23T17:10:21+00:00","contentType":"comment","contentHtml":"<p>Also.. I can reveal some information about AltHost.</p>\n\n<p>As i have been an Executive on Alt, i can say to you guys its an absolute horrible experience, bad will scream at you if you dont increase swap on the nodes.. Even the new trial staff is getting orders and is getting shit on by bad.. Bad does literally not care about AltHost, and the fact that he gives people Management/Executive because they wanted to donate a node is a very bad idea as it could result in a nuke on the node by the one that donated the node.. It has been an absolute trash experience to get treated like this..</p>\n\n<p>Also i can tell you, after me and Juicy left AltHost.. Bad has declared a war against me and Juicy's new host. Also he got people to come in and SPAM invites to AltHost.. Im just saying, bad does not CARE about your server data, the only thing he wants is to nuke his own nodes and have fun with it..</p>\n\n<p>Ah you didnt expect that answer right? \"the only thing he wants is to nuke his own nodes and have fun with it..\" You would think that he just wanted it for money, but no apparently not.. Atleast the only for money thing would have been a bit better..</p>\n\n<p>Just dont have servers at AltHost, i would actually say that FalixNodes is 100 times more better than AltHost, atleast FalixNodes is stable.. AltHost is not stable, and they will WIPE your DATA when they feel like it.</p>\n\n<p>Just dont trust AltHost or bad.. Only trust him if you want to get your server/data wiped.</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"discussion":{"data":{"type":"discussions","id":"122"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"discussions","id":"122","attributes":{"title":"ViaHost, Sryden, ExoHost, AltHost, HelioNodes, BlockNode | Bad/Layer","slug":"122-viahost-sryden-exohost-althost-helionodes-blocknode-badlayer","isApproved":true}}]}