{"data":{"type":"posts","id":"48302","attributes":{"number":1,"createdAt":"2022-07-19T21:11:31+00:00","contentType":"comment","contentHtml":"<h3>(ПА)RussiaNodes</h3>\n\n<p>Хотели ли вы когда-нибудь попробовать на вкус самый ужасный хостинг? Нет? Но мы расскажем вам о нём!</p>\n\n<p>RussiaNodes - самый больной и ненормальный хостинг серверов Minecraft за всю историю RU майнкрафта. <br>\nЧем же он так плох? <br>\nПройдёмся по некоторым аргументам:</p>\n\n<p>Владельцы размещают 15000 серверов на 2 узлах Hetzner под free тарифы, а также 1000+ северов на 7 узлах под платные тарифы. Как сообщает сам владелец RussiaNodes (Fanger) - они докупают донатерские узлы, только если SWAP забит на 80% (половина ОЗУ всех узлов - это swap), что же такое SWAP? Swap - файл подкачки, который преобразует дисковое пространство в ОЗУ, однако диск по определению не может быть качественной оперативной памятью, по итогу скорость Swap'а ниже DDR1.</p>\n\n<p>Оплачивают сервера Hetzner через украинца. То есть, если этот украинец уйдёт из состава, то всё, прощай RussiaNodes и все ваши данные.<br>\nСкриншот переписки с сервера хостинга ApexNodes:<br>\n<img src=\"https://media.discordapp.net/attachments/891338946544533556/999061152875171920/unknown.png\" title=\"\" alt=\"\"><br>\nНет никакого собственного AntiDDoS, то есть совсем нету. Протестировав с друзьями мы обнаружили, что VDS на 4 ядра способна положить узел с серверами на их хостинге меньше чем за минуту. Также мы узнали у владельца что у них и правда нет AntiDDoS. Оказывается, по словам владельца, они используют базовую защиту AntiDDOS от OVH. (Хотя на самом деле такой защиты у них нет, на данный момент они её только тестируют, начиная с 15 июля 2022)<br>\nВот скриншот переписки на сервере ApexNodes:<br>\n<img src=\"https://media.discordapp.net/attachments/891338946544533556/999061135217152092/unknown.png\" title=\"\" alt=\"\"><br>\nВсе владельцы хостинга еще ходят в школу (от 13-15 лет). Да, именно так. Вы доверяете благополучие своего сервера малолетним имбицилам с манией величия, которые не умеют здраво оценивать ситуацию и разумно мыслить. Пример: Один их клиент скинул консоль сервера не их хостинга (названий, лого хостинга не было видно). Ему выдали мут. Причина: \"сторонний хост\". Гениально. И таких примеров ОЧЕНЬ и ОЧЕНЬ много.</p>\n\n<p>Панель управления лагает так, что хочется повесится. Вылеты вам обеспеченны.</p> \n\n<p>Нет никакой официальной регистрации будь то ип или еще что. А значит, что если они вдруг решат закрыться, то подать иск в суд, в полицию или куда либо ещё вы не сможете) Прощайте все ваши данные.<br>\nИменно поэтому когда RussiaNodes v1 закрылся из за дешевого дерьмо-провайдера Contabo, вы просрали все свои сборки. Я был в этом числе, в моей сборке было лобби которое я строил 3 часа. Но потом когда я хотел его скачать, бубум и нет RussiaNodes.</p>\n\n<p>Изменили домен с russianodes.ru на russianodes.com т.к не хотят платить налоги.</p>\n\n<p>Панель даже не переведена (например у ApexNodes аддон на языки) и нет никаких аддонов почти (мелочь но факт)</p> \n\n<p>Хостинг 2 месяца назад был на грани закрытия. 20 гигабайт озу за 777 рублей думаю всем понятно что бред.</p> \n\n<p>Кстати, знаете почему так много ОЗУ на тарифах? Это называется SWAP! Они могут купить выделенный сервер на 4 ГБ ОЗУ, много ядер и 4ТБ Диска и от 4 тб диска забрать 252 ГБ для оперативной памяти. Но к счастью они покупают сервера с большим количеством ОЗУ.</p>\n\n<p>Сайт полон уязвимостей, багов и тд. К тому же от дизайна и симетрии сайта глаза болят.<br>\nДополнительно: нет защиты от ботов, придётся ставить ужасный BotFilter или защиту от TCPShield:<br>\n<img src=\"https://media.discordapp.net/attachments/891338946544533556/999060910666678342/unknown.png\" title=\"\" alt=\"\"></p>\n\n<h3>Прочее</h3>\n\n<p>На сайте расположены доисторические отзывы о RussiaNodes v1 (сейчас RussiaNodes v3)</p>\n\n<p>Также отзывы на сайте будут только самые лучшие. Ведь там написано что плохие отзывы они оставят и снизу кнопка оставить отзыв, которая ведёт в группу ВК. Только вот где там оставлять отзыв? Пёс его знает!</p>\n\n<p>Авторизация только через Discord. То есть если вы просто хотели поиграть с друзьями вам придётся регистрировать аккаунт в Discord чтобы потом создать аккаунт на RussiaNodes.</p>\n\n<p>Оплата через FreeKassa и Qiwi. Оплата через FK работает отлично а вот через QIWI можно просрать деньги<br>\nВо первых после перевода на Qiwi нужно открыть страницу для получения денег и написать идентификатор платежа. Во вторых оплата через Qiwi почти всегда отключена. Узнать об этом можно только в Discord-сервере.</p>\n\n<p>После авторизации через Discord вас автоматически подключит к их Discord-серверу. Без разницы, бесплатный вы клиент или нет. Вы все равно будете иметь желание выйти с этого Discord-сервера. Потому-что постоянно, каждый день вы будете видеть @everyone в количестве миллион, при чём по всякой мелочи. Иногда даже там есть реклама никому не нужных видео Fanger'a с @everyone.</p>\n\n<p>Владельцы хостинга почти ничего не делают. Все уязвимости закрывает MrWarka. Который недавно ушёл с RussiaNodes и Fanger сразу в объявлениях написал чтобы Варке в лс спамили \"Вернить на ПарашаНодес\".</p>\n\n<h3>Дискорд сервер</h3>\n\n<p>Как я уже говорил, чрезмерный пинг по @everyone где вам скажут \"DONATOR 1 УПАЛА НА 1 СЕК\".</p>\n\n<p>Канал с новой панелью? Да зачем он! Это же просто html шаблон. Ведь MrWarka ушёл и панель делать некому.</p>\n\n<p>Тех.Поддержка и состав... Самое худшее... Во первых 70% состава и поддержки украинцы. Если вы напишите 1 раз что-то плохо о них, то всё... Бесконечный мут вам обеспечен. Но если они напишут плохо о вас, всем будет всё-равно.</p>\n\n<p>Мелочи Discord-сервера: перегрузка бесполезными каналами, устаревший дизайн, не нужные боты.</p>","editedAt":"2022-07-19T21:16:16+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"6610"}},"editedUser":{"data":{"type":"users","id":"6610"}},"discussion":{"data":{"type":"discussions","id":"1989"}},"likes":{"data":[{"type":"users","id":"6610"}]},"mentionedBy":{"data":[{"type":"posts","id":"48327"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"6610","attributes":{"username":"Fanger","displayName":"Fanger","avatarUrl":"https://drama.gg/assets/avatars/6l9eYYa0qu9oEZc6.png","slug":"Fanger","joinTime":"2022-07-19T21:05:00+00:00","discussionCount":1,"commentCount":1,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-09-30T15:25:16+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"41","attributes":{"username":"Robert","displayName":"Robert","avatarUrl":"https://drama.gg/assets/avatars/y24i4SFwKYCqRsxU.png","slug":"Robert"}},{"type":"discussions","id":"1989","attributes":{"title":"RussiaNodes | SCAM - Массовая потеря данных, взломы/ддос атаки","slug":"1989-russianodes-scam-massovaya-poterya-dannykh-vzlomyddos-ataki","isApproved":true}},{"type":"posts","id":"48327","attributes":{"number":3,"createdAt":"2022-07-20T18:45:58+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/1989/1\" class=\"PostMention\" data-id=\"48302\">Fanger</a> Heya, just for future reference: it is appreciated if you kept your posts and threads in English, thanks.</p>"},"relationships":{"user":{"data":{"type":"users","id":"41"}},"discussion":{"data":{"type":"discussions","id":"1989"}}}}]}