{"data":{"type":"posts","id":"48303","attributes":{"number":2,"createdAt":"2022-07-19T21:38:51+00:00","contentType":"comment","contentHtml":"<p>(PA)RussiaNodes</p>\n\n<p>Have you ever wanted to taste the worst hosting? No? But we'll tell you about him!</p>\n\n<p>RussiaNodes is the most painful and abnormal hosting of Minecraft servers in the history of Minecraft RU.</p>\n\n<p>Why is he so bad?</p>\n\n<p>Let's go through some arguments:</p>\n\n<p>Owners place 15,000 servers on 2 Hetzner nodes at free tariffs, as well as 1000+ norths on 7 nodes under paid tariffs. According to the owner of RussiaNodes (Fanger) - they buy additional nodes only if the SWAP is clogged with 80% (half of the RAM of all nodes is swap), what is SWAP? Swap is a swap file that converts disk space into RAM, but the disk by definition cannot be high-quality RAM, as a result, the Swap speed is lower than DDR1.</p>\n\n<p>Hetzner servers pay through a Ukrainian. That is, if this Ukrainian leaves the composition, that's it, goodbye RussiaNodes and all your data.</p>\n\n<p>Screenshot of correspondence from ApexNodes hosting server:</p>\n\n<p>There is no own AntiDDoS, that is, not at all. After testing with friends, we found that VDS on 4 cores is able to put a node with servers on their hosting in less than a minute. We also learned from the owner that they really don't have AntiDDoS. It turns out that, according to the owner, they use basic AntiDDOS protection from OVH. (Although they don't really have such protection, at the moment they are only testing it, starting from July 15, 2022)</p>\n\n<p>Here's a screenshot of the correspondence on the ApexNodes server:</p>\n\n<p>All hosting owners still go to school (from 13-15 years old). Yes, that's right. You trust the well-being of your server to young imbitciles with megalomania, who do not know how to assess the situation sensibly and think wisely. Example: One of their clients dropped the server console not their hosting (names, hosting logo were not visible). He was given a mud. Reason: \"third-party host\". Brilliant.. And there are VERY, VERY many such examples.</p>\n\n<p>The control panel lags in such a way that you want to hang yourself. The flights are secured for you.</p>\n\n<p>There is no official registration, whether it's an ip or something else. So, if they suddenly decide to close, you can't file a lawsuit with the police or anywhere else) Forgive all your data.</p>\n\n<p>That's why when RussiaNodes v1 closed because of the cheap shit provider Contabo, you fucked up all your assemblies. I was in this number, in my assembly there was a lobby that I built for 3 hours. But then when I wanted to download it, there's no RussiaNodes.</p>\n\n<p>Changed the domain from russianodes.ru to russianodes.com because they don't want to pay taxes.</p>\n\n<p>The panel is not even translated (for example, ApexNodes has an addon into languages) and there are almost no addons (a trifle but a fact)</p>\n\n<p>Hosting 2 months ago was on the verge of closing. 20 gigabytes of ozu for 777 rubles I think everyone understands that it's nonsense.</p>\n\n<p>By the way, do you know why there is so much RAM on the tariffs? It's called SWAP! They can buy a dedicated server with 4 GB of RAM, many cores and 4TB of disk and take 252 GB of RAM from 4 TB of disk. But fortunately they buy servers with a lot of RAM.</p>\n\n<p>The site is full of vulnerabilities, bugs, etc. In addition, the design and symmetry of the site hurts the eyes.</p>\n\n<p>Additionally: there is no protection against bots, you will have to install a terrible BotFilter or protection against TCPShield:</p>\n\n<p>Other things</p>\n\n<p>The site contains prehistoric reviews of RussiaNodes v1 (now RussiaNodes v3)</p>\n\n<p>Also, the reviews on the site will be only the best. After all, it says that they will leave bad reviews and at the bottom there is a button to leave a review, which leads to the VK group. But where to leave a review there? The dog knows him!</p>\n\n<p>Authorisation only through Discord. That is, if you just wanted to play with friends, you will have to register an account with Discord to create an account on RussiaNodes later.</p>\n\n<p>Payment via FreeKassa and Qiwi. Payment via FK works perfectly, but through QIWI you can waste money</p>\n\n<p>First of all, after the transfer to Qiwi, you need to open the page to receive money and write a payment ID. Secondly, payment via Qiwi is almost always disabled. You can only find out about it in the Discord server.</p>\n\n<p>After authorisation through Discord, you will be automatically connected to their Discord server. It doesn't matter whether you're a free client or not. You'll still have a desire to get out of this Discord server. Because all the time, every day you will see @everyone in the amount of a million, and all sorts of trifles. Sometimes even there is an advertisement for anyone who needs Fanger videos with @everyone.</p>\n\n<p>Hosting owners do almost nothing. All vulnerabilities are covered by MrWarka. Who recently left RussiaNodes and Fanger immediately wrote in the ads to spam Varka in HP \"Repair to ParashaNodes\".</p>\n\n<p>Discord server</p>\n\n<p>As I said, excessive ping on @everyone where you will be told \"DONATOR 1 FELL FOR 1 SECOND\".</p>\n\n<p>A channel with a new panel? Why him! It's just an html template. MrWarka is gone and there's no one to do the panel.</p>\n\n<p>Technical support and composition... The worst... First of all, 70% of the composition and support are Ukrainians. If you write something bad about them once, that's all... The endless mud is provided to you. But if they write badly about you, everyone won't care.</p>\n\n<p>Discord server trifles: overloading with useless channels, outdated design, unnecessary bots.</p>\n\n\n<p>**Rough Translation **</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"5393"}},"discussion":{"data":{"type":"discussions","id":"1989"}},"likes":{"data":[{"type":"users","id":"6610"}]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"5393","attributes":{"username":"Win","displayName":"Win","avatarUrl":null,"slug":"Win","joinTime":"2022-01-26T18:21:54+00:00","discussionCount":0,"commentCount":47,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-07-26T10:18:57+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"boy","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"6610","attributes":{"username":"Fanger","displayName":"Fanger","avatarUrl":"https://drama.gg/assets/avatars/6l9eYYa0qu9oEZc6.png","slug":"Fanger"}},{"type":"discussions","id":"1989","attributes":{"title":"RussiaNodes | SCAM - Массовая потеря данных, взломы/ддос атаки","slug":"1989-russianodes-scam-massovaya-poterya-dannykh-vzlomyddos-ataki","isApproved":true}}]}