{"data":{"type":"posts","id":"48569","attributes":{"number":368,"createdAt":"2022-08-24T20:51:18+00:00","contentType":"comment","contentHtml":"<p>Hello, I will start this off with saying that Aces#4773 unless not updated is a scammer and will grief your server or will if you are joining any of his servers I recommend not, he has threatened to leak my files on Direct Leaks if I didn't do certain things for him. When meeting him originally I asked him for help, me being new to creating servers I didn't know what bungeecord was and he assisted making it and promised it to be free, I've created over over 4-5 videos on my server. Also to add onto my first statement. He has added trojan malware into my plugins directory and openly admitted about it. Since he originally owned the server dedicated because I was unable to use my pebblehost server as it had malware that he added which got detected and disabled the server we moved over to a pterodactyl panel. He made me a sub user with no admin permissions and went to disney land for a while and I was unable to do anything. Then he just kept forcing me to wait while my server kept restarting. This is when the server grew from my content. He kept taking credit for the content I made on my youtube channe even though that was where the servers growth came from. So when he came back everytime I would ask him for a small request like can you fix crates or, this server is broken. He would say shutup, or like your a kid at a candy shop. I owned the discord but he owned the panel. Then sped up to this time he released a Lifesteal server without my permission even though I only wanted a Survival server. Then we speed up more hes adding servers I never wanted. And then even more up this is where the drama starts. So I go into lifesteal and he usually just pings everyone advertising another server including his recent server MysticWars which he quick sold, also prior to this moment he wanted me to sell my server for more money and insisted it goes to his paypal while 2 days before that he said his paypal was LOCKED because he upgraded our servers ram from 64gb to 128gb. Then I knew he was trying to scam me. Later on in Lifesteal I notice he hires random staff I never asked for which are all his friends and have no experience with staff. He decides to say if he leaves they leave. To be honest I didn't care if any left I just wanted my panel to stay up as from this point I didn't trust him anymore. He would constantly shutdown and make my server decrease even more. One day I saw a ton of dragon eggs around spawn and the admin he was friends with had a sword with KOTH bonuses and sharpness 255. And some other people had shulker boxes with barriers. I tried telling him don't do that. Me now being scared of him as he could shut my server down. So later on he tells me to migrate to this server and then we have a bit of chat. He continues to freeload in my discord server and ping everyone for random things like, I am going on my first date with his handsome guy, or like I just had my first kiss, this is from his pov with an @everyone mention and random things that no one cares about. He also mutes people when he gets offended. Another client of his fired him and charged back because he thought Aces was sketchy. So anyways apparently when I come home one day from eating ice cream he starts talking about how I slandered him or something and then shuts down the panel. Then I say sorry because I have no clue theres no reason to abuse your power. So the server went back up and he said migrate ur stuff before the month. He owned lots so I had to migrate with my new sysadmin and we got a Ryzen 9 5950x and r00t to optimize which is way better. He threatened to nuke my mysql database which I changed the password to and when he was at work since he was at work for around 3 weeks and asking for a pay he agreed on $60. Per month even though he said for free. So I paid him the $60 and now he wanted pay this month while he did nothing but advertise his server etc. So then later he ends up resetting my lifesteal server and making a new season while no one wanted it, so then he ends up being a prick, when he was at work I migrated everything to a new panel and fired him. Then later on he threatens to ddos etc, and the reasoning I am making the post after all that painful dealing with him is because I banned him from the discord and then unbanned him to welcome him<br>\nback as I felt as if its cooled down but hes just a terrible individual so he decided to spam ping in announcements and update logs when I was eating cereal because with corebot it gives you back the roles you had before you left the server. So he spams everyone and still called himself the victim. Please anyone check out his mc-market. Tide Development even all his friends know he quick-sold all his servers. It is not worth it putting in time and playing as it will be a non long term server so I recommend playing my server I own as it has grown significantly and I have the correct people in contact and now have had more of viewable long term server as before I worried with him if he quits anytime he shuts down the server with it. Dont play any of his servers, don't work with him if hes ever offering it. I will be sending picture proof for anyone requesting it.</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"6758"}},"discussion":{"data":{"type":"discussions","id":"83"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"6758","attributes":{"username":"AcesLikesScamming","displayName":"AcesLikesScamming","avatarUrl":"https://drama.gg/assets/avatars/AoHPWrzbzIFEAoP5.png","slug":"AcesLikesScamming","joinTime":"2022-08-24T02:49:43+00:00","discussionCount":1,"commentCount":2,"canEdit":false,"canDelete":false,"lastSeenAt":"2022-08-24T22:07:59+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"83","attributes":{"title":"SnowyHosting, BombHosting & OrbitNodes |  Rectrox/RoseyMC","slug":"83-snowyhosting-bombhosting-orbitnodes-rectroxroseymc","isApproved":true}}]}