{"data":{"type":"posts","id":"48628","attributes":{"number":28,"createdAt":"2022-08-27T02:35:15+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/2018/26\" class=\"PostMention\" data-id=\"48626\">Pelotudo_</a></p>  \n\n<blockquote class=\"uncited\"><div><p><em><strong>In English | En ingles:</strong></em></p></div></blockquote>\n\n<p>What happened, you screwed up, so far nobody sent me a DM saying something, it seems that you are 11 years old. Besides, you and your friend asked me for my IP to fuck it (I passed it on because they're some kids who use stressers) and they haven't even thrown it at me yet, they did the cool and everything and they're both full kuakers, I asked you what it was a ddos ​​and you blocked me. You also sent me an IP (which wasn't yours) and you told me that I doxed you (he who doesn't know, with an IP you can't dox a person, since the IP gives you the generic location information, where the post is ; then there you show that you are a kuaker saying that with an ip you can dox, the real clown). Besides, it shows that you are more kuaker when you say that you are going to throw away the wifi, when in reality the \"wifi\" is the internet signal, that is, the wifi is not stupid, what is thrown away is the service through a packet attack , that to do it a vps is used (something that you probably don't even know what it is). Well I don't know what else you want me to say and keep humiliating you, I forgot something... HAHAHAHA...</p>\n\n<p>What makes you look more kuaker than all of the above (that you were re-seen as a kuaker), is that you told me this:<br>\n<em><strong>Asshole</strong></em><strong>#5718: send a picture of a \"Nmap\" shortcut<br>\nAsshole<em>#5718 says: if I don't know how to dose anything<br>\nAsshole</em>#5718 says: tell me what that is<br>\nAsshole<em>#5718 says: bitch</em></strong></p>\n\n<p>Here I leave a screenshot of the chat: <br>\n<img src=\"https://cdn.discordapp.com/attachments/960199784168325151/1012911515294240769/unknown.png\" title=\"\" alt=\"CAPTURA\"><br>\nHere we see a clear example of kuaker, you may wonder why? Well this is because \"Nmap\" is a program that scans a network for low security or open ports, so that it can do something about those bad ports. If you did not know, it is a program that is mainly found in the Linux distribution, called \"Kali Linux\", this distribution is mostly used by people who study Computer Security or people who learn ethical hacking. Well you are not any of those, you are a Spanish who flashes and is just a kuaker.</p>\n\n<h3>Kuakers tag:</h3>\n<ul><li>Pelotudo_#5718</li>\n<li>Solarion#6233</li></ul>\n\n<blockquote class=\"uncited\"><div><p><strong><em>In Spanish | En español:</em></strong></p></div></blockquote>\n\n<p>Que pasa pa te cagoneaste, hasta ahora nadie me mando un md diciendo algo, parece que tenes 11 años. Aparte vos y tu amigo me pidieron mi ip para tirarmela (se las pase pq son unos nenes q usan stressers) y ni me la tiraron todavia, se hicieron los piolas y todo y son full kuakers los dos, te pregunte que era un ddos y me bloqueaste. Tambien me mandaste una ip (que no era tuya) y me dijiste que te doxeé (el q no sabe, con una ip no se puede doxear a una persona, ya que la ip te da la información de localización genérica ósea donde esta el poste; entonces ahí demuestras que sos un kuaker diciendo que con una ip se puede doxear, el verdadero payaso). Aparte demuestra que sos mas kuaker al decir que me vas a tirar el wifi, cuando en realidad el \"wifi\" es la señal del internet, ósea que el wifi no se tira bobo, lo q se tira es el servicio mediante un ataque de paquetes, que para hacerlo se usa una vps (algo que seguro ni sabes q es). Bueno no se que mas queres que te diga y te siga humillando, me olvide de algo... JAJAJAJ...</p> \n\n<p>Lo que te hace quedar mas kuaker de todo lo anterior (que quedaste re visto como kuaker), es que me dijiste esto: <br>\n<em><strong>Pelotudo</strong></em><strong>#5718: manda una foto de un acceso directo de \"Nmap\"<br>\nPelotudo<em>#5718 dice: si no se dosear nada<br>\nPelotudo</em>#5718 dice: dime que es eso<br>\nPelotudo<em>#5718 dice: perra</em></strong></p>\n\n<p>Aca dejo captura del chat: <br>\n<img src=\"https://cdn.discordapp.com/attachments/960199784168325151/1012911515294240769/unknown.png\" title=\"\" alt=\"CAPTURA\"><br>\nAcá vemos un claro ejemplo de kuaker, se preguntaran ¿por que? Bueno esto de debe a que \"Nmap\" es un programa que escanea una red para buscar puertos con bajos niveles de seguridad o abiertos, para así poder hacer algo con esos puertos defectuosos. Si no sabias, es un programa que se encuentra principalmente en la distribución de Linux, llamada \"Kali Linux\", esta distribución se usa mayormente en la gente que estudia Seguridad informática o la gente que aprende hacking ético. Bueno vos no sos ninguno de esos, vos sos un español que flashea y nomas es un kuaker.</p>\n\n<h3>Tag de los kuakers:</h3>\n<ul><li>Pelotudo_#5718</li>\n<li>Solarion#6233</li></ul>","editedAt":"2022-08-27T02:50:18+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"6782"}},"editedUser":{"data":{"type":"users","id":"6782"}},"discussion":{"data":{"type":"discussions","id":"2018"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"48631"},{"type":"posts","id":"48645"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"6782","attributes":{"username":"Shine","displayName":"Shine","avatarUrl":"https://drama.gg/assets/avatars/DKiOOBBm1LJv3EvK.png","slug":"Shine","joinTime":"2022-08-27T02:00:11+00:00","discussionCount":0,"commentCount":8,"canEdit":false,"canDelete":false,"lastSeenAt":"2022-08-28T05:26:16+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"6777","attributes":{"username":"DarkKing","displayName":"DarkKing","avatarUrl":"https://drama.gg/assets/avatars/oMpKIaeO1WCxbRLW.png","slug":"DarkKing"}},{"type":"users","id":"6765","attributes":{"username":"Pelotudo_","displayName":"Pelotudo_","avatarUrl":"https://drama.gg/assets/avatars/7NFdxhIdi8rZrgHr.png","slug":"Pelotudo_"}},{"type":"discussions","id":"2018","attributes":{"title":"Starnode/Vainki The worst hosting and a horrible person","slug":"2018-starnodevainki-the-worst-hosting-and-a-horrible-person","isApproved":true}},{"type":"posts","id":"48631","attributes":{"number":30,"createdAt":"2022-08-27T04:12:42+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/2018/28\" class=\"PostMention\" data-id=\"48628\">Shine</a> The idiot thinks nmap is for doxing jajjajaja</p>\n\n<p>nmap is only for scanning ports lmao</p>"},"relationships":{"user":{"data":{"type":"users","id":"6777"}},"discussion":{"data":{"type":"discussions","id":"2018"}}}},{"type":"posts","id":"48645","attributes":{"number":37,"createdAt":"2022-08-27T17:38:38+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/2018/28\" class=\"PostMention\" data-id=\"48628\">Shine</a> First of all do you have any proof of all this? you only insult and talk a lot if you don't remember I have all the fucking MD of disord all you did is come and insult nothing else we were peacefully asking vainki questions until we asked him to solve everything peacefully as you can see in the chat screenshots<br>\n<img src=\"https://drama.gg/assets/files/2022-08-27/1661621815-226919-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2022-08-27/1661621838-957740-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2022-08-27/1661621886-823011-image.png\" title=\"\"></p>\n\n<p>later he added you the only thing you did was insult us all I deleted you twice because the first time vainki didn't tell us who he was then he said a \"friend\" we left him you joined and started insulting and in addition there were 2 MD 1 was lost</p>"},"relationships":{"user":{"data":{"type":"users","id":"6765"}},"discussion":{"data":{"type":"discussions","id":"2018"}}}}]}