{"data":{"type":"posts","id":"48635","attributes":{"number":1,"createdAt":"2022-08-27T10:37:57+00:00","contentType":"comment","contentHtml":"<p>So to begin with, I do not wish any hate or harm against Humble, I am just sharing my side of the story and I am wondering about your opinions.</p> \n\n<p>August 2nd of 2022 I started my role as \"support member\" over at Humble Servers. At this time it was very abrupt. I had sent in an application two days prior, and received this after only talking a bit about me being a Swedish college student. <img src=\"https://drama.gg/assets/files/2022-08-27/1661594911-692562-image.png\" title=\"\"></p>\n\n<p>While working at Humble I saw some very serious flaws in the support team. The people I worked with were amazing, but the way the entire staff system is set-up is straight up flawed. I was told early that usually newcomers to the staff team have a 2-4 week trial period. Where they get less pay than the rest of the team. I had no issues with this as I understand why you would have a system like this in place.</p>\n\n<p>About 2 weeks into August, the Manager \"_w41k3r\" informed the support team that he was dissatisfied with the current activity of newcomer support members. And while this was accurate to some extent of the support team, it did not apply to me. I had been very active, even working nights just doing support work.</p>\n\n<p>So I kept on working, kept on doing the night-shift when no one else was on, keeping to myself, warning when I would not be able to get on, and then again making sure everyone knew when I could get on.</p>\n\n<p>And after about 3 weeks of working over at Humble, I received this message whilst waking up today, August 27th 2022.<br>\n<img src=\"https://drama.gg/assets/files/2022-08-27/1661595024-282735-image.png\" title=\"\"></p>\n\n<p>I was later informed that this was in fact a copy-pasted message given to multiple support members.</p>\n\n<p>I found it extremely unprofessional to just get a message like this out of the blue, with no prior communication or even messaging.<br>\n<img src=\"https://drama.gg/assets/files/2022-08-27/1661595440-793010-image.png\" title=\"\"></p>\n\n<p>As soon as I received my termination message, I sent a couple of messages to \"_w41k3r\" telling him I was dissatisfied with it. The conversation went like this:<br>\n<img src=\"https://drama.gg/assets/files/2022-08-27/1661595681-419838-image.png\" title=\"\"></p>\n\n<p>He acted as if just because multiple people had received the message and we were \"trial members\", it was okay.</p>\n\n<p>And so I immediately went to the main staff discord channel and stated my displeasure to the entirety of the support team, and here is how that went: <br>\n<img src=\"https://drama.gg/assets/files/2022-08-27/1661595769-728226-image.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2022-08-27/1661595784-723663-image.png\" title=\"\"></p>\n\n<p>My previous colleges try do explain the situation further, even though they (as far as I know) do not know anything about it. All I had been told at this point was that</p> \n\n<blockquote class=\"uncited\"><div><p>We've given it some thought, and we've determined that your output falls short of what a team member at HumbleServers should be putting in</p></div></blockquote>\n\n<p>And that did not really say a lot. As \"ARandomGuy\" tells me, I have to look into what I \"messed up\", which I am already aware of. The first week of the college term took a toll on my activity, which I warned for before the week started. He also tells me some advice for the \"IT Support\" business that I have already been apart of for YEARS at this point.</p>\n\n<p>\"_w41k3r\" also goes on to talk about that displeasure he felt 2 weeks into august, which I was not really a part of.</p>\n\n\n<p>I also wrote a Trustpilot review (which is still pending) about my experiences with them as a customer and a support member.</p>\n\n<p>I just find this entire situation extremely abrupt and unprofessional, a little bit of information and communication could have solved a lot of issues and confusion. But as I have observed, this is how the Management often manages things.</p>\n\n<p>The Management seems to be \"_w41k3r\" and the owner \"Jake\" who has been on like 3 times since I started working there in the beginning of August.</p>\n\n<p>Apart from that I wish anyone involved in this host good luck, and I would like to see other peoples opinions on this.</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"3945"}},"discussion":{"data":{"type":"discussions","id":"2022"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"3945","attributes":{"username":"Rismose","displayName":"Rismose","avatarUrl":"https://drama.gg/assets/avatars/TBPYgt5babRpzc7N.png","slug":"Rismose","joinTime":"2021-07-08T23:37:31+00:00","discussionCount":2,"commentCount":15,"canEdit":false,"canDelete":false,"lastSeenAt":"2022-08-27T20:16:20+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":"oeC6JTaU8LsTGKBM.jpg","cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"Full-stack Developer, Mainly Java Dev","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"2022","attributes":{"title":"Humble Servers and it's support team","slug":"2022-humble-servers-and-its-support-team","isApproved":true}}]}