{"data":{"type":"posts","id":"49103","attributes":{"number":9,"createdAt":"2022-10-30T01:24:43+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/2063/8\" class=\"PostMention\" data-id=\"49100\">Koisip</a> Hey man! My name is callum and I was the official owner of snowynode which sadly shut down until further notice. The website theme was giving to me by a hosting Ive known for ages as they didn’t use it anymore and yes that’s my fault for not finishing the template due to school starting again. I understand the FIVEM TOS part but you see Allmost every big and small hosting company doing it am I wrong? I’m not trying to start a fuss as the company has shut down now. But I would just like to reply to this and fill you lot on some information. We don’t scam I could see the point we’re he was coming from about it as I didn’t finish things as I was the only one who kinda knew how to do it all and was basically on my own, Bryce was alright for a few days then he starting being rude to members in snowynode saying racist comments, being horrible, then it started happening to me saying I was gay, racist comment to me, telling me to hurry up with things when I wanted to take my time with putting stress on me, saying I didn’t know how to do my job and I was shit at it so I lost abit of confidence in hosting. I did give Bryce several warnings and members on snowynode did come to me about Bryce saying you will lose your company but I kept giving second chances which I shouldn’t have so it’s partly my fault. But by giving the second chances we lose reputation in our hosting. But Bryce will no longer be executive in any of my hostings in future. So I shut down snowynode because of that loss of reputation and the way he treated me as I didn’t have no more confidence left in me. But a few of my hosting mates saw how he treats the community and spoke to him you would have seen some of the screen shot further up about it which made me a little happy that some people had my back. I allways tried my best with the hosting but he dragged it down to the point we’re there is no more snowynode.</p>\n\n<p><strong>If you lot have any questions please reply and I will get back to you when I can thank you 🙂</strong></p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"6950"}},"discussion":{"data":{"type":"discussions","id":"2063"}},"likes":{"data":[{"type":"users","id":"2904"},{"type":"users","id":"2906"}]},"mentionedBy":{"data":[]},"reactions":{"data":[{"type":"post_reactions","id":"1758"}]}}},"included":[{"type":"users","id":"6950","attributes":{"username":"DCTM","displayName":"DCTM","avatarUrl":"https://drama.gg/assets/avatars/WJ77rAR1vIxLmDhE.png","slug":"DCTM","joinTime":"2022-10-30T01:04:18+00:00","discussionCount":0,"commentCount":1,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-02-20T02:03:42+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"2904","attributes":{"username":"Koisip","displayName":"Koisip","avatarUrl":"https://drama.gg/assets/avatars/Nl3bydjI1g3Jhp6m.png","slug":"Koisip"}},{"type":"users","id":"2906","attributes":{"username":"EmeraldMike","displayName":"EmeraldMike","avatarUrl":"https://drama.gg/assets/avatars/1rg2pycqBRDqnLR9.png","slug":"EmeraldMike"}},{"type":"discussions","id":"2063","attributes":{"title":"SnowyNodes - Being Shit at a Reliable Cost! ","slug":"2063-snowynodes-being-shit-at-a-reliable-cost","isApproved":true}},{"type":"post_reactions","id":"1758","attributes":{"userId":2904,"postId":49103,"reactionId":3}}]}