{"data":{"type":"posts","id":"49453","attributes":{"number":1,"createdAt":"2022-11-14T00:45:30+00:00","contentType":"comment","contentHtml":"<p>Hi guys, I was casually exploring arround drama.gg and i found a lot of posts saying that QloxHost abuse hetzner, does carding, etc. Im here to tell you people why QloxHost ISNT illegal.</p>\n\n<p>Questions.<br>\n-Why QloxHost did go down every 2 or less weeks?<br>\nAt first, we didnt know, but after a lot of time, we finally found +15 Crypto miners into the nodes trying to suspend the nodes. We found who sent those miners but i will not say who was it because i dont want to make another hosts war.</p>\n\n<p>-Why our nodes got suspended A LOOOOTTT of times?<br>\n1- Crypto miners (Explained above)<br>\n2- Ddos, some members can remember that we got like 20 ddos per day, well, because of that, hetzner and another DEDIS providers, thought we were auto-dddosing ourselves, and thats illegal so they suspended the nodes.<br>\n3- Before, we had a co-owner (I wont mention him because i dont want hosts war) that was the one who gave us ALLLLL the hetzner vpses, and we didnt know, that the accounts were carded because the old co-owner didnt give us the hetzner account to see the payment method, just the vpses.</p>\n\n<hr>\n<p>Some people, werent talking about the host, instead, they were talking about the owner (Alex, Milan, Qloxhost) and yes, he is sometimes rude with the people and gets mad easely, but that doesnt means he is a bad owner, he is just rude when, example, you dont use your common sense, you piss him off when he is playing / working, and another situations.</p>\n\n<p>I just came to explain this because the people is so confused about Qlox and they throw fake info from drama.gg posts without knowing if the info is real or fake.</p>\n\n<p>Telling all this, if you want to throw hate to this post, throw it, I barely open drama.gg.<br>\nIf you understood, leave a ✔ or idk.<br>\nGoodbye</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"6949"}},"discussion":{"data":{"type":"discussions","id":"2077"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"6949","attributes":{"username":"MerK2","displayName":"MerK2","avatarUrl":"https://drama.gg/assets/avatars/PUUGuYSC1FuVU9R9.png","slug":"MerK2","joinTime":"2022-10-29T21:07:06+00:00","discussionCount":1,"commentCount":12,"canEdit":false,"canDelete":false,"lastSeenAt":"2022-11-20T04:03:49+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"2077","attributes":{"title":"Is QloxHost a Fraud? No!!!","slug":"2077-is-qloxhost-a-fraud-no","isApproved":true}}]}