{"data":{"type":"posts","id":"49481","attributes":{"number":20,"createdAt":"2022-11-17T19:08:30+00:00","contentType":"comment","contentHtml":"<p>All of you here are fucking dumb fucks,  legit all of you ARE stupid than me.  \"alvapepsi\" is not scamming anyone, and \"CloudMC\" ain't shit, they just don't have many funds for hosting but they are trying their best. \"Badsk\" - the #1 scammer on discord shall I call him? Yes, we know he fucking scams. Does not mean   \"alvapepsi\" is also. Ik  \"alvapepsi\" cuz when he sold his GCP to badsk it was for funding of Yeliactyl. People mighty think khootiee is stupid dumb, and can't run a host. Well, he can if he had the funds to like Badsk. Badsk using free credit and trials for Halex (The causes of Data Loss if you were wondering). He used to card.   \"alvapepsi\" does not realize he is getting used by Badsk, like how khootie used  \"alvapepsi\".  Everyone on this thread is dumb, ye go ahead I don't give a fuck call me dumb cuz i messaged on this thread. You gotta know CloudMC will have no data loss as soon as it gets funds. Unlike Halex fucking DM advertising in my DMs. Boris Dickinson#5788 and Lee Gibson#4505 their profile pictures as businessmen., who tf would do that, Ik CloudMC would not. \"alvapepsi\" AkA ItzScripts please leave Badsk as soon as you can, I am saying this for your future and you rep. Me and khootiee know Badsk well from when he took over CloudMC and joint it with Fucking Halex. Khootie I hope u fucking learned a lesson from that. Now back to the topic of Scamming. Don't fucking use hosts that use trial providers unless they have a channel showing proof of payment. Trust me on Halex Re-Launch Halex is gonna get ddosed very hard. Yes harder than your dad in bed with your mum. Ik many people who would do it. I not gonna name them here. Now fucking leave \"alvapepsi\" and CloudMC alone.  Btw remember HC7, HC6, HC5, HC3 fucking halex shit.</p> \n\n<p>I feel bad for members who host on Halex and CloudMC.<br>\nPlease just use paid host, if you afford that use oracle cloud free tier to host you mc server, and use TCP shield or Catto shield to protect it. If you don't want to use that, use OptikServers ot FalixNodes or Avex (releasing soon, not data loss will occur)</p>\n","editedAt":"2022-11-17T19:08:39+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"6973"}},"editedUser":{"data":{"type":"users","id":"6973"}},"discussion":{"data":{"type":"discussions","id":"2078"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"49482"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"6973","attributes":{"username":"Snyder","displayName":"Snyder","avatarUrl":"https://drama.gg/assets/avatars/szZFny8Sqy32xb9Q.png","slug":"Snyder","joinTime":"2022-11-09T16:29:48+00:00","discussionCount":0,"commentCount":32,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-08-18T22:49:42+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"6975","attributes":{"username":"alvapepsi","displayName":"alvapepsi","avatarUrl":"https://drama.gg/assets/avatars/Yz8WeIqCTodEnJvE.png","slug":"alvapepsi"}},{"type":"discussions","id":"2078","attributes":{"title":"Halex badsk and alvapepsi known as \"ItzScripts\" scamming its members.","slug":"2078-halex-badsk-and-alvapepsi-known-as-itzscripts-scamming-its-members","isApproved":true}},{"type":"posts","id":"49482","attributes":{"number":21,"createdAt":"2022-11-17T19:11:34+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/2078/20\" class=\"PostMention\" data-id=\"49481\">Snyder</a> I agree on some parts of the message.</p>"},"relationships":{"user":{"data":{"type":"users","id":"6975"}},"discussion":{"data":{"type":"discussions","id":"2078"}}}}]}