{"data":{"type":"posts","id":"49600","attributes":{"number":36,"createdAt":"2022-12-18T23:09:20+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/140/32\" class=\"PostMention\" data-id=\"49037\">DARKRABBIT</a></p> \n\n<p>This is qwerty537 speaking through NutellaOsamas Account.</p>\n\n<p>Firstly, I'm not banned from Doxbin, I just decided to leave it and start a new life.</p>\n\n<p>Secondly, I have never done a NFT Scam and I never will, the NFT you see on my OpenSea is originally my NFT made by me. In addition to that, you have no proof of your statement. The Q537WDA is clearly a mark quoting \"Qwerty537 Warlocks Dark Army\" which clearly shows proof that it’s my NFT, so are the word NFTs too which I generated using Artificial Intelligence and the others is of my friend whose an Artist and he works for Law Enforcement too which I’m helping him sell as a contractor (We have a legal business contract to do this).</p>\n\n<p>Thirdly, You're right about me being behind a ransomware program that currently doesn’t exist anymore because I left the fraud business and I’m no longer a fraudster. Matter of fact, I never was, the ransomware wouldn’t even succeed anyway.</p>\n\n<p>Forthly, being 99% monkey isn’t racist, it’s a scientific fact that the DNA is indeed 99% of an ape and 1% of a human and that’s why we have people like you who act like a monkey because your monkey DNA has dominated your human DNA. Same goes for naughty kids who play around like hooligans in schools or people who act like hooligans; I’m a hooligan too and so are my friends from back to my high school (we even have a Hooligan WhatsApp Group), so I can accept that I’m a monkey too. Everyone is a monkey and there’s no denying this because it’s not racist, it’s science. Schools teach the same thing as I learnt this from High School when our headmaster came to us teaching us about human behavior and how it works. If you think your DNA isn’t monkey then question your behavior rather, Mr. Egert, maybe that will make you understand why you act weird or why teens bang tables when they’re bored in class or similar. Think about it.</p>\n\n<p>Fifthly, Just because you think Africans are dumb and poor doesn’t mean they are dumb and poor, if you’ve never been in Africa yourself, you can’t know this. Matter of fact, almost everyone I hang around with are rich with millions of dollars and they’re not dumb, these guys are business men and Mafia, some of them even run the Government or are in the Government. Matter of fact, I live right next to Don Kassims Residence. Don is simply a Mafia Gangster, if you Google the term and interpret it in Italian, not English. This dudes rich too and his family whose a close family friend of mine works in Politics too (he’s the dude who normally finds ways to get us out of trouble too or sometimes even puts us in trouble if he wants depending on what his heart desires) but he’s a good friend of ours and I don’t think he’ll ever put us in trouble with cops again. The dude knows Politics quite well that he even told us the Political Party is always higher than the President in any country, which explains how powerful he is. Remember back in the days when you guys said you’re gonna try get the feds to me and I said I have connections to people that are in high power in Government, this is just an example of one person whom I know. Also, since he has access to everything we can’t hide from him, there’s nothing anyone could do if a person like him catches anyone, I mean seriously, this dude has the technology to even decipher end to end encryption. Last time my brothers friend was wanted (Well, he wanted to take some girl as his girlfriend and that girl was a daughter of someone with high power in Government, so he hid her in a hotel because she was marked missing after not coming back home a few days and it turned into a kidnapping case, even though it wasn’t), he was the one with access to all the information hidden which my brothers friend was hiding from him after he got caught and showed everything to him (WhatsApp Messages, Telegram Chats, Location History and Everything), that way he knew there’s nothing to hide and he had to tell the truth. Eventually, he did and the case was solved after the girl was found in a hotel then he helped release him. This just shows you can’t hide anything from the Government bro and if the Government really wanted you or me to get arrested, they would have done it earlier. Well, I’m not a criminal anymore, I’ve changed, in this case, Government can just disregard any past evidence and they’ll never come after you again, if they keep monitoring you and see you’ve really changed and stopped crimes. If you’re still committing crimes then it could be that they’re just watching you and they’re just giving you time to change and if they see no change in sometime, they’ll come after you, just like they did with the fraudster friend of mine in Nigeria who got arrested by the FBI.</p>\n\n\n<p>Sixthly, You seem to be larping hard. Like clearly, why do I need to explain that I used to be with LulzandFeelz when it’s clearly in the dox and fully explained either way. All I had to do is post the dox here and leave it for people to check it out and they will then they will automatically know that I used to cooperate with Lulz just so that I could expose her till she ran away lol.</p>\n\n\n<p>Seventhly, that dox on Officer Travis Scott Patterson wouldn’t have been produced without me helping you since I’ve done most of the work and you’re clearly lying about everything concerning the dox. Me and You did it together and you promised a pay to me which you scammed and never sent me. Inclusive to this, I did most of the OSINT and the remaining information was given by Ahmad, which is why I gave him credit since he contributed to the information from Background Checks. The OSINT on his emails and all, I did and you did the recording from my account since you had full time access which I had granted you with exported chats as well.</p>\n\n<p>Eightly, Doxbin is afraid of me because of the advantage I took over Doxbin Admin Brenton that made him angry (It wasn’t CP, but a good technique I used to take advantage of him using his relationship with a 16 Year Old girl whom he was hitting up on that I caught red handed of him asking about her boobs, him asking her for e-girl attention and such, not to forget that he even had some coke and cheated with 4 girls on his real gf too) which literally led him to even block me, get info on me from Intelx and the next day made a new dox on me, but Idc about the motherfucker either way and neither do I care about the dox. Also, I don’t care about Lulz Dox that I did, Drs dox or anything, Doxbin is totally useless.</p>\n\n<p>Ninthly, You got me into big trouble yesterday for taking down my workplace website (Hypehost.io) which was a business we just started and caused plenty of our money we invested into the project to go down the drain, but I really don’t care about that anymore (The friend who helped start the business forgave me and said we'll invest in a different project), but I just have to let you know that what you did was fucked up bro. He used his own real card, and his own money that he worked for to start the site up and used a theme from Wordpress Theme Store which we were gonna make better and fix before actually advertising it and making money through the hosting but you fucked everything up and he was even pissed off at me because I emailed you from work mail, but he forgave me the next day, but we’re lucky you didn’t take down the other dudes website because that would risk both me and my friends life because the other site belongs to someone big with a Million Dollar Business, G. Anyway, my friends donating more money into starting another business, but this time I told him to make a Business Plan and get documents for the business so we don’t have any fuckups, so even if you report the other business that we start, we’ll have legal documents and a Business Plan to provide to prove we aren’t fraudulent.</p>\n\n \n<p>Finally, You couldn’t re-provide me with information I needed so there’s no credit for you in Lulz dox either since the information was provided by PedoHunters (John Smith) because I clearly asked you for the BeenVerified Report which you never sent back because I had lost it, so I just went ahead and found the information myself without you, which I did through PedoHunters help which he provided and the OSINT and other stuff was all done by me too and not to forget that she ran away because of the dox.</p>\n\n<p>I only co-operate with peeps like you so I could get evidence to turn you in, guess what? That’s why Lulz even ran away. Haha! It’s undercover. Even the CP you saying I spammed, it was a FBI Technique I was using, but it clearly doesn’t mean I’m a pedo, I’m just doing what the feds did back when they hosted a CP site in the Clearweb, but in a different way, for the same purpose. Keep in mind that I’m a Certified Computer Forensic Investigator, Child Pornography is just one of the things I can investigate and have filed as evidence to be taken to the Court of Law using Forensic Tools as a First Responder to any Criminal Incident. I’ve reported over 5-6 Pedos so far to the Center for Missing and Exploited Children who I lured through that technique and never sold any content; I rest my case here, close this thread as I don’t wanna talk about this anymore. I'm done explaining everything. Ohhh! By the way, Mr. Egert, if you’ve got a problem, come to me via email. If only Brenton would have asked one of his Doxbin friends (Vape or Hyperlol )to show you the badge and the secret document cover I showed them, I think I sent it to him too (I didn’t send the whole doc, just the cover to prove he doesn’t know who he’s messing with, as sending the whole document would risk National Security since it’s secret), you could’ve known who exactly you’re messing with, you know. Anyway, like I said, end the debate now and if you have a problem then approach my email. I'm not gonna be on here anymore.</p>\n\n<p>Also, any evidence you try present here will be disregarded even by Law because of the following reasons, this is according to what I learnt from CompTIA on a lesson that concerned Incident Response and handling criminal evidence:</p>\n\n<ol style=\"list-style-type:decimal\"><li>Your evidence can be audited by anyone on here or you could’ve possibly audited it before even presenting it here.</li>\n<li>No Chain of Custody is signed by people who are allowed to see, present or preserve the evidence and when it’s exposed to the public, it isn’t secured if it’s exposed and brought out to the Public like how you’re doing (Evidence of any crime is meant to be kept confidential and handled by a First Responder in an encrypted file system and hashed as well).</li>\n<li>Evidence that doesn’t follow the correct order of collecting evidence in accordance to the NIST Incident Response Guide by a First Responder (Which is a guide made directly by the US Department of Commerce) cannot be considered as Evidence.</li>\n<li>Hashed doesn’t mean you can still bring it out to the public either when it’s meant to be kept confidential and only be seen by few people who signed a Chain of Custody (Even though the hashing is meant to protect the evidence from being tampered with)</li></ol>\n\n<p>So, if you ever claim to have evidence on anyone, never make such things public because you leave a large scope of that evidence never being accepted by the court of Law because of several reasons. If you think about it, even when a big company gets evidence of someone committing crimes, they’ll never make such a thing public, their first responder takes care of everything and once the arrest is carried out then they make it public and such investigations even take years, like it did with me and you on Dr. Deplorable, but that evidence is futile now since it’s public and I even doubt Dr is in prison because we made the evidence public on Doxbin. If we could’ve turned him in before putting the evidence out, he could’ve been gone, same goes for Lulz though she only ran away because that dox has power over her, not because the evidence is good to be presented to Court. Think about it. Here’s my last words before I call this debate off, it’s too late for you to do anything man. Just give up and start a new life, I have and I don’t need Doxbin or any of these other crap in my life either, I’ve become famous on Social Media too and I’m loving it. Think about it, if you start a new life, you won’t have to worry about all that stuff anymore and if you really wanna pursue life as an Investigator, you should just do things undercover and secretly, not bringing evidence out to the Public (This is how we know you don’t work for the Government like you claim), remember when I said I caught 5-6 pedos and sent a report to Center for Missing and Exploited Children recently, I never mentioned the names or other info because I know that’s meant to be secret for now. It was easy catching some of them too as CashApp showed their name too and they were even KKK when I further managed to get more evidence on them. It’s not hard, G; I only did Doxbin for a while to show you that it isn’t worth it, my plan wasn’t to be on Doxbin all my life, but to set an example that nothing good comes out of it, so yeah, 2022 was the year I decided to leave it because it’s not worth being a doxbiner for a person like me who can do better without Doxbin.</p>","editedAt":"2022-12-19T01:42:56+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"6850"}},"editedUser":{"data":{"type":"users","id":"6850"}},"discussion":{"data":{"type":"discussions","id":"140"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"49614"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"6850","attributes":{"username":"NutellaOsama","displayName":"NutellaOsama","avatarUrl":"https://drama.gg/assets/avatars/Da2yd4FRFAiWqcsg.png","slug":"NutellaOsama","joinTime":"2022-09-15T13:57:46+00:00","discussionCount":0,"commentCount":9,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-01-04T06:57:54+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"7004","attributes":{"username":"Young","displayName":"Young","avatarUrl":"https://drama.gg/assets/avatars/jjOfAwYfyJgg1Yl7.png","slug":"Young"}},{"type":"discussions","id":"140","attributes":{"title":"GratisVPS.host - \"it's not a scam\"","slug":"140-gratisvpshost-its-not-a-scam","isApproved":true}},{"type":"posts","id":"49614","attributes":{"number":37,"createdAt":"2022-12-21T04:54:28+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/140/36\" class=\"PostMention\" data-id=\"49600\">NutellaOsama</a> Bro this is from r/copypasta.</p> "},"relationships":{"user":{"data":{"type":"users","id":"7004"}},"discussion":{"data":{"type":"discussions","id":"140"}}}}]}