{"data":{"type":"posts","id":"49674","attributes":{"number":11,"createdAt":"2023-01-06T06:29:06+00:00","contentType":"comment","contentHtml":"<p>Look skidsk v2, drama.gg is dead. <strong>Nobody cares about your false accusations against NoAbuse as an organization or any staff members within it.</strong> I have sent screenshots of my pc's files in our Discord server (that for rightfully banned in for being a skid) to prove I don't use \"cracked\" TailwindUI templates. However, I will not send screenshots of invoices or anything like that as it's not legally required. And yes, I am alvapepsi and ItzScripts. I changed my name a while ago to be more so called professional unlike you clearly are. About the nulled whmcs I had, if you look at the date you can see that was on November 2022 (when I used to abuse and work with badsk which I've already admitted). Aswell as that Discord screenshot. I have completly valid proof of takedowns however ask yourself this, why would I share proof of something that I literally don't need to to some 11 year old kid on Discord? Also, I have removed the DMCA protection and added credit to TailwindUI on our website as I found out that is what your meant to do and I didn't know that before. And, we do not \"pretend\" NoAbuse is a company. NoAbuse currently stands as an organization. None of the websites I've took down are still up and if they are please provide screenshots as you don't even know what services we have taken down! When you say, \"is trying to get some attention\" that is another false accusation. By looking at it, your the one trying to get attention by making this drama.gg thread. At NoAbuse, our goal is simply to make the internet a better place.</p>\n\n<p>Regards,<br>\nNoAbuse</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"6975"}},"discussion":{"data":{"type":"discussions","id":"2094"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"6975","attributes":{"username":"alvapepsi","displayName":"alvapepsi","avatarUrl":"https://drama.gg/assets/avatars/Yz8WeIqCTodEnJvE.png","slug":"alvapepsi","joinTime":"2022-11-09T18:19:33+00:00","discussionCount":0,"commentCount":63,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-01-07T17:23:10+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":"go9zsmgYjqjrkg8L.jpg","cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"2094","attributes":{"title":"Lewis G. aka [ItzScripts, alvapepsi]","slug":"2094-lewis-g-aka-itzscripts-alvapepsi","isApproved":true}}]}