{"data":{"type":"posts","id":"49801","attributes":{"number":1,"createdAt":"2023-02-18T21:03:05+00:00","contentType":"comment","contentHtml":"<p>I’ll start off with the less-bad stuff: You may all know me as a now-former CEO of Galactiq/CrewCraft Hosting. This has been a ride, and I’m here to expose the truth behind what happens privately, and well, publicly.</p>\n\n<p>First of all, the fraud, or more specifically, tax fraud. While I was still at Galactiq, I learned many things, but this one just surprised me. He, as a 17 year old, is funneling money from Galactiq Hosting’s clients into his parent’s paypal. This is just obsurd. And not for the reasons you think, that alone is not worth explaining, but I’m guessing you know why he’s funneling it to his parent’s paypal…oh you guessed right, to avoid paypal’s taxes. Furthermore he claims he didn’t need to register the business as legal, then after a few more times of asking him, he cited a “Sole Proprietorship'' (according to Stripe of all things)<img src=\"https://drama.gg/assets/files/2023-02-18/1676753420-1863-screenshot-20221128-102703-f3912.jpg\" title=\"\"></p>\n\n<p>Furthering on this “Sole Proprietorship” he says that there’s nothing wrong with running an unregistered business…as long as you meet some requirements, which he does not (and can’t, as he’s underage). He also says that his income is under the IRS threshold, which yes it is, but I once again call to him not having a Business Tax ID, a Personal Bank account, and the fact that he’s underage. <br>\n<img src=\"https://drama.gg/assets/files/2023-02-18/1676753465-85800-unknown-abf52.png\" title=\"\"></p>\n\n<p>Here’s another screenshot showing that he has not registered (albeit it this is quite old, but he’s still not done it, go, check if you don’t believe me.)<br>\n<img src=\"https://drama.gg/assets/files/2023-02-18/1676753485-864189-unknown-c9624.png\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2023-02-18/1676753738-574050-img-2366-b2687.jpg\" title=\"\"><br>\n<img src=\"https://drama.gg/assets/files/2023-02-18/1676753753-254931-img-2365-1cd53.jpg\" title=\"\"></p>\n\n<p>Here he says he doesn’t need to file taxes, citing that sole proprietorship again (WHICH ONCE AGAIN, is according to Stripe)</p>\n\n<p>Now, that’s the main part of the actual tax fraud, but that is still fraud (and unregistered with no legal material other than a ToS and PP). Furthermore, you can see how defensive he gets when questioned about the before mentioned taxes, and tax ID. And yes, he does indeed threaten to sue a company for just dming him.</p> \n\n<p>You can dial him at +1 (616) 262-9380 or +1 (616) 301-2246 (however we don’t encourage it, and no, we’ll not be liable if you destroy his phone)</p>\n\n\n<p><img src=\"https://drama.gg/assets/files/2023-02-18/1676753776-602289-img-2367-0ee99.jpg\" title=\"\"><br>\nNow, about the Theft, well not really theft, but you’ll see what I mean. I’ll give a bit of backstory on this one. I joined CrewCraft in late 2021 and all was well, we had quite a few clients, however that’s where the issues began. Summer 2022, we started losing a lot of clients (something which I pointed out in our Group Chat, but he basically ignored it). During the same Summer, we were almost out of money, and we agreed to host all of our current customers on the server which I hosted in my area, without so much as asking for a penny, as I was expecting to get a 30% share when we went on the market (oh and no, the 12 USD i got paid throughout the 4-ish months isn’t payment). This went on for about 4 months, with me nagging Damien/Pengu/Max about it almost every single day (and him not doing anything). After those 4 months, we finally had a second server, but it was too late, we had lost around 15-20 of our customers. After a few months of CrewCraft barely living, Max/Damien/Pengu alongside Jeroen and Manu (the 2 founders of another small hosting company) decided to merge. I was not informed of this until it randomly came up in a convo, and it wasn’t even to inform me, it was about a name for the company. Now, this is where it basically went to hell. Very little progress was being made on attracting customers, our (well mostly theirs, this is the part where I started being phased out) main focus was to gain more servers, because Damien/Max was expecting 10USD/d of ads to bring us that many customers (he’s not said that directly, however it was obvious he thought ads would bring us hundreds of clients within a few days at most). After I started calling him out on both the negligence to get customers and the dumb server focus, I was “fired” (if you can even call it that) from Galactiq. Damien/Max cited disrespect, and I urge him to provide evidence of this when he finds this lovely thread.</p>\n\n<p>Now, after this Traven (whom will give his POV below) contacted me with a link of Galactiq’s blog regarding free servers, then I gave him some screenshots and he proceeded to dm max. He then proceeded to dm me and tried guilt-tripping me into thinking that my screenshots from the “confidential” chats (which didn’t include anything “confidential”) are supposed to be secret, which I do agree on to some level, but said screenshots did not include anything business-breaking as he tried to make it seem.</p> \n\n<p>I want to bring your attention back to the 4 months of unpaid server hosting (which cost me around 80 USD worth of electricity and internet). This is one of the biggest hurdles for me atleast, with him. And before you say anything, no I did not say I would keep it running free-of-cost. During these 4 months, CrewCraft was kept alive by only me, no matter what he says he could have done. He then proceeds to phase me out, making it seem like I was only a resource that kept quiet/didn’t know about his shenanigans &amp; gave him hardware in which he did indeed succeed.</p> \n\n<p>Now, he may say he “defended” me for months from Jeroen and Manu, however I did not receive anything about him defending me, or atleast asking me to act professional (which they themselves did overnight, without me knowing, which resulted in them making me seem like the bad guy).</p>\n\n<p>And finally for the backstory, after I was “fired” I was banned from all their Discords and removed from their records (even their “story” blog, that says something)</p>\n\n<p><img src=\"https://drama.gg/assets/files/2023-02-18/1676753811-952675-img-2362-25ee8.jpg\" title=\"\"></p>\n\n<p>Now I’ll give another screenshot. In this one he lies (as usual by now) and says he told me everything in this business was a risk, when he fetches me a message of that (and me seeing it, I can’t be blamed for an important message in a meme filled chat, which oh yeah, that’s what most of the “confidential” chat was, don’t believe me? Oh well, ask him to send screenshots of the chat from before September 2022, hell maybe even from before November 2022. He says there haven’t been clients on my system for a long time….that was the case for most of our servers, hell it still is, ask him about it.</p>\n\n<p><img src=\"https://drama.gg/assets/files/2023-02-18/1676753835-742278-img-2361-4f097.jpg\" title=\"\"></p>\n\n<p>Stage 2:</p> \n\n<p>The Uncovering</p>\n\n<p>Hi, im Sam, former “employee” of CrewCraft before it turned into Galactiq<br>\nPretty Much the only reason i was “hired” by Damien was the fact that i'm pretty good at covering up holes on websites and managing servers in general as a system administrator, to a certain point, i started suspecting Damien was doing shady stuff like buying a lot of nodes for no reason at all (at the time we had like 6-5 customers and he was already buying 6-5 used machines he could find on amazon), so i played along until Yeetster had a amazing idea to just “do a little trolling” and do no formal statement saying why i was fired, so yeah, damien and him locked me out of the nodes and that's the way i got fired, damien said “cope man, cope” and that's about it, but this is not my point, it's just some background story so you get on the context.</p>\n\n<p>A few weeks ago Yeetster realized that Damien was doing crapsh*t so he tried pointing it out to him, resulting in again, first a removal from all accounts AND THEN after 1-2 hours a statement explaining what happened etc.</p>\n\n\n<p>Allegations:<br>\n<img src=\"https://drama.gg/assets/files/2023-02-18/1676754024-696133-1.png\" title=\"\"><br>\nTo get this screenshots, we got access to their panel because damien apparently forgot to close his billing panel properly and the .env was exposed to everyone (yes, you can imagine the level of security their website has)<br>\n<img src=\"https://drama.gg/assets/files/2023-02-18/1676754061-958852-2.png\" title=\"\"><br>\n(password revoked now, but you get the idea if you are familiar with pterodactyl DB’s)</p>\n\n<p>I love the fact he says no billing information was accessed when in reality, just by that major security flaw we got access to almost the entire hosting service.<br>\n<img src=\"https://drama.gg/assets/files/2023-02-18/1676754091-460920-3.png\" title=\"\"><br>\n(paypal API proof for damien’s reference)</p>\n\n\n<p>In general, as you may have seen from screenshots above, Damien is not a person to trust for your personal data, passwords or even your billing details, but this is not it, the website has such security that it can literally be defaced by a 5 year old. <br>\n<img src=\"https://drama.gg/assets/files/2023-02-18/1676754165-282032-4.png\" title=\"\"><br>\nHe doesn’t even have an proper email server set up on his panel 🤣<br>\n<img src=\"https://drama.gg/assets/files/2023-02-18/1676754174-869351-5.png\" title=\"\"><br>\nSo yes, if someone needs more proof about this claims, i can provide you with demonstration data to prove the fact this website is insecure on dm’s at VolleierYouKnow#6004.</p>\n\n<p>Their discord is: <a href=\"https://discord.gg/MEMzSkeTTc\" rel=\" nofollow ugc\">https://discord.gg/MEMzSkeTTc</a></p> \n\n<p>I would be glad if you ask any question to the owner to hear his answers, our team has sent over 25 questions and all we got was excuses.</p>\n\n\n\n\n\n\n","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"4739"}},"discussion":{"data":{"type":"discussions","id":"2115"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"4739","attributes":{"username":"TheYeetster","displayName":"TheYeetster","avatarUrl":"https://drama.gg/assets/avatars/Bzg1ypsYeixFBMGH.png","slug":"TheYeetster","joinTime":"2021-10-29T17:14:08+00:00","discussionCount":1,"commentCount":146,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-03-12T21:57:04+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"2115","attributes":{"title":"Galactiq - A facade of Fraud and Theft","slug":"2115-galactiq-a-facade-of-fraud-and-theft","isApproved":true}}]}