{"data":{"type":"posts","id":"49909","attributes":{"number":1,"createdAt":"2023-02-19T22:41:42+00:00","contentType":"comment","contentHtml":"<p>There a lot of things I see a lot of hosting companies do and I'm sick of how they are run.</p>\n\n<p>Sure, a lot of them do provide good services and decent hardware, without abusing power and providing quality support to their customers....and some don't ;-; how rude</p>\n\n<p><strong>Support</strong><br>\nStop making your customers go to Discord for support, some of us don't want to be on Discord, or probably don't even know what Discord is. Sure, a lot of your customers may already have a Discord, but that doesn't mean you should make them join your server to get support.</p>\n\n<p>Instead, provide an internal option that doesn't involve your customer going to other platforms and joining groups, servers, or whatever. I can think of a few ways of doing this starting with a community option and another option to talk directly with trained support members.</p>\n\n<ol style=\"list-style-type:decimal\"><li>Live Chat and/or Over the phone<br>\nProvide a live chat widget in your panels where your customers manage their servers, this way if they need help they don't need to leave the panel or open a new tab to anywhere else. If you have the money and support members with good English speaking skills(or in other language), you can pay for a phone number that your company can use for your customers to call and get support over the phone.</li></ol>\n\n<p>For live chat, I recommend Crisp for high quality support.</p>\n\n<ol style=\"list-style-type:decimal\" start=\"2\"><li>Forums<br>\nIf your host has grown to have a wonderful and an inviting community around it, creating a forums would be a nice additional. This can be a good alternative place for customers to get help, by asking other customers about their experience and for help.</li> </ol>\n\n<p>For a forum software, I recommend selfhosting with something like NodeBB or you can do some research and look around.</p>\n\n<ol style=\"list-style-type:decimal\" start=\"3\"><li>Old Fashison<br>\nAt the least, please, do provide email support for your customers. The company I use to work for seems to of dropped email support, which I wasn't a fan of as I did prefer working with emails instead.</li> </ol>\n\n<p>Make sure the email provider you're using is fast and reliable. If you have the money, I highly recommend FastMail.</p>\n\n<p><strong>Train Your Support Staff</strong><br>\nYou should train your staff members to know the interface of your panel that customers will rely on to create and manager their servers along with features that it offers. You plan to add a new feature and add-on onto the panel, make sure your support staff members are trained for new additional these will bring.</p>\n\n<p>Your staff members should also be at least experience with the services that your host provides, commonly we do see most host in these areas offering servers for Minecraft and Discord bot hosting. So your staff members may need to know how to manage a Minecraft Java/Bedrock server along with experience in Discord bot hosting and keeping up to date.</p>\n\n<p><strong>Stop Offering So Many Services</strong><br>\nSome companies's supported service list are huge, providing support for games that your staff members probably never heard of and are probably not interested in, let alone they're probably not trained to help customers who are having trouble with it. Actually, most of the games and services on your list might not even get touched by your customers.</p> \n\n<p>Start out with only a couple things that are basic, perfect it, optimize it, and get better at it. Then you can think about adding more services in the future if your customers request it.</p>\n\n<p><strong>Don't be Cliche</strong><br>\nIf you plan to or are starting out on creating a new hosting company, please be more unique about your branding, your mission, and services. Make creative with your naming and your logo, maybe hire someone to create a logo for you.</p>\n\n<p>So, do avoid providing hosting for services like Minecraft, Discord Bot Hosting, along with other common option you see. There are already too many hosts that provides these options, so you need to go out there and provide hosting for other options. Maybe provide hosting option for stuff like media servers, matrix, Mastodon (Popular, I think), and more.</p> \n\n<p>Don't use overrated panels like Pterodactyl, Pufferpanel, etc. I'm just sick of seeing them over and over again. Some of the more successful hosts that you do see around today use their own panel and their own code. So, sit down and take the time to create your own panel. Don't know how? Just hire a developer who knows how. It's best that you have a decent backend and a sexy backend for your customers to enjoy and to have a smooth experience. Make sure to do case studies and improve your panel.</p>\n\n<p>On the subject of panels and your website; STOP USING TEMPLATES AND BOOTSTRAP! MAKE IT YOURSELF!!!<br>\nHire a frontend developer, like FalixNodes did with me, to build your landing page and your client panel. Make it unique with your branding.</p> \n\n<p><strong>Be More Prepared</strong><br>\nSpeaking of new companies that now starting up, it's best that you should prepare months in advanced. Make sure that your company provides a Terms of Services, Privacy Policy(Keep GDPR in mind), and other policies as needed.</p> \n\n<p>I've seen some companies go downhill quick because they didn't provide or have the proper documents for their customers to read. You can probably see some examples on drama.</p>\n\n<p>I would take a look here at Iceey's: <a href=\"https://drama.gg/d/89-whats-a-gdpr-a-tos\" rel=\" nofollow ugc\">https://drama.gg/d/89-whats-a-gdpr-a-tos</a></p>\n\n<hr>\n<p>Also check out:<br>\n<strong>I don’t want to log in to your website</strong> - <a href=\"https://www.theverge.com/2023/2/28/23618804/google-facebook-login-ads-web-design-hell\" rel=\" nofollow ugc\">https://www.theverge.com/2023/2/28/23618804/google-facebook-login-ads-web-design-hell</a></p>\n<hr>","editedAt":"2023-03-01T00:58:44+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"3377"}},"editedUser":{"data":{"type":"users","id":"3377"}},"discussion":{"data":{"type":"discussions","id":"2117"}},"likes":{"data":[{"type":"users","id":"2869"},{"type":"users","id":"7004"},{"type":"users","id":"7133"}]},"mentionedBy":{"data":[{"type":"posts","id":"50015"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"3377","attributes":{"username":"Korbs","displayName":"Korbs","avatarUrl":"https://drama.gg/assets/avatars/CUD5vV2bKVwuF8sd.png","slug":"Korbs","joinTime":"2021-04-12T21:09:34+00:00","discussionCount":1,"commentCount":29,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-04-23T00:59:26+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":"pJuk2IYynPvIGi76.jpg","cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"Pretty nice developer, who doesn't scam people like an idiot would :)","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"2869","attributes":{"username":"flaxeneel2","displayName":"flaxeneel2","avatarUrl":null,"slug":"flaxeneel2"}},{"type":"users","id":"7004","attributes":{"username":"Young","displayName":"Young","avatarUrl":"https://drama.gg/assets/avatars/jjOfAwYfyJgg1Yl7.png","slug":"Young"}},{"type":"users","id":"7133","attributes":{"username":"loyallyStubborn","displayName":"loyallyStubborn","avatarUrl":"https://drama.gg/assets/avatars/U7cIgMoj9ugWF93M.png","slug":"loyallyStubborn"}},{"type":"users","id":"3163","attributes":{"username":"FatGrizzly","displayName":"FatGrizzly","avatarUrl":"https://drama.gg/assets/avatars/iS888BblAzGJgvnV.png","slug":"FatGrizzly"}},{"type":"discussions","id":"2117","attributes":{"title":"I'm Sick of Hositng Companies and This Needs to be Taken Care of","slug":"2117-im-sick-of-hositng-companies-and-this-needs-to-be-taken-care-of","isApproved":true}},{"type":"posts","id":"50015","attributes":{"number":24,"createdAt":"2023-02-26T02:42:56+00:00","contentType":"comment","contentHtml":"<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/2117/1\" class=\"PostMention\" data-id=\"49909\">Korbs</a> Don't use overrated panels like Pterodactyl, Pufferpanel, etc. I'm just sick of seeing them over and over again. Some of the more successful hosts that you do see around today use their own panel and their own code. So, sit down and take the time to create your own panel. Don't know how? Just hire a developer who knows how. It's best that you have a decent backend and a sexy backend for your customers to enjoy and to have a smooth experience. Make sure to do case studies and improve your panel.</p></div></blockquote>\n\n<p><a href=\"https://drama.gg/u/Snyder\" class=\"UserMention\">@Snyder</a> please read stuff before replying. All i can see from Korbs's post is a self advertisment.</p>\n\n<p>From my perspective: he got fired, so he needs a new company to work with, hence he a made an informative advertisement.</p> "},"relationships":{"user":{"data":{"type":"users","id":"3163"}},"discussion":{"data":{"type":"discussions","id":"2117"}}}}]}