{"data":{"type":"posts","id":"49913","attributes":{"number":107,"createdAt":"2023-02-20T01:31:18+00:00","contentType":"comment","contentHtml":"<p>Oh dear, it's awesome to see Damien trying to protect himself from claims, so here I come with EVEN MORE INFORMATION to prove how bad his security is.</p> \n\n<p>First off, this is <strong>public information</strong>, I will be disclosing the sources of where I got this information in some of the following (of course there is some stuff I won't be able to show due to the nature of its appearance)<br>\n<strong>I'm welcoming any dm's from Damien</strong> if he wants to patch these security issues (his servers are on the edge of being exposed and have already been detected by a few security sites as breached by Russian/Chinese botnets)</p>\n\n<p>first, server IP's, this is public domain and pretty much everyone that can do nslookup can get this information, however, the really bad thing that proves their 0 knowledge on how to reinforce their firewalls (if they even use them) is this:</p>\n\n<p><img src=\"https://drama.gg/assets/files/2023-02-20/1676855597-581056-image.png\" title=\"\"></p>\n\n<p>if I was an attacker, the first thing that would happen if I have this information would be accessing exposed ports/etc,</p> \n\n<p>also to note that their ssh port is exposed AND THEY SUPPORT PASSWORD AUTHENTICATION<br>\nas of the information i have this is a server they mostly don't use, but you get the idea of what an attacker can do with this information, if it was another server, they have exposed ports with the real unproxied webservers, which are in most scenarios XSS vulnerable, unsafe, not made for production usage, etc (as I have seen, they mostly use ExpressJS for their internals which as you may guess, its a  non-production ready webserver)</p>\n\n<p>2nd<br>\nTheir billing panel is nice and kind of beautiful from the frontend, however, talking about the backend, I've used some code scanning tools and they have proven that it is vulnerable to a kind of attacks I won't disclose and other critical stuff (like literally hijacking access to their hosting service)<br>\nusing these attacks, we were able to infiltrate into their API which gladly exposed its .env that contained hetzner keys, paypal keys, and even panel keys, using this information, first, i tried to warn Damien by making him realize clearly the issues (i couldn't contact him on discord due to the fact im currently blocked),  sadly enough, this information ended in the wrong hands and there goes yeetster.</p>\n\n<p>3rd<br>\nHe's going defensive all out and i expect him to anyways<br>\nthe fact he tried saying that no billing information was leaked is just the tip of the iceberg, proving he does not even know how much information PayPal REST API has, the API was vulnerable to request forging so badly that trying some more urls, we managed to access pterdactyl's sql, yeah..... that's bad if you haven't realized yet, this information is not public and never will be due to the fact that it contains hashes of the passwords, but if Damien wants proof, I'm willing to send all I have on discord for his reference.</p>\n\n<p>This can be fixed with some easy iptables that literally a linux starter would know (heck, you can even use UFW)</p>\n\n<p>Pointing this out because I don't really wish him to be attacked in the future, hope he can solve this issue asap.</p>\n\n<p>Due to the way of these attacks, we may have deleted some logs from his servers for privacy but kept them so he can patch the bugs.</p>\n\n<p>Also, a kind message for Damien, when you're coding any critical or non-critical part of your websites, please use SonarQube or any other code scanning tool, even the smallest part of your website can become a security nightmare that exposes your entire server and if you use the same authentication on all your other servers, potentially, access to your entire service, since you're a hosting service, you should at least either have a bit of knowledge on cybersecurity, maybe even hire an expert, else please use any software that checks its security for any kind of possible exploits or use your's but ensure to test it and have an expert (or some code scanning utility) look at it before releasing it to the public, else, there can be a middleman without you knowing, gathering your customer's emails, etc.</p>\n\n<p>Cheers and hope you can solve this issues!</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"4808"}},"discussion":{"data":{"type":"discussions","id":"2115"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"49915"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"4808","attributes":{"username":"VolleierYouKnow","displayName":"VolleierYouKnow","avatarUrl":"https://drama.gg/assets/avatars/gUUFOjSXqfijg98a.png","slug":"VolleierYouKnow","joinTime":"2021-11-08T02:06:52+00:00","discussionCount":2,"commentCount":121,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-02-20T04:04:10+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"account disabled","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"7096","attributes":{"username":"Pengu","displayName":"Pengu","avatarUrl":"https://drama.gg/assets/avatars/1eQRNFMALLaeH1YR.png","slug":"Pengu"}},{"type":"discussions","id":"2115","attributes":{"title":"Galactiq - A facade of Fraud and Theft","slug":"2115-galactiq-a-facade-of-fraud-and-theft","isApproved":true}},{"type":"posts","id":"49915","attributes":{"number":108,"createdAt":"2023-02-20T02:18:04+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/2115/107\" class=\"PostMention\" data-id=\"49913\">VolleierYouKnow</a> Hi Voll! You should scroll up a bit and you'll see that I addressed literally every issue you just claimed. The API keys you got were from the old billing code not the new one. Secondly how do you expect us to SSH without an SSH port and third WE DO NOT HAVE PASSWORD AUTH. You can even ask Yeetster who will probably lie but we do SSH keys like smart people.</p>"},"relationships":{"user":{"data":{"type":"users","id":"7096"}},"discussion":{"data":{"type":"discussions","id":"2115"}}}}]}