{"data":{"type":"posts","id":"49941","attributes":{"number":2,"createdAt":"2023-02-22T16:21:03+00:00","contentType":"comment","contentHtml":"<p>I'd like to clarify the points made against Hostaris &amp; Optikservers.</p>\n\n<p>To begin with, when you reported these vulnerabilities about RCE we started working on a fix, however, this fix can not be released instantly as it has to be approved by Shadow who is OOF at the moment. <br>\n I have NEVER denied fixing these vulnerabilities, I would like to see Chirag's screenshot of me refusing (and not taken out of context)</p>\n \n<p>Additionally, we do actually ask the user for consent if you had a look at the app. A screenshot will be sent after this message.</p> \n\n<p>In regards to the peer2profit hash claim, at the time, we did not deem this necessary as it is extremely unlikely for someone to gain access to our CDN. Note that this software is coming onto 2 years old and a recode is in the works as I've mentioned to you a dozen times.</p>\n\n<p>Regarding the claim that we have a tracker in the app - this is literally an error-monitoring system <a href=\"https://sentry.io\" rel=\" nofollow ugc\">()</a> and it is used to track and resolve issues. This is standard in many apps if you cared to decompile them (oh wait you just decompiled ours due to a personal grudge so that won't happen)</p>\n\n<p>Regarding the situation with the hashed passwords - you sent one screenshot which was hugely taken out of context. The way our panel works is that we make a generated 16-digit user/pass combination and store that encrypted with AES-256. We believe this isn't insecure as the passwords are generated, and therefore, do not come under normal passwords. Of course, we hash actual passwords keyed in by the user but for generated passwords, we felt there was no need. As much as we believe they are secure, we are still prepping a change to this in the next release.</p>\n\n<p>The reason we patched the XSS issue was that that was actually a high-risk vulnerability. If you'd propose to use the vulnerability in our apps to your advantage, you would only affect yourself as if you were to change your Discord name and logged in on our app, you would only affect yourself - rendering this vulnerability low-risk (at least lower than the XSS issue). While we are still working on patching this, it is still not a huge issue.</p> \n\n<p>You did report the vulnerabilities to us, but I did not like you from the get-go. You always had something to say about our success and kept slandering us to your Discord friends. For that reason, I didn't thank you for the vulnerabilities as you had actually abused one of them for a whole hour to give people coins.</p> \n\n<p>Regarding Hostaris, you had NO right to include this in your thread as Hostaris is not associated with OptikServers and you know we have done nothing wrong on this part. You know exactly why we were temporarily banned from LowEndSpirit (which is being lifted on the 27th) as I had quite literally explained the whole situation to everyone in the group at the time, which you were in.</p>\n\n<p>Our reviews are down to the LowEndSpirit situation, one of which is actually from you which deems only 1 negative review on the site - which is pretty usual for a company.</p> \n\n<p>I'd also like to point out that the messages from Samuel are all a year or older which clearly suggests you really went digging for screenshots and shows you're desperate to bring us down for some reason. Samuel has agreed that the things he said in the past were not acceptable whatsoever and he has been working on that language.</p> \n\n<p>I would like to point out that you actually hit our Hostaris panel earlier this morning. You will deny it but you know you did it. We received a DDoS attack from an IP in India which after a quick DB search, was linked to Chirag's account. Very smart of you to hit us from your own broadband - an abuse report has been sent to Airtel regarding this.</p> \n\n<p>That's all my input and we will not accept further questions via \"drama.gg\",<br>\nJosh</p>\n","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"1768"}},"discussion":{"data":{"type":"discussions","id":"2118"}},"likes":{"data":[]},"mentionedBy":{"data":[{"type":"posts","id":"49942"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"1768","attributes":{"username":"J0SH","displayName":"J0SH","avatarUrl":"https://drama.gg/assets/avatars/9afJ85K2vKn5cwY7.png","slug":"J0SH","joinTime":"2020-08-31T00:21:07+00:00","discussionCount":8,"commentCount":368,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-07-26T16:05:46+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"2951","attributes":{"username":"Chirag","displayName":"Chirag","avatarUrl":"https://drama.gg/assets/avatars/EBu92nGgi2Y9tYOD.png","slug":"Chirag"}},{"type":"discussions","id":"2118","attributes":{"title":"J0SH#9586 and samm#9400 | OptikServers, HostAris","slug":"2118-j0sh9586-and-samm9400-optikservers-hostaris","isApproved":true}},{"type":"posts","id":"49942","attributes":{"number":3,"createdAt":"2023-02-22T16:24:28+00:00","contentType":"comment","contentHtml":"<blockquote class=\"uncited\"><div><p><a href=\"https://drama.gg/d/2118/2\" class=\"PostMention\" data-id=\"49941\">J0SH</a> give people coins.</p></div></blockquote>\n\n<p>ooh yeah, 1 coin is worth so much right ahahhaha. OMG NO I GAVE EVERYONE 1 single coin, what's gonna happen now, the economy is ruined</p>\n"},"relationships":{"user":{"data":{"type":"users","id":"2951"}},"discussion":{"data":{"type":"discussions","id":"2118"}}}}]}