{"data":{"type":"posts","id":"49987","attributes":{"number":15,"createdAt":"2023-02-23T19:34:18+00:00","contentType":"comment","contentHtml":"<p>I 100% agree with you Korbs. Hosting companies that use discord as their main place for announcements, support, etc are not great. I think hosting services should start posting announcements on their client area/ website/panel. Most hosts I know have competition on having the most members on their discord server. Like what is the point of that, probably 1/2 of them don't even use it as people know alts. There does need to be a change, there are no issues with having a discord server, just don't make people rely on it. Just use a discord server as a community where people can hang out and talk about their servers or something. There are many client area free hosts used such as Dashactyl, Faliactyl, qwakactyl, Reliactyl, Heliactyl(Badsk) &amp;, etc. I suggest people use REDACTED(Releasing Soon!)</p>\n\n<p>There are many hosts that don't rely on discord servers, PebbleHost, ApexMinecraftHosting, Aternos, PloudOS, and Shockbyte, the list can go on forever.</p> \n\n<p>Going onto services as Korbs said, it is understandable as to why free hosts run by 13+ year-olds have so much software such as NodeJS, Python, Code-Server, Minecraft, Bungee, FiveM, and more. I think only paid hosts should have many options. Free hosting services can't afford big scaled servers and get pressured by members asking for Asia Node Please, America Node Please, and India Node Please. If you are gonna beg you might as well buy from a paid hosting service.</p>\n\n<p>Support needs to be in a range, why discord support? I have nothing else to say about it.</p>\n\n<p>Being prepared. Of course 100%. There are so many hosts thinking they can start of with 1 Node for the service. Stupidness. You need to have at least enough money to last 1 year. Depending on where you buy your servers from, could be £4000 - £20,000. Preparation is important before releasing hosts. My friend GhostLoad says to make a structure for the staff. I don't know if you know what CloudMC is, it was a host I worked for last year that shut down in like 2 months. Every minute there is either a promotion or demotion, in the owner role, the developer role, etc. Jesus my brain was dying watching that happen.</p>\n\n<p>Ahh, it is so funny on how hosting services use pre-made tailwindCss / Bootstrap templates. If you can't make one get a developer as Korbs said,  use Figma to design and send it to the dev, I am sure he can do it for you, or can they? Ye hosts don't care if they can code or not, they just em the role and are done. Or design on Figma and use Figma community plugins and convert to HTML and CSS.</p>\n\n<p>If you gonna be a Skid, and abuse server location every time a free trial ends and user data gets lost, or you're using German hosting services using Ibans that are not yours. Just don't make a service.</p> \n\n<p>Oh my god training, free hosts without trained support staff, I might as well search on youtube than ask them for help. I am not going to name and shame here, I made tickets asking for help, I did not actually need help, I asked, \"Hey how do I update my server to 1.16.5, currently, my server is on version 1.16.\", the response I got, \"Hey there, I am not sure about your question.\" Like WTF man? I bet a 7-year-old could answer that.</p>","editedAt":"2023-02-24T00:56:25+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"6973"}},"editedUser":{"data":{"type":"users","id":"2966"}},"discussion":{"data":{"type":"discussions","id":"2117"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"6973","attributes":{"username":"Snyder","displayName":"Snyder","avatarUrl":"https://drama.gg/assets/avatars/szZFny8Sqy32xb9Q.png","slug":"Snyder","joinTime":"2022-11-09T16:29:48+00:00","discussionCount":0,"commentCount":32,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-08-18T22:49:42+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"2966","attributes":{"username":"Sydney","displayName":"Sydney","avatarUrl":"https://drama.gg/assets/avatars/waltt2V7SGxbsOnW.png","slug":"Sydney"}},{"type":"discussions","id":"2117","attributes":{"title":"I'm Sick of Hositng Companies and This Needs to be Taken Care of","slug":"2117-im-sick-of-hositng-companies-and-this-needs-to-be-taken-care-of","isApproved":true}}]}