{"data":{"type":"posts","id":"5343","attributes":{"number":212,"createdAt":"2021-01-27T06:50:47+00:00","contentType":"comment","contentHtml":"<p>TMKC Said: Here's the thing.  As we explained in our private messages between you, me, Jay and Sloth, we provided all evidence needed to win the case.</p>\n\n<p>Yes, Jay could have done a better job handling the situation, but it still does not explain the fact that what Alpha did was acceptable to any degree. He wrote a crapton of fake reviews on both TrustPilot and WinterHoax.  We managed to get a ton of them removed of TrustPilot with the help of their staff that agreed that it was fake reviews.</p>\n\n<p>The original \"SMP\" server Alhpa had was designed using Jay's discord template and it even used our name to some degree, and Jay owned 50% of the entire Discord.  He took back what was his by rights.<br>\nHe took away his template. He never banned people or kicked, only deleted the channel.  If he really wanted to, he could ban everyone as well.</p>\n\n<p>Alhpa then went to our WHMCS portal and decided to remove and rename all of our packages, which took us a long time to restore.<br>\nAlpha was fired from Navo in the beginning for breaking staff rules.  After he was fired, Jay took back what was his.<br>\nAlpha is good at manipulating people, that is the reason why people are arguing with him.  I'd say about 85-90% of reviews and comments about Navo are fake. We only have 30 people in our database, and maybe 2 or 3 are from WinterHoax, and none of them have any services on their account. They never even USED the service, so how would they know if it was a scam?</p>\n\n<h2>And this is my response:</h2>\n<p>Firstly NONE of the reviews were fake , I removed all of them by hand not \"staff\" removing them</p>\n\n<p>Secondly The Smp was designed using my old servers' template, I didnt use the name of Navohosting to any degree, only the Versatile name that wasn't even original so he didn't own it at all lmfao <a href=\"https://versatile.host/\" rel=\" nofollow ugc\">https://versatile.host/</a> , I didnt take his template, he banned everyone<img src=\"https://winterhoax.com/assets/files/2021-01-27/1611729939-418440-image.png\" title=\"\"><br>\n, deleted everything and yeah. He didnt own more than 10-15 procent of the smp, he only owned the network<br>\n(And remember, its still not fixed)<br>\nThen 10 HOURS later I went to the portal and added a few blank products, which they fixed in half an hour<br>\nI was fired because TMKC came lmao, then brang those \"staff rules\" , I know that because he could have done it earlier,plus he took the network, which was his but in any single degree the SMP was MINE</p>\n\n<p>I never manipulated or even tried to, you have done all the manipulating since the bloody beggining, and you can look at this whole thread and agree, Most of the reviews from navo are from Non-ex clients, or even current clients. Plus they might have gotten a free bot hosting and saw how much it sucks.</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"2993"}},"discussion":{"data":{"type":"discussions","id":"154"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"2993","attributes":{"username":"Detective_Alpha","displayName":"Detective_Alpha","avatarUrl":null,"slug":"Detective_Alpha","joinTime":"2021-01-17T14:47:38+00:00","discussionCount":3,"commentCount":124,"canEdit":false,"canDelete":false,"lastSeenAt":"2021-03-30T11:18:54+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"154","attributes":{"title":"NavoHosting-Scammers-Griefers-TiltedHost Resellers","slug":"154-navohosting-scammers-griefers-tiltedhost-resellers","isApproved":true}}]}