{"data":{"type":"posts","id":"5665","attributes":{"number":92,"createdAt":"2021-02-01T23:17:35+00:00","contentType":"comment","contentHtml":"<p>Where do I even start. I was totally unaware of any of this and was told about century from a friend and decided I was going to get a fiveM server for GTA V Online, and saw they had addon options which included eup, 600+ cars and 100+ scripts. I know the owner of the eup She is reselling and know for a fact She has no resell rights because I've spoken with the developer about it at length so I purchased her fiveM 4 pack and got the addon scripts and she told me it takes 24-48 hours to have them added but they'd have them added within 1-2. I should note that she told me that they offer trial periods which she originally said was 7 days and then that quickly changed to 2 days.</p>\n\n<p>So I purchased My server, and waited about 12 hours and still no scripts were added so I went to go message her on discord and it said I couldn't message her than out of nowhere I get a friend request from her and she claims she never blocked me now mind you I had made a post in the general chat of the century hosting discord where her and her staff laughed at my posts and asked if I had made a ticket on her site which I had done and it was ignored. So I put a claim in to paypal to get a refund at which point she told me I wasn't going to get my refund and I said you wanna make a bet and she said bet you're not getting your refund at which point I didn't care to hear whatelse she had to say so I removed her from my friends list.</p> \n\n<p>I went to login to century and it said my account was suspended so I posted all my proof and screenshots to paypal, and they waited for her to respond which she never did so paypal took it upon themselves to change the case type and to escalate it and I woke up this morning to my case being approved and my refund being issued.</p>\n\n<p>Then I looked in my email only to find a new invoice for a month of service which  I had just paid for one a couple days ago.</p> \n\n<p>I'd like to add that She is still using the logo that mtt sent her DMCA removal warning for. and in the last 16 hours she has tried to add me to discord about 8 times and has threatened my best friend telling him she has his ip as if she is going to hack him or something.</p> \n\n<p>NO ONE SHOULD DO BUSINESS WITH CENTURY HOSTING OR CENTURY DESIGN OR HAVE ANYTHING TO DO WITH HAYLEE WATZON OR HOWEVER THE HELL YOU SPELL HER LAST NAME. SHE LITERALLY TOOK MY MONEY, REMOVED ME FROM THE DISCORD SERVERS, SUSPENDED MY SERVICES ON THE CENTURY WEBSITE AND THOUGHT SHE WAS GOING TO KEEP MY MONEY AND GET AWAY WITH IT AND THEN SENDS ME A NEW INVOICE THINKING IM GOING TO BE STUPID ENOUGH TO PAY FOR IT? NAHH.</p>\n\n<p>HERE IS THE LOGO THAT IS BEING SENT OUT IN THE EMAILS THEY SEND OUT WHICH I READ ABOUT THAT SHE HAS NO RIGHT TO USE...</p>\n\n<p><img src=\"https://winterhoax.com/assets/files/2021-02-01/1612221221-922440-centurylogo.jpg\" title=\"\"></p>\n\n<p>if you look on the Century Website the phone number that is listed is totally different than what is listed on paypal...</p>\n\n<p><img src=\"https://winterhoax.com/assets/files/2021-02-01/1612221370-655593-cwnturysellerinfo.jpg\" title=\"\"></p>\n\n<p>I'll be posting more of my screenshots once I get the chance to edit my name out of them for privacy reasons but anyone considering using Century PLEASE I BEG YOU SAVE YOURSELF THE HASSLE AND STRESS!</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"3077"}},"discussion":{"data":{"type":"discussions","id":"147"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"3077","attributes":{"username":"gothicflufflepuff","displayName":"gothicflufflepuff","avatarUrl":null,"slug":"gothicflufflepuff","joinTime":"2021-02-01T22:55:19+00:00","discussionCount":0,"commentCount":15,"canEdit":false,"canDelete":false,"lastSeenAt":"2021-02-10T04:40:46+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"147","attributes":{"title":"Century Hosting | Watzon","slug":"147-century-hosting-watzon","isApproved":true}}]}