{"data":{"type":"posts","id":"6500","attributes":{"number":163,"createdAt":"2021-02-13T09:40:11+00:00","contentType":"comment","contentHtml":"<p>Hello all. My name's vijay, and I've been around holo hosting, and century hosting ever since everything started, and i've seen everything, and all the accusations, and all the things going on.<br>\nI am first off, extremely glad this post exists exposing important things Haylee Watzon has done to customers at century hosting. Second I am glad the people who I still know, mtt, jen, shroom, saml, i've had good ties with them, made the effort to make this post, and it has now gotten over 2,400 views. Which is amazing.</p>\n\n<p>I'll explain my side of the horror story now. Not bit by bit, but just events that have happened to me he whole time I was involved in century hosting/Holo Hosting</p>\n\n<p>Initially joined holo hosting as staff, ran tickets, became administration, created servers, everything went amazing. JustinTK, also known as TMC, ( who is now long gone ) proceeded to fuck over holo hosting, resulting in deep pockets of loss for Jen. At the time, Jen was the sole owner of Holo Hosting.</p>\n\n<p>Jen being at a stalemate had trusted watzon to pay off bills for Holo Hosting to continue and keep the continue alive. A merger happened, it became Century hosting, a whole rework, site made by jaryn etc.etc. everything was done well. I had requested administration access as usual, but obviously, watzon has not provided that, with the fact that \"she doesn't trust me\", when i've been around before she even existed xD</p>\n\n<p>Now, it proceeds to more fights between Jen and Watzon about VPS's not being setup, improper management, I casually watch by the side, trying to calm either parties down. At this point, Jen had made a mistake of transferring discord ownership of the discord to Watzon, which was the first big mistake. What proceeded then was total dominant control over discord, and eventually the servers associated. And then came the point, where it was only century hosting, and jen is no longer allowed to be involved.</p>\n\n<p>I still stay as staff, but am denied every single permission in the company, no perms to access panel as support operator, no access to WHMCS billing, and the only thing I could do was help in discord tickets, which were so braindead anyway. <br>\nProceeding, I kind of lost hope for the company. Then on one fine day, I get accused of leaking information. You know what I leaked? An announcement from century hosting, with watzon saying not to be friends with jen -_- That's literally it. <br>\nThen I was accused ONCE AGAIN of leaking server data to people, when I couldn't even access shit? Hmm, funny indeed to see. At that point, I was just like screw this shit, I stayed as a member because it was fun to watch the probems watzon goes down with. <br>\nFew weeks later i'm reinstated as staff ( I wanted to understand what in gods' name was going on with the company ). This time it's the same type of access, just tickets. I complain that i don't have more access and the repsonse is always \"Yeah well you don't do anything anyway\". At that point i didn't want to try and argue more.<br>\nWatzon also claimed that she pays staff, but then later on said \"I can't pay because of legal issues\", I literally pulled up the minimum working age in India ( where I live ) and showed it to her, and she just said \"Well it's not allowed.\" I mean she had no argument to that.<br>\nAlso got screamed at in a call for \"leaking data\" by her and then saying i was forever banned from century lmao.</p>\n\n\n<p>Today, I rejoined century hosting discord to see what was going on, and it was silent as ever. I left after reading this article now. Watzon doesn't think straight. She doesn't even know what she's saying from time to time. It's a horror to deal with watzon these days. Not worth my time.</p>\n\n<p>That's my time at holo/century in a nutshell. Hope anything i've said gives anyone a sense of idea what i've done. <a href=\"https://drama.gg/u/Jen\" class=\"UserMention\">@Jen</a> let's catch up. I want to learn more.</p>\n\n<p>Peace</p>\n\n","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"2849"}},"discussion":{"data":{"type":"discussions","id":"147"}},"likes":{"data":[{"type":"users","id":"2775"}]},"mentionedBy":{"data":[{"type":"posts","id":"6517"},{"type":"posts","id":"6519"}]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"2849","attributes":{"username":"vijaypondini","displayName":"vijaypondini","avatarUrl":"https://drama.gg/assets/avatars/502nxgrYlal8kUtg.png","slug":"vijaypondini","joinTime":"2020-10-01T05:41:30+00:00","discussionCount":0,"commentCount":12,"canEdit":false,"canDelete":false,"lastSeenAt":"2021-02-20T10:52:43+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"users","id":"2775","attributes":{"username":"onyx","displayName":"onyx","avatarUrl":"https://drama.gg/assets/avatars/4FIfyyg630q4VoZp.png","slug":"onyx"}},{"type":"users","id":"3108","attributes":{"username":"CEOCenturyHosting","displayName":"CEOCenturyHosting","avatarUrl":"https://drama.gg/assets/avatars/eMqNxpHbKsbjqH4R.png","slug":"CEOCenturyHosting"}},{"type":"discussions","id":"147","attributes":{"title":"Century Hosting | Watzon","slug":"147-century-hosting-watzon","isApproved":true}},{"type":"posts","id":"6517","attributes":{"number":165,"createdAt":"2021-02-13T18:36:18+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/126/138\" class=\"PostMention\" data-id=\"6500\">vijaypondini</a> Well, I determine that's a deception from top to bottom you spam me for invites following kicks you then you delete your messages of begging to be invited back to Century. You don't operate a corporation including you are not in control Sive to run a firm because of the simplistic reality you don't have good characters abilities you believe that you are constantly correct the day after Jen sold ownership of Holo yourself Jayen furthermore Jen &amp; Mtt &amp; Shroom were banned due to relationship with Jen after showing private chats you were only yonder to plead for money which you always arranged sometime out of your day to inquire. I was in Century for about a week Holo was breaking at its period. I was brought into holo to preserve the firm aka with financiers for which I settled 99.9% of all financial responsibilities bedsides a 3 dollar Cpanel simply before you came back after your initial discharge from Century Samco aka Co-Founder rehired you. I declared that I didn't require you beyond more durable 8 1/2 days after you send me a letter about how we didn't get that many MC Clients which we arranged people just didn't have questions then you demanded to be our financial advisor I'm not giving anyone access to my family millions so you want me to give you access to our money source which I'm not gonna give a bankrupt teenager admittance to my values that I established into Century Jen Ex CEO was fighting to keep Holo operating as you as his Financial Advisor haha by renting servers from other companies. Since he's no longer apart of my company I went out and paid for a dedicated server including then tunneled them over OVH hehe Century may not be the Best corporation for some people but that's their judgment moreover I can't change that although I'm dam certain that I'm not gonna pay kids to help another kid run their company hehe comparatively well as begging to be unbanned and begging to be my Financial Advisor. I think have seen some people say that I should close Century but I will not close it not today not tomorrow maybe in the future but that's not this moment I will not give up on my Current clients. <img src=\"https://winterhoax.com/assets/files/2021-02-13/1613239903-343476-image.png\" title=\"\"><br>\n<img src=\"https://winterhoax.com/assets/files/2021-02-13/1613239922-254529-image.png\" title=\"\"><br>\n<img src=\"https://winterhoax.com/assets/files/2021-02-13/1613239946-779920-image.png\" title=\"\"></p>\n\n"},"relationships":{"user":{"data":{"type":"users","id":"3108"}},"discussion":{"data":{"type":"discussions","id":"147"}}}},{"type":"posts","id":"6519","attributes":{"number":167,"createdAt":"2021-02-13T18:39:12+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/126/138\" class=\"PostMention\" data-id=\"6500\">vijaypondini</a> as well as the site wasnt made by Jaryn it was a paid theme by me aka 72.97</p> "},"relationships":{"user":{"data":{"type":"users","id":"3108"}},"discussion":{"data":{"type":"discussions","id":"147"}}}}]}