{"data":{"type":"posts","id":"8333","attributes":{"number":8,"createdAt":"2021-03-09T22:15:44+00:00","contentType":"comment","contentHtml":"<p><a href=\"https://drama.gg/d/210/1\" class=\"PostMention\" data-id=\"6699\">EmeraldMike</a> Could you please explain to me what is wrong with using a WHMCS theme and if you are not talking about that then please explain to me what template you are referring to. The game servers were not in the full release as they were in BETA which is made very clear to you especially as I believe you are in the Discord. They were never linked to by us officially and where never listed on the main categories on the front page until fully released, as such the only way you could have really known about them was is if you explored the website extensively or were linked to it in the BETA program provided by us.</p>\n\n<p>We had two weeks in early February when the sponsorships incoming were far outnumbered those we could accept at the time so we gave them 2 simple option the first of which was they could close the ticket and either try again another day or go to someone else, the second of which was to wait in a clearly stated queue that was referenced by a message sent to all of them individually.</p>\n\n<p>We stated that the more sponsorships we have the better simply because any business will tell you that more general exposure be that in the form of a sponsorship in this case is generally a good thing.</p>\n\n<p>The sponsorship manager is there to keep track of the sponsors in the queue and as such they are responsible for giving people the unfortunate news that they cannot be accepted at this time.</p>\n\n\n<p>The rules are there as stated because staff members were complaining that their time was being wasted by people who open tickets as a troll and they would far rather use that time to help people who genuinely need help.</p>\n\n\n<p>We request that all members speak in English in the public channels as explained in the channel description as we can only provide higher technical support and talk to those we can speak the same language, this is also for moderation purposes as we need to speak the same language to understand what people are saying. Some staff members do occasionally translate for us however this is only upon request.</p>\n\n<p>If you have anything else you would like an explanation on then please feel free to discuss this in a ticket within the Discord server you are currently still a part of.</p>","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"3194"}},"discussion":{"data":{"type":"discussions","id":"210"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"3194","attributes":{"username":"Reddog2904","displayName":"Reddog2904","avatarUrl":"https://drama.gg/assets/avatars/AiiFtSCxxJBYOSHc.png","slug":"Reddog2904","joinTime":"2021-03-09T21:09:43+00:00","discussionCount":0,"commentCount":8,"canEdit":false,"canDelete":false,"lastSeenAt":"2021-03-12T16:30:49+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"210","attributes":{"title":"SpringNodes","slug":"210-springnodes","isApproved":true}}]}