{"data":{"type":"posts","id":"8525","attributes":{"number":24,"createdAt":"2021-03-12T12:31:38+00:00","contentType":"comment","contentHtml":"<p><strong>ALTERATIONS TO THE TERMS AND CONDITIONS</strong></p>\n\n<p>These terms are blatantly generated, they don't regulate the use of the services in regards to hosting, you need to prohibit certain things which the law requires you to. the <strong>Prohibited Use</strong> section only enforces the website's prohibited use, and wouldn't be sufficient for hosting, different sector different requirements.</p>\n\n<p>Cited is <strong>Introduction</strong>, Sec 1).</p>\n<blockquote class=\"uncited\"><div><p>\"Please read these terms and conditions carefully, as they affect your legal rights. Your agreement to comply with and be bound by these terms and conditions is deemed to occur upon your first use of our Products or Services\"</p></div></blockquote>\n\n<p>They aren't bound by anything, the contract can't be enforced and you may be dealing with adolescents, depending on the governing factor.</p>\n\n<p>Cited is <strong>Limitation of Liability</strong>, Sec 31.2)</p>\n<blockquote class=\"uncited\"><div><p>\"2.     loss or corruption of any data, database or software;\"</p></div></blockquote>\n  \n \n<p>Depending on the citizenship of your client(s); the location of registration and governing, by any organization within the agreement, are there specific laws for the aforecited. As an example is the Information Commissioner's Office of the UK which sets specific regulations on dataloss and breaches, within, to and or by companies operating in the UK. You must report a breach within 72 hours of occurrence, and believe me, you will be liable. Furthermore by the EEA citizenship, if may be, of one client of yours are you required to follow and enforce the GDPR, which by Article 24, the first section. (Art. 24.1,1) states;</p>\n\n<blockquote class=\"uncited\"><div><p>\"Taking into account the nature, scope, context and purposes of processing as well as the risks of varying likelihood and severity for the rights and freedoms of natural persons, the controller shall implement appropriate technical and organisational measures to ensure and to be able to demonstrate that processing is performed in accordance with this Regulation.\"</p></div></blockquote>\n\n<p>And by Article 32, first section, point <em>b</em>. (Art. 32.1 b.);</p>\n\n<blockquote class=\"uncited\"><div><p>\"the ability to ensure the ongoing confidentiality, integrity, availability and resilience of processing systems and services;\"</p></div></blockquote>\n\n<p>And by Article 33, the first section and including both subsections. (Art. 33.1,1);</p>\n\n<blockquote class=\"uncited\"><div><p>\"1. In the case of a personal data breach, the controller shall without undue delay and, where feasible, not later than 72 hours after having become aware of it, notify the personal data breach to the supervisory authority competent in accordance with Article 55, unless the personal data breach is unlikely to result in a risk to the rights and freedoms of natural persons. 2. Where the notification to the supervisory authority is not made within 72 hours, it shall be accompanied by reasons for the delay.\"</p></div></blockquote>\n  \n <p>Cited is <strong>Your rights</strong>, Sec 19)</p>\n \n <p>As your contract is governed by the United Kingdom the ICO, aforedefined, to do business within the UK whereby you collect, store, process or share data are you required to state an office of a Data Protection Officer or DPO. The DPO should not intervene with regular contact details, as they're of the upmost confidentiality and information shared by the parties (DPO and enquirer) should not be collected and processed as per the standard of normally obtained data. The DPO may receive from the enquirer request of right utilization by the UK GDPR, GDPR, CCPA or any of the sort, and he must provide a form or something of template to fill with accurate information and proof to confirm identity and act upon the enquirer's request. <strong>SEE GPDR ARTICLES 12-23</strong></p>\n \n <p><strong>NOTE</strong></p>\n \n <p>Although there may be errors here, I see that you are generally trying to operate a legitimate business, <strong>that doesn't mean the thread should be closed</strong>, but this seems to be going in the right direction.</p> \n \n <p>I also may add something about your privacy policy and or other legal documents.</p>","editedAt":"2021-03-12T12:35:45+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"56"}},"editedUser":{"data":{"type":"users","id":"56"}},"discussion":{"data":{"type":"discussions","id":"210"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"56","attributes":{"username":"Iceey","displayName":"Iceey","avatarUrl":"https://drama.gg/assets/avatars/A21zcRFQYnZkfY0E.png","slug":"Iceey","joinTime":"2020-08-01T13:26:54+00:00","discussionCount":7,"commentCount":360,"canEdit":false,"canDelete":false,"lastSeenAt":"2023-05-08T21:41:00+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":"Yzna5ygEyST8shW3.jpg","cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":"infant bully","canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"210","attributes":{"title":"SpringNodes","slug":"210-springnodes","isApproved":true}}]}