{"data":{"type":"posts","id":"991","attributes":{"number":17,"createdAt":"2020-08-14T21:17:34+00:00","contentType":"comment","contentHtml":"<p>#1. WHMCS Nulled: Our WHMCS installation has been valid since we originally started the company as lamehosting.com. The issue that arose was our IP for our installation changed which caused our license to appear as invalid. Here is a screenshot of our invoices on WHMCS.com: <a href=\"https://i.phxno.de/C0R3cxKZJQ.png\" rel=\" nofollow ugc\">https://i.phxno.de/C0R3cxKZJQ.png</a></p>\n\n<p>#2. Health condition: Yes, I do have a health condition that affects my heart which is why I am on disability and I stay home. I am not going to post photos of proof of my diagnosis for personal reasons.</p>\n\n<p>#3. Business partners: Originally the hosting company started under lamehosting.com and Lame, LLC, formed in Texas first, then moved to California, my business partner was the original owner of the Lame, LLC and found it wasn't in his best interest to continue using the Lame name for the company and we parted ways. Once that happened another associate and I formed Gray Matter Technologies which is based out of Wyoming. This is where people may be confused that my business partner left but the partner only changed.</p>\n\n<p>#4. DDoS Protection: Yes, the two hosts I use do not actively advertise that they offer a specific number for DDoS protection but based on previous attacks we've seen, we were comfortable stating that our servers were capable of handling 20Gbps DDoS attacks, after review of this, we have decided that this will be removed shortly from the website as we do not actually know the specific value and feel that it is dishonest towards our customers.</p>\n\n<p>#5. Node Utilization: Yes, our nodes do not have high utilization, this is due to a spike in customers we saw originally which caused us to purchase more nodes than necessary. Why do we continue to operate the nodes? We acquire and lose customers each day which causes fluctuation in the amount of users assigned to each node and we cannot consolidate customers every time a node isn't 100% allocated. Here are our nodes and how our customers are spread across the nodes: <a href=\"https://i.phxno.de/IdnV4AXWwT.png\" rel=\" nofollow ugc\">https://i.phxno.de/IdnV4AXWwT.png</a></p>\n\n<p>#6. Reddit Vote Manipulation: Yes, positive posts were made about our company and votes were manipulated to bring the posts to the top. We have speculated that this could have been a previous staff member or even another host that had also started selling at the same time but we will not be commenting on it as we do not have concrete proof of who did it.</p>\n\n<p>No further comments will be made.</p>","editedAt":"2020-08-14T21:25:36+00:00","canEdit":false,"canDelete":false,"canHide":false,"canLike":true,"canFlag":true,"isApproved":true,"canApprove":false,"canReact":true},"relationships":{"user":{"data":{"type":"users","id":"86"}},"editedUser":{"data":{"type":"users","id":"86"}},"discussion":{"data":{"type":"discussions","id":"42"}},"likes":{"data":[]},"mentionedBy":{"data":[]},"reactions":{"data":[]}}},"included":[{"type":"users","id":"86","attributes":{"username":"phoenixnodes","displayName":"phoenixnodes","avatarUrl":null,"slug":"phoenixnodes","joinTime":"2020-08-14T21:15:51+00:00","discussionCount":0,"commentCount":1,"canEdit":false,"canDelete":false,"lastSeenAt":"2020-08-24T02:00:26+00:00","canSuspend":false,"canEditPolls":false,"canStartPolls":true,"canSelfEditPolls":true,"canVotePolls":true,"cover":null,"cover_thumbnail":null,"canSetProfileCover":false,"canEditOwnNickname":false,"bio":null,"canViewBio":true,"canEditBio":false},"relationships":{"groups":{"data":[]}}},{"type":"discussions","id":"42","attributes":{"title":"PhoenixNodes | Tony | Sketchy, if not scummy.","slug":"42-phoenixnodes-tony-sketchy-if-not-scummy","isApproved":true}}]}